[
  {
    "id": 1,
    "questionDe": "(s4) Welche grundlegenden graphischen Elemente werden in 2D und 3D verwendet?",
    "questionJa": "2Dおよび3Dにおいて使用される基本的なグラフィック要素にはどのようなものがあるか？",
    "answerDe": [
      "2D: Punkte (Pixel), ebene geometrische Figuren (Kreise, Ellipsen, Quadrate, Rechtecke, Polygone), Linien (gerade, gebogen, Linienzüge)",
      "3D: (Ober)-Flächen (eben, gekrümmt), Volumina (Kugel, Ellipsoid, Zylinder, Torus, Würfel, Quader), Linien (meist Zylinder-förmig)"
    ],
    "answerJa": [
      "2D：点（Pixel）、平面の幾何学図形（円、楕円、正方形、長方形、多角形）、線（直線、曲線、折れ線）",
      "3D：表面（平面・曲面）、立体（球体、楕円体、円柱、トーラス、立方体、直方体）、線（多くは円柱状）"
    ],
    "explanationDe": [
      "In der Informationsvisualisierung werden verschiedene graphische Elemente genutzt, um Daten darzustellen. In 2D-Grafiken kommen häufig einfache Elemente wie Punkte (Pixel), geometrische Figuren (z. B. Kreise oder Rechtecke) und Linien zum Einsatz. Diese lassen sich leicht zeichnen und unterscheiden.",
      "Beispiel: Ein Punkt in einem Streudiagramm (Scatterplot) kann ein einzelnes Datenobjekt darstellen, während ein Rechteck in einem Balkendiagramm eine Datenkategorie repräsentiert.",
      "In 3D werden zusätzlich komplexere Objekte verwendet, wie Oberflächen (z. B. gekrümmte Flächen zur Darstellung von Höhenprofilen) und Volumenformen (z. B. ein Zylinder oder eine Kugel, um Datenmengen darzustellen). Auch Linien können dreidimensional modelliert werden, meist als zylinderförmige Objekte, um besser sichtbar zu sein."
    ],
    "explanationJa": [
      "情報可視化においては、データを視覚的に表現するためにさまざまなグラフィック要素が使用されます。2次元（2D）では、点（Pixel）や幾何学的な図形（例えば、円や長方形）、また直線や曲線などの線が基本的な要素として使われます。これらは描画が簡単で、視覚的に区別しやすいです。",
      "例：散布図（Scatterplot）では、1つの点が1つのデータを示し、棒グラフでは1つの長方形がカテゴリの値を表します。",
      "3次元（3D）になると、より複雑な形状も使われます。例えば、曲面を使って地形の起伏を表現したり、立体（球や円柱）を用いてデータの量的違いを視覚化します。また、3Dの線も使用され、多くは円柱のような形で表されることで視認性が向上します。"
    ],
    "originalSlideText": "Graphische Elemente\n\n▶ 2D\n▶ Punkte (Pixel)\n▶ Ebene geometrische Figuren\n\n▶ Kreise, Ellipsen\n▶ Quadrate, Rechtecke, Polygone\n\n▶ Linien\n▶ gerade\n▶ gebogen\n▶ Linienzüge\n\n▶ 3D\n▶ (Ober)-Flächen\n(2D Objekte in 3D)\n▶ eben\n▶ gekrümmt\n\n▶ Volumina\n▶ Kugel, Ellipsoid, . . .\n▶ Zylinder, Torus, . . .\n▶ Würfel, Quader, . . .\n\n▶ Linien\n▶ meist Zylinder-förmig",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 2,
    "questionDe": "(s5) Welche Eigenschaften besitzen Punkte, geometrische Figuren und Linien in der Informationsvisualisierung?",
    "questionJa": "情報可視化において、点、幾何学図形、線にはそれぞれどんな特徴（属性）があるか？",
    "answerDe": [
      "Punkte (Pixel): Farbe – Farbwert (hue), Sättigung (saturation), Helligkeit (brightness, lightness)",
      "Ebene geometrische Figuren: Farbe, Form, Orientierung, Größe, Textur",
      "Linien: Farbe, Form (gerade, Linienzug, gebogen), Breite, Stil (durchgezogen, Strich-Punkt, gepunktet)"
    ],
    "answerJa": [
      "点（Pixel）：色（色相、彩度、明度）",
      "平面図形：色、形、向き、大きさ、テクスチャ",
      "線：色、形（直線、折れ線、曲線）、幅、スタイル（実線、点線、破線）"
    ],
    "explanationDe": [
      "Verschiedene graphische Elemente besitzen unterschiedliche Eigenschaften, die für die visuelle Darstellung von Daten genutzt werden können.",
      "Punkte (Pixel) haben typischerweise Farbeigenschaften: Farbwert (hue), also z. B. Rot oder Blau; Sättigung (saturation), also wie kräftig die Farbe ist; und Helligkeit (brightness), also wie hell oder dunkel ein Punkt erscheint.",
      "Ebene geometrische Figuren, wie Rechtecke oder Kreise, können neben Farbe auch in ihrer Form (z. B. Quadrat oder Dreieck), Orientierung (z. B. gedreht), Größe (z. B. kleiner oder größer) und Textur (z. B. gestreift, gepunktet) variieren.",
      "Linien besitzen ebenfalls viele Eigenschaften: Sie können gerade, gebogen oder als Linienzug dargestellt werden. Ihre Breite kann verändert werden, und sie können verschiedene Stile haben – z. B. durchgezogen, gestrichelt oder gepunktet."
    ],
    "explanationJa": [
      "異なるグラフィック要素には、それぞれ異なる属性があり、これらを使ってデータを視覚的に表現できます。",
      "点（Pixel）は、主に色に関する属性を持ちます。色相（例：赤、青など）、彩度（色の鮮やかさ）、明度（明るさ）などがそれです。",
      "平面の幾何学図形（例：円や正方形）は、色だけでなく、形（例：三角形、四角形）、向き（例：45度に回転）、サイズ（大きさの違い）、テクスチャ（模様：点線、ストライプなど）も属性として用いられます。",
      "線についても、色や形（直線、曲線、折れ線）、線の太さ、そしてスタイル（実線、点線、破線）など多くの特徴があります。これらを組み合わせて、データの違いや重要性を視覚的に伝えることができます。"
    ],
    "originalSlideText": "Graphische Elemente\n\nEigenschaften\n\n▶ Punkte (Pixel)\n▶ Farbe\n▶ Farbwert (hue)\n▶ Sättigung (saturation)\n▶ Helligkeit (brightness, lightness)\n\n▶ Ebene geometrische Figuren\n▶ Farbe\n▶ Form\n▶ Orientierung\n▶ Größe\n▶ Textur\n\n▶ Linien\n▶ Farbe\n▶ Form\n▶ Gerade\n▶ Linienzug (Polyline)\n▶ Gebogen\n▶ Breite\n▶ (Länge: meist durch Objekte, die verbunden werden, gegeben)\n▶ Stil\n▶ Durchgezogen\n▶ Strich-Punkt\n▶ Gepunktet",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 3,
    "questionDe": "(s6) Welche Einschränkungen bestehen bei der Verwendung von graphischen Eigenschaften in der Informationsvisualisierung?",
    "questionJa": "情報可視化において、グラフィックの属性を使う際にはどんな制約があるか？",
    "answerDe": [
      "Farbe: Sättigung und Helligkeit können nicht gleichzeitig verwendet werden",
      "In 3D wird Farbe durch Beleuchtungsmodell bestimmt",
      "Form, Orientierung und Textur benötigen Mindestgröße zur Erkennbarkeit",
      "Größe (Breite von Linien) muss begrenzt sein (Minimum, Maximum)",
      "Wertebereich muss ggf. skaliert werden",
      "Textur darf keinen visuellen Stress erzeugen"
    ],
    "answerJa": [
      "色：彩度と明度は同時に使えない",
      "3Dでは色は照明モデルによって決まる",
      "形・向き・テクスチャには識別可能な最小サイズが必要",
      "サイズ（線の太さ）は最小・最大の範囲に制限する必要がある",
      "必要に応じて値の範囲をスケーリングする必要がある",
      "テクスチャは視覚的ストレスを与えないようにすべき"
    ],
    "explanationDe": [
      "Beim Einsatz graphischer Eigenschaften gibt es technische und wahrnehmungsbezogene Einschränkungen. Farben etwa können nicht in allen Dimensionen gleichzeitig genutzt werden: Wenn man sowohl die Sättigung als auch die Helligkeit verändert, wird es für das menschliche Auge schwer, Unterschiede zu erkennen.",
      "In 3D-Grafiken wird die Farbe zusätzlich durch das Beleuchtungsmodell beeinflusst – das heißt, die wahrgenommene Farbe hängt vom Lichteinfall ab, was zu verfälschten Eindrücken führen kann.",
      "Form, Orientierung und Textur benötigen eine gewisse Mindestgröße, damit sie überhaupt unterscheidbar sind. Ein zu kleines Muster kann leicht übersehen werden.",
      "Auch die Breite von Linien muss begrenzt werden, um sowohl sehr dünne als auch übermäßig dicke Linien zu vermeiden. In manchen Fällen muss der Wertebereich der Daten skaliert werden, damit er in die visuellen Grenzen passt.",
      "Schließlich sollte die verwendete Textur nicht zu komplex oder aufdringlich sein, da dies zu visuellem Stress führen kann – also anstrengend oder verwirrend für die Betrachter:innen wirkt."
    ],
    "explanationJa": [
      "グラフィックの属性を使う際には、視覚的・技術的な制約があります。たとえば「彩度」と「明度」を同時に変えると、人間の目ではその違いをうまく識別できなくなります。",
      "また3Dの場合、色は単に設定した色だけでなく、照明（ライト）の当たり方によって変化する「照明モデル」に影響されます。たとえば、同じ色でも影になって暗く見えたり、反射で明るく見えたりします。",
      "形、向き、模様（テクスチャ）は、ある程度の大きさがないと視覚的に識別できません。小さすぎると、違いが認識できない可能性があります。",
      "線の太さも極端にならないように最小値・最大値を設定する必要があります。また、データの範囲によっては、可視化のためにスケーリング（縮小や拡大）が必要になることもあります。",
      "最後に、模様（テクスチャ）は見ていて疲れるようなものであってはいけません。過度に細かい線や強いコントラストは、視覚的ストレスの原因となります。"
    ],
    "originalSlideText": "Graphische Elemente\n\nEinschränkungen\n▶ Farbe\n▶ Gleichzeitige Verwendung von Sättigung und Helligkeit nicht möglich\n▶ In 3D wird die Farbe durch das Beleuchtungsmodell bestimmt\n▶ Sättigung\n▶ Helligkeit\n\n▶ Form, Orientierung und Textur (Stil von Linien)\n▶ bedingen Mindestgröße für die Erkennbarkeit\n\n▶ Größe (Breite von Linien)\n▶ muss begrenzt sein (Minimum, Maximum)\n▶ gegebenenfalls muss der Wertebereich skaliert werden\n\n▶ Textur sollte keinen visuellen Stress erzeugen",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 4,
    "questionDe": "(s7) Welche graphischen Eigenschaften eignen sich für nominale, geordnete und quantitative Daten?",
    "questionJa": "グラフィックの属性は、名義データ、順序データ、量的データのいずれに適しているか？",
    "answerDe": [
      "Farbwert (hue): geeignet für nominal",
      "Farbintensität: geeignet für geordnet, teilweise für quantitativ",
      "Form (Stil): geeignet für nominal",
      "Orientierung: teilweise geeignet für geordnet und quantitativ",
      "Größe (1D): geeignet für quantitativ, teilweise für geordnet",
      "Größe (2D): teilweise geeignet für geordnet und quantitativ",
      "Textur: geeignet für nominal, teilweise für geordnet und quantitativ"
    ],
    "answerJa": [
      "色相（Farbwert）：名義データに適している",
      "色の強さ（Farbintensität）：順序データに適し、一部は量的データにも使用可能",
      "形（Form）：名義データに適している",
      "向き（Orientierung）：順序データ・量的データに部分的に適している",
      "サイズ（1次元）：量的データに適しており、順序データにも一部使用可能",
      "サイズ（2次元）：順序・量的データに部分的に使用可能",
      "テクスチャ（Textur）：名義データに適しており、順序・量的データにも一部使用可能"
    ],
    "explanationDe": [
      "Je nach Datentyp – nominal (keine Ordnung), geordnet (Rangfolge), quantitativ (Zahlenwerte) – sind verschiedene graphische Eigenschaften unterschiedlich gut geeignet.",
      "Farbwert (hue) – z. B. Rot, Blau, Grün – eignet sich gut für nominale Daten, weil man Farben leicht voneinander unterscheiden kann, aber sie keine natürliche Reihenfolge haben.",
      "Farbintensität (z. B. hell bis dunkel) drückt Stufen aus, daher ist sie für geordnete Daten gut geeignet.",
      "Größe (vor allem 1D – z. B. Länge eines Balkens) eignet sich hervorragend für quantitative Werte, weil man damit klare Unterschiede in der Menge zeigen kann.",
      "Form und Textur sind visuell unterscheidbar und daher hilfreich bei nominalen Daten.",
      "Orientierung kann genutzt werden, wenn Unterschiede in Ausrichtung eine Bedeutung tragen, z. B. bei Richtungsdaten.",
      "Insgesamt sollte man die grafische Eigenschaft immer passend zum Datentyp wählen, um Missverständnisse zu vermeiden."
    ],
    "explanationJa": [
      "データの種類（名義、順序、量的）によって、適切なグラフィックの属性は異なります。",
      "色相（例：赤、青、緑など）は、意味的な順序を持たない名義データの区別に向いています。たとえば国名やカテゴリ分けなどです。",
      "色の強さ（濃淡）は段階を表すのに適しているため、順序データ（例：小・中・大）に使われます。また、ある程度の数量的違いも表せます。",
      "サイズ（特に1次元、例：棒グラフの長さ）は量的データ（数値）を表すのに非常に効果的です。数の大小を直感的に理解できます。",
      "形や模様（テクスチャ）は、視覚的に簡単に識別できるため、名義データ（分類）に適しています。",
      "向き（角度）も差異が意味を持つ場合（例：風向きのデータなど）には順序データや量的データの視覚化に使われることがあります。",
      "要するに、各属性の特徴を理解し、データの性質に適した表現を選ぶことが大切です。そうでないと、誤解を招いたりデータの意味が正しく伝わらなかったりします。"
    ],
    "originalSlideText": "Graphische Elemente\n\nEignung von graphischen Eigenschaften von graphischen Elementen für Datentypen\n\nAttribute     Nominal   Geordnet   Quantitativ\nFarbwert         ✓              ×                  ×\nFarbintensität   ×              ✓                  ◦\nForm (Stil)       ✓              ×                  ×\nOrientierung    ×              ◦                  ◦\nGröße (1D)     ×              ◦                  ✓\nGröße (2D)     ×              ◦                  ◦\nTextur             ✓              ◦                  ◦",
    "explanationImage": "lecture02/lecture05_ex01.png",
    "questionImage": ""
  },
  {
    "id": 5,
    "questionDe": "(s8) Wie geeignet ist die Position als graphisches Attribut für verschiedene Datentypen?",
    "questionJa": "位置（Position）は、さまざまなデータ型に対してどの程度適しているか？",
    "answerDe": [
      "Position ist für geordnete und quantitative Daten gut geeignet",
      "Für nominale Daten nur eingeschränkt geeignet (◦)"
    ],
    "answerJa": [
      "位置は順序データと量的データに適している",
      "名義データには限定的にしか適用できない（◦）"
    ],
    "explanationDe": [
      "Die Position eines graphischen Elements ist eines der stärksten visuellen Merkmale, vor allem bei der Darstellung von quantitativen und geordneten Daten.",
      "Zum Beispiel in einem Liniendiagramm (für Zeitreihen) oder Streudiagramm (für numerische Beziehungen) ist die genaue Position auf einer Achse direkt mit einem Zahlenwert verbunden. Das ermöglicht eine sehr präzise Wahrnehmung von Datenunterschieden.",
      "Für nominale Daten ist Position nur eingeschränkt nützlich, da solche Daten keine natürliche Reihenfolge haben. Man kann zwar Gruppen nebeneinander anordnen, aber eine genaue Position hat dort keine zusätzliche Bedeutung.",
      "Fazit: Die Position eignet sich hervorragend, wenn die Daten eine Reihenfolge oder numerische Skala haben."
    ],
    "explanationJa": [
      "グラフィック要素の「位置」は、視覚的な特徴の中でも最も強力な属性の一つであり、特に順序データや量的データの表現に非常に適しています。",
      "たとえば、折れ線グラフでは時間の経過による変化を表し、散布図では数値の相関を示す際に、位置情報が使われます。こうした場合、位置は数値と直接結びついており、違いを正確に認識できます。",
      "一方、名義データ（たとえばカテゴリーの違い）には位置はあまり意味を持ちません。グループごとに並べることはできますが、位置そのものに意味があるわけではありません。",
      "結論として、位置はデータに順序性や数値的意味があるときに最も有効な表現方法です。"
    ],
    "originalSlideText": "Graphische Elemente\n\nEignung von weiteren graphischen Eigenschaften für Datentypen\n\nAttribute     Nominal   Geordnet   Quantitativ\nPosition          ◦              ✓                  ✓",
    "explanationImage": "lecture02/lecture05_ex02.png",
    "questionImage": ""
  },
  {
  "id": 6,
  "questionDe": "(s9) Was ist ein Glyph und wie unterscheidet man integrale und trennbare Dimensionen?",
  "questionJa": "Glyphとは何か？integrale（統合的）とtrennbare（分離可能）な次元はどう違うのか？",
  "answerDe": [
    "Ein Glyph ist ein graphisches Objekt zur Repräsentation eines multivariaten Datenobjekts",
    "Graphische Variablen lassen sich in integrale und trennbare Dimensionen unterscheiden",
    "Ob eine Variable integral oder trennbar ist, wird durch Experimente festgestellt"
  ],
  "answerJa": [
    "Glyph（グリフ）とは、多変量データオブジェクトを表すためのグラフィックオブジェクトである",
    "視覚変数（グラフィック変数）は、integrale（統合的）とtrennbare（分離可能）な次元に分類される",
    "ある視覚変数が統合的か分離可能かは実験により判断される"
  ],
  "explanationDe": [
    "Ein Glyph ist ein grafisches Symbol, das mehrere Datenattribute gleichzeitig darstellt – also ein Objekt zur Visualisierung multivariater Daten.",
    "Beispiel: Ein Kreis, bei dem die Größe, Farbe und Orientierung jeweils verschiedene Merkmale darstellen, ist ein Glyph.",
    "Die grafischen Variablen, die dabei verwendet werden (z. B. Farbe, Größe, Form), können entweder als integrale oder trennbare Dimensionen wahrgenommen werden.",
    "Integrale Dimensionen werden zusammenhängend wahrgenommen – eine Änderung in einer Dimension beeinflusst die Wahrnehmung der anderen (z. B. Breite und Höhe).",
    "Trennbare Dimensionen hingegen können unabhängig voneinander verarbeitet werden – z. B. Durchmesser und Farbe.",
    "Ob eine visuelle Variable integral oder trennbar ist, kann nicht allein durch Theorie entschieden werden, sondern wird durch psychologische Experimente bestimmt."
  ],
  "explanationJa": [
    "Glyph（グリフ）とは、複数の属性（変数）を同時に視覚的に表すグラフィック記号のことです。つまり、多変量データの視覚化に用いられるオブジェクトです。",
    "例：円のサイズが「売上」、色が「製品カテゴリ」、回転角度が「成長率」を表すといったように、1つの図形に複数の情報を載せるのがGlyphです。",
    "Glyphに用いられる視覚的変数（色、形、サイズなど）は、「統合的（integral）」または「分離可能（trennbar）」な次元に分類されます。",
    "統合的（integral）な次元とは、複数の属性が一体として知覚されるものです（例：幅と高さが同時に変化すると全体の大きさとして感じられる）。",
    "分離可能（trennbar）な次元は、それぞれ独立して認識されるものです（例：色とサイズは別々に注目できる）。",
    "どちらに分類されるかは理論だけでは判断できず、実験（ユーザースタディなど）によって評価されます。"
  ],
  "originalSlideText": "Graphische Elemente: Glyphen\n\n▶ Ein Glyph ist graphisches Objekt zur Repräsentation eines multivariaten Datenobjektes\n▶ Kombinationen von graphischen Dimensionen (Variablen) lassen sich unterscheiden in\n▶ separable\n▶ integrale\n\n▶ Ob graphische Variablen gemeinsam (integral) oder getrennt (separabel) wahrgenommen werden, muss durch Experimente ermittelt werden",
  "explanationImage": "lecture02/lecture05_ex03.png",
  "questionImage": ""
},
{
  "id": 7,
  "questionDe": "(s10) Welche Beispiele gibt es für integrale und trennbare graphische Dimensionen? (mit Bild auf der Folie)",
  "questionJa": "統合的（integrale）および分離可能（trennbare）なグラフィック次元にはどんな例があるか？（図あり）",
  "answerDe": [
    "Integrale Dimensionen: Breite und Höhe; Rot und Grün (ergibt zusammen Gelb)",
    "Trennbare Dimensionen: Durchmesser und Farbe"
  ],
  "answerJa": [
    "統合的な次元：幅と高さ、赤と緑（合成されて黄色になる）",
    "分離可能な次元：直径と色"
  ],
  "explanationDe": [
    "Integrale Dimensionen sind solche, bei denen zwei graphische Variablen gemeinsam wahrgenommen werden und nicht unabhängig voneinander bearbeitet werden können.",
    "Ein klassisches Beispiel ist die Kombination von Breite und Höhe: zusammen ergeben sie die Gesamtfläche oder das Format eines Objekts – sie beeinflussen sich gegenseitig in der Wahrnehmung.",
    "Ein weiteres Beispiel ist die Farbmischung: Rot und Grün ergeben zusammen Gelb – sie sind also nicht unabhängig voneinander, sondern verschmelzen visuell.",
    "Trennbare Dimensionen dagegen können unabhängig voneinander erkannt werden. Wenn z. B. der Durchmesser eines Kreises eine Variable darstellt und die Farbe eine andere, können Betrachter:innen beide Eigenschaften getrennt und gezielt wahrnehmen.",
    "Diese Trennbarkeit ist besonders wichtig bei der Darstellung vieler Dimensionen, damit Informationen nicht miteinander interferieren."
  ],
  "explanationJa": [
    "統合的（integrale）次元とは、2つの視覚的属性が同時に知覚されて、個別に処理しにくいものを指します。",
    "たとえば「幅と高さ」は、単独ではなく組み合わせで1つのサイズ（面積や縦横比）として感じられます。このように、変化が互いに影響しあうのが特徴です。",
    "色の例では、「赤と緑」を同時に提示すると、それらは視覚的に混ざって「黄色」に見えるため、別々に扱うことができません。",
    "一方で分離可能（trennbare）な次元とは、互いに独立して知覚できる属性です。例えば「円の直径（サイズ）」と「色」は、別々の情報として明確に認識されます。",
    "このような分離可能性は、多次元データの可視化において重要であり、情報の干渉を避けて正確に伝えるのに役立ちます。"
  ],
  "originalSlideText": "Graphische Elemente: Glyphen\n\n▶ Integrale Dimensionen\n▶ Breite und Höhe\n▶ Rot und Grün\n(ergeben zusammen Gelb)\n▶ . . .\n\n▶ Trennbare Dimensionen\n▶ Durchmesser und Farbe\n▶ . . .",
  "explanationImage": "lecture02/lecture05_ex03.png",
  "questionImage": ""
},
{
  "id": 8,
  "questionDe": "(s12) Warum ist die Unterscheidung zwischen integralen und trennbaren Dimensionen nicht strikt?",
  "questionJa": "統合的（integrale）と分離可能（trennbare）な次元の区別が厳密ではないのはなぜか？",
  "answerDe": [
    "Es gibt Übergänge zwischen integralen und trennbaren Dimensionen",
    "Die Trennbarkeit hängt vom Kontext und der Wahrnehmung ab"
  ],
  "answerJa": [
    "統合的と分離可能な次元の間には連続的な移行がある",
    "どちらに分類されるかは文脈や知覚によって異なる"
  ],
  "explanationDe": [
    "Ob eine grafische Dimension als integral oder trennbar wahrgenommen wird, ist nicht absolut festgelegt.",
    "In vielen Fällen hängt die Wahrnehmung davon ab, wie die Merkmale präsentiert werden, in welchem Kontext sie erscheinen und welche Erfahrung die Betrachter:innen haben.",
    "Ein Beispiel: Farbe und Textur können in einem Szenario leicht unabhängig (trennbar) erscheinen, in einem anderen jedoch miteinander verschmelzen (integral).",
    "Daher spricht man von einem Übergangsbereich – es gibt nicht immer eine klare Grenze zwischen integralen und trennbaren Dimensionen.",
    "Diese Tatsache ist besonders wichtig bei der Gestaltung von Glyphen, weil eine falsche Annahme über die Wahrnehmung die Verständlichkeit stark beeinträchtigen kann."
  ],
  "explanationJa": [
    "ある視覚的属性が統合的（integral）か分離可能（trennbar）かは、固定的・絶対的に決まるものではありません。",
    "実際には、その属性がどのような文脈で提示されるか、観察者の経験や見せ方によって、認識のされ方が変わることがあります。",
    "たとえば「色」と「テクスチャ」は、あるケースでは独立して見えるが、別のケースでは混ざって一つの印象として知覚されることがあります。",
    "このように、integralとtrennbarの間には明確な境界があるのではなく、連続的なグラデーション（移行領域）が存在します。",
    "Glyphを設計する際には、この点を考慮しないと、情報の可視化が分かりづらくなったり、誤解を招いたりする可能性があります。"
  ],
  "originalSlideText": "Graphische Elemente: Glyphen\n\n▶ Integrale Dimensionen\n▶ Breite und Höhe\n▶ Rot und Grün\n(ergeben zusammen Gelb)\n▶ . . .\n\n▶ Trennbare Dimensionen\n▶ Durchmesser und Farbe\n▶ . . .\n\n▶ Diese Unterscheidung ist nicht strikt;\nes gibt Übergänge",
  "explanationImage": "lecture02/lecture05_ex04.png",
  "questionImage": ""
},
{
  "id": 9,
  "questionDe": "(s14) Warum können nur trennbare Variablen für Glyphen bei vielen Dimensionen verwendet werden?",
  "questionJa": "多次元データにおいて、なぜGlyphでは分離可能な変数（trennbare Variablen）のみが使われるのか？",
  "answerDe": [
    "Nur trennbare Variablen können unabhängig voneinander wahrgenommen werden",
    "Sie ermöglichen die parallele Darstellung mehrerer Dimensionen ohne Interferenz"
  ],
  "answerJa": [
    "分離可能な変数は互いに独立して知覚できるため",
    "複数の次元を干渉なしに同時に表現できるため"
  ],
  "explanationDe": [
    "Bei der Darstellung multidimensionaler Daten mit Glyphen ist es entscheidend, dass die verwendeten graphischen Dimensionen voneinander unterscheidbar sind.",
    "Integrale Dimensionen beeinflussen sich gegenseitig in der Wahrnehmung, was bei vielen Dimensionen zu Verwirrung führen kann.",
    "Trennbare Dimensionen hingegen lassen sich unabhängig voneinander erkennen. Das bedeutet, man kann z. B. gleichzeitig Größe, Farbe und Form erfassen, ohne dass diese sich gegenseitig stören.",
    "Gerade wenn viele Datenattribute visualisiert werden sollen (z. B. 5 oder mehr), ist die Nutzung von trennbaren Variablen notwendig, um die Informationsaufnahme effizient zu gestalten."
  ],
  "explanationJa": [
    "多次元データをGlyph（グリフ）で表現する際に重要なのは、各視覚的属性が互いに干渉せず、個別に認識できることです。",
    "統合的な次元（integrale Dimensionen）は、1つの属性の変化が他の属性の知覚にも影響を与えるため、次元が増えると混乱を招きやすくなります。",
    "一方、分離可能な次元（trennbare Dimensionen）は、それぞれを独立して知覚できるため、たとえばサイズ・色・形といった情報を同時に表示しても視覚的に整理されたまま理解できます。",
    "特に5次元以上のような多変量データを扱うときには、分離可能な属性のみを使うことで、情報過多による混乱を避け、効率よく視覚的理解が可能になります。"
  ],
  "originalSlideText": "Graphische Elemente: Glyphen\n\n▶ Multidimensionale Daten\n▶ 8 Dimensionen\n▶ Mindestens 2 Bit pro Dimension\n\n▶ Nur trennbare Variablen können verwendet werden\n▶ 5 Dimensionen\n▶ 32 verschiedene Glyphen\n\n▶ Diese können von visueller Vorverarbeitung schnell unterschieden werden",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 10,
  "questionDe": "(s14) Wie viele verschiedene Glyphen können bei 5 trennbaren Dimensionen unterschieden werden und warum?",
  "questionJa": "5つの分離可能な次元を使う場合、識別できるGlyphの数はいくつか？またその理由は？",
  "answerDe": [
    "32 verschiedene Glyphen",
    "Grund: 5 trennbare Dimensionen mit jeweils mindestens 2 unterscheidbaren Werten (2⁵ = 32)",
    "Diese können von der visuellen Vorverarbeitung schnell unterschieden werden"
  ],
  "answerJa": [
    "識別可能なGlyphの数は32個",
    "理由：5つの分離可能な次元がそれぞれ最低2つの区別可能な値を持つ場合、2⁵ = 32通り",
    "視覚的前処理（visuelle Vorverarbeitung）によって高速に識別できる"
  ],
  "explanationDe": [
    "Wenn jede der 5 trennbaren Dimensionen zwei unterscheidbare Ausprägungen hat (z. B. groß/klein, rot/blau), dann ergibt sich eine kombinatorische Vielfalt von 2⁵ = 32 verschiedenen Glyphen.",
    "Das bedeutet, dass man bis zu 32 unterschiedliche visuelle Symbole erzeugen kann, die zuverlässig voneinander unterscheidbar sind.",
    "Die visuelle Vorverarbeitung im menschlichen Sehsystem erkennt diese Kombinationen sehr schnell – ähnlich wie bei Ampelfarben oder Verkehrsschildern.",
    "Diese Grenze von 32 ist nicht absolut, aber sie stellt einen praxisnahen Richtwert für effektive, sofort erkennbare visuelle Kodierungen dar."
  ],
  "explanationJa": [
    "5つの分離可能な視覚的属性がそれぞれ2つの区別可能な状態（例：大／小、赤／青）を持つ場合、それらの組み合わせは2の5乗、すなわち32通りになります。",
    "つまり、32種類の異なるGlyph（視覚記号）を視覚的に区別して使用することが可能になります。",
    "このような視覚的な違いは、人間の視覚系によって非常に素早く処理される（視覚的前処理）ため、パターンの即時認識が可能です。信号機の色や道路標識などがこれに類似します。",
    "もちろんこの32という数は絶対的な上限ではありませんが、実際に混乱なく使える目安として現実的な限界とされています。"
  ],
  "originalSlideText": "Graphische Elemente: Glyphen\n\n▶ Multidimensionale Daten\n▶ 8 Dimensionen\n▶ Mindestens 2 Bit pro Dimension\n\n▶ Nur trennbare Variablen können verwendet werden\n▶ 5 Dimensionen\n▶ 32 verschiedene Glyphen\n\n▶ Diese können von visueller Vorverarbeitung schnell unterschieden werden",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 11,
  "questionDe": "(s15) Wie unterscheidet sich die visuelle Darstellung uni-, bi-, tri- und multivariater Daten?",
  "questionJa": "一変量（uni-）、二変量（bi-）、三変量（tri-）、多変量（multi-variate）データの視覚的表現はどのように異なるか？",
  "answerDe": [
    "1D (uni-variate Daten): Darstellung entlang einer Achse",
    "2D (bi-variate Daten): Position auf zwei orthogonalen Achsen",
    "3D (tri-variate Daten): Position auf drei orthogonalen Achsen",
    "≥4D (multi-variate Daten): schwierig darzustellen, erfordert spezielle Techniken"
  ],
  "answerJa": [
    "1次元（uni-variateデータ）：1本の軸上に配置して表現",
    "2次元（bi-variateデータ）：2本の直交する軸を用いた位置表現",
    "3次元（tri-variateデータ）：3本の直交軸上の位置で表現",
    "4次元以上（multi-variateデータ）：視覚的表現が難しく、特殊な技術が必要"
  ],
  "explanationDe": [
    "Bei uni-variaten Daten wird typischerweise nur ein Attribut visualisiert, z. B. mit einem Balkendiagramm oder Histogramm entlang einer einzigen Achse.",
    "Bi-variate Daten – also zwei Attribute – werden häufig durch Punkte in einem 2D-Streudiagramm dargestellt, wobei die Position auf den zwei Achsen die Werte der beiden Attribute kodiert.",
    "Tri-variate Daten verwenden einen dreidimensionalen Raum, oft in Form von 3D-Streudiagrammen oder Volumenvisualisierungen, was aber die Interpretation erschwert.",
    "Bei vier oder mehr Dimensionen wird die Darstellung komplex. Solche Daten nennt man multi-variate oder auch hyper-variate Daten. Hier werden Glyphen, Farben, Texturen oder Animationen verwendet, um die zusätzlichen Dimensionen zu repräsentieren.",
    "Je höher die Dimensionalität, desto wichtiger ist eine effektive visuelle Kodierung und die Berücksichtigung der menschlichen Wahrnehmung."
  ],
  "explanationJa": [
    "一変量（uni-variate）データは、1つの属性しか持たないため、棒グラフやヒストグラムのように1本の軸を使って簡単に視覚化できます。",
    "二変量（bi-variate）データは2つの変数を持ち、それぞれをX軸とY軸で表し、散布図（scatter plot）などで点の位置として表現します。",
    "三変量（tri-variate）データになると、3本の直交する軸（X, Y, Z）を用いることで、3次元空間上にデータをプロットしますが、表示や理解が難しくなります。",
    "4次元以上の多変量（multi-variateまたはhyper-variate）データでは、通常の空間的表現だけでは対応できないため、色、形、テクスチャ、アニメーションなどの追加的な視覚的手法を用います。",
    "次元が増えるほど、視覚的な符号化方法と人間の知覚能力を考慮したデザインが重要になります。"
  ],
  "originalSlideText": "Graphische Elemente\n\n▶ Auswahl der visuellen Abbildung in Abhängigkeit von der Dimension der Daten\n▶ Dimension: Anzahl der Attribute (Variablen)\n\nDimension   Bezeichnung\n1D               Uni-Variate Daten\n2D              Bi-Variate Daten\n3D              Tri-Variate Daten\n≥4D            Multi-Variate Daten\n                Hyper-Variate Daten\n\n▶ Darstellung der Daten in einem 2- oder 3-dimensionalen visuellen Raum\n▶ Im Folgenden sind die Daten meistens quantitativ\n▶ Uni-, Bi- und Tri-Variate Daten:\nPosition von Markierungen auf orthogonalen Achsen dargestellt\n▶ Multi-Variate Daten:\nDarstellung schwieriger\n▶ Wahrnehmung ist sehr wichtig für\n▶ die visuelle Abbildung\n▶ die Bildung von visuellen Strukturen",
  "explanationImage": "lecture02/lecture05_ex05.png",
  "questionImage": ""
},
{
  "id": 12,
  "questionDe": "(s15) Warum spielt die Wahrnehmung bei der Visualisierung multivariater Daten eine wichtige Rolle?",
  "questionJa": "多変量データの可視化において、なぜ知覚（Wahrnehmung）が重要な役割を果たすのか？",
  "answerDe": [
    "Wahrnehmung ist entscheidend für die visuelle Abbildung",
    "Sie beeinflusst die Bildung von visuellen Strukturen",
    "Ohne Berücksichtigung der Wahrnehmung können Informationen falsch interpretiert werden"
  ],
  "answerJa": [
    "視覚的表現（visuelle Abbildung）には知覚が欠かせない",
    "知覚は視覚的構造の形成に影響を与える",
    "知覚を考慮しないと、情報が誤って解釈される可能性がある"
  ],
  "explanationDe": [
    "Die menschliche Wahrnehmung ist ein zentraler Faktor bei der Gestaltung von Informationsvisualisierungen, insbesondere bei komplexen multi-variaten Daten.",
    "Unsere visuelle Wahrnehmung entscheidet, welche Muster, Gruppen oder Ausreißer wir erkennen – und wie schnell und zuverlässig das geschieht.",
    "Zum Beispiel hilft uns die Wahrnehmung dabei, ähnliche Farben zu gruppieren oder Größenunterschiede zu erkennen. Das ist essenziell, um aus vielen dargestellten Variablen eine verständliche visuelle Struktur zu entwickeln.",
    "Wenn die visuelle Darstellung nicht auf die Wahrnehmung abgestimmt ist, kann sie irreführend oder überfordernd wirken.",
    "Daher müssen Visualisierungsdesigner:innen bei der Auswahl und Kombination von visuellen Variablen (z. B. Farbe, Form, Position) stets die Prinzipien der Wahrnehmungspsychologie berücksichtigen."
  ],
  "explanationJa": [
    "人間の知覚は、特に多変量データのような複雑な情報を可視化する際に、極めて重要な役割を果たします。",
    "視覚的に表示された情報の中から、どのパターンやグループ、外れ値を認識できるかは、私たちの知覚の仕組みに大きく依存しています。",
    "たとえば似た色の要素を自然にグループ化したり、サイズの違いを瞬時に把握できるのは、知覚の働きによるものです。これは、多くの変数から視覚的な構造を作り出すための基本になります。",
    "知覚を無視した視覚表現は、誤解を招いたり、情報過多で理解しづらくなったりする恐れがあります。",
    "そのため、色・形・位置などの視覚的変数を設計する際には、知覚心理学の原則を取り入れた慎重なデザインが求められます。"
  ],
  "originalSlideText": "▶ Multi-Variate Daten:\nDarstellung schwieriger\n▶ Wahrnehmung ist sehr wichtig für\n▶ die visuelle Abbildung\n▶ die Bildung von visuellen Strukturen",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 13,
  "questionDe": "(s16) Was ist ein uni-variater Datensatz und welches Ziel verfolgt man bei seiner Analyse?",
  "questionJa": "1変量（uni-variate）データとは何か？その分析の目的は何か？",
  "answerDe": [
    "Ein uni-variater Datensatz enthält genau ein Attribut (a1) pro Datenpunkt",
    "Ziel: Verständnis der Verteilung der Werte dieses Attributes"
  ],
  "answerJa": [
    "1変量データとは、各データ点に1つの属性（a1）のみを持つデータである",
    "目的：その属性値の分布を理解すること"
  ],
  "explanationDe": [
    "Ein uni-variater Datensatz betrachtet nur ein einzelnes Attribut (Merkmal) für eine Menge von Datenpunkten. Zum Beispiel könnte man für eine Liste von Personen nur das Alter oder nur das Einkommen betrachten.",
    "Die Werte des Attributs a1 sind in einer Menge X = {xi | 1 ≤ i ≤ n} zusammengefasst, wobei n die Anzahl der Datenpunkte ist.",
    "Das Ziel einer solchen Analyse ist es, zu verstehen, wie sich die Werte verteilen – z. B. ob es viele gleiche Werte gibt, ob die Daten eher klein oder groß sind, oder ob Ausreißer vorhanden sind.",
    "Man berechnet oft minimale (xmin) und maximale (xmax) Werte der Verteilung. Die Reihenfolge der Werte spielt dabei keine Rolle – es geht um die Häufigkeit und Streuung.",
    "Beispiel: In einer Schulklasse misst man die Körpergrößen der Schüler:innen. Wenn jede Person nur einen Wert (die Größe) hat, dann handelt es sich um ein uni-variates Datenset. Die Analyse zeigt z. B., ob die Körpergrößen gleichmäßig verteilt sind oder ob viele Kinder ähnlich groß sind."
  ],
  "explanationJa": [
    "1変量（uni-variate）データとは、1つの属性（a1）だけに注目したデータです。たとえば、ある人の「年齢」や「収入」など、1つの変数だけを対象にしたデータ集合を指します。",
    "このデータは X = {xi | 1 ≤ i ≤ n} の形で表され、n はデータ点の数（観測数）です。それぞれの xi は属性 a1 の値です。",
    "分析の目的は、その属性の「値の分布（Verteilung）」を理解することです。具体的には、どの値が多いか、範囲はどうか、極端な値（外れ値）があるか、などを見ます。",
    "通常、最小値（xmin）や最大値（xmax）を求め、データの広がりを把握します。値の並び順は重要ではなく、どんな値がどれだけあるかに注目します。",
    "例：あるクラスで生徒の身長だけを記録したとします。各生徒の記録が「身長1つ」ならば、それは1変量データです。このデータを分析すれば、身長の分布が平坦か偏っているかが分かります。"
  ],
  "originalSlideText": "Uni-Variate Daten (1D)\n\nBetrachtung eines Attributes\n▶ Gegeben\n▶ n Datenpunkte\n▶ 1 Attribut: a1\n▶ Werte des Attributes\n\nX = {xi |1 ≤ i ≤ n}\n\nID Attribut a1\nid1 x1,1\nid2 x2,1\n. . .\nidn xn,1\n\n▶ Ziel\n▶ Verständnis der Verteilung der Werte dieses Attributes\n▶ Definitionen\n▶ xmin = min(X )\n▶ xmax = max(X )\n\n▶ Beachte\n▶ Die xi müssen nicht geordnet sein",
  "explanationImage": "lecture02/lecture05_ex06.png",
  "questionImage": ""
},
{
  "id": 14,
  "questionDe": "(s17–18) Wie wird die absolute Häufigkeit eines Attributwertes berechnet und visualisiert?",
  "questionJa": "属性値の絶対頻度はどのように計算・可視化されるか？",
  "answerDe": [
    "Absolute Häufigkeit: ha(dj) = |{xi | xi = dj}|",
    "Visualisierung mit einem Balkendiagramm:",
    "– Form: Rechteck",
    "– Breite: konstant",
    "– Höhe: ha(dj)",
    "– Positionierung: x-Achse = j, y-Achse = 0",
    "– Farbe: konstant"
  ],
  "answerJa": [
    "絶対頻度の定義：ha(dj) = |{xi | xi = dj}|（djが何回出現するかの数）",
    "棒グラフでの可視化：",
    "– 形：長方形",
    "– 幅：一定",
    "– 高さ：ha(dj) に比例",
    "– 配置：x軸にカテゴリ番号j、y軸は0からスタート",
    "– 色：全ての棒で一定"
  ],
  "explanationDe": [
    "Die absolute Häufigkeit ha(dj) gibt an, wie oft ein bestimmter Wert dj in einem Datensatz vorkommt. Das bedeutet: Man zählt einfach, wie viele xi gleich dj sind.",
    "Zum Beispiel: Wenn der Wert „3“ in einer Liste von Zahlen dreimal vorkommt, dann ist ha(3) = 3.",
    "Diese Häufigkeiten lassen sich am besten mit einem Balkendiagramm darstellen. Jeder Balken steht für einen Wert dj.",
    "Der Balken hat immer die gleiche Breite, aber seine Höhe entspricht der Anzahl, wie oft dj vorkommt.",
    "Die Balken werden entlang der x-Achse positioniert (z. B. j = 1 für den ersten Wert), und die Höhe entlang der y-Achse beginnt bei 0.",
    "Die Farbe der Balken bleibt konstant, um den Fokus auf die Höhe (also die Häufigkeit) zu legen."
  ],
  "explanationJa": [
    "絶対頻度 ha(dj) とは、特定の値 dj がデータセット内に何回現れるかを表す数です。つまり、xi = dj となるような i の数を数えます。",
    "例：データの中に「3」という値が3回出てきた場合、ha(3) = 3 となります。",
    "このような頻度を視覚的に表現するには、棒グラフがよく使われます。各棒はそれぞれの値 dj に対応し、その高さが出現回数（頻度）を示します。",
    "棒の幅はすべて同じで、x軸には値の種類（j）を、y軸にはその頻度（ha）を取ります。",
    "棒の色はすべて同じにすることで、色に惑わされず純粋に高さで頻度を比較できるようになります。"
  ],
  "originalSlideText": "Uni-Variate Daten (1D)\n\nHäufigkeitsverteilung\n\n▶ Sei D = {dj} die Menge der verschiedenen Werte desselben Attributes\n▶ Absolute Häufigkeit\nha(dj) := |{xi |xi = dj}|\n\nZähle für jeden Wert dj , wie häufig er vorkommt\n\n▶ Stelle die absolute Häufigkeit in einem Balkendiagramm dar\n▶ Form: Rechteck\n▶ Breite: konstant\n▶ Höhe: ha(dj)\n▶ Positionierung: Koordinatensystem\n▶ x-Achse: j\n▶ y-Achse: 0\n▶ Farbe: konstant",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 15,
  "questionDe": "(s19–20)Wie unterscheiden sich zwei konkrete Beispiele für absolute Häufigkeitsverteilungen?",
  "questionJa": "2つの具体的な絶対頻度分布の例はどのように異なるか？",
  "answerDe": [
    "Beispiel 1: gleichmäßige Verteilung mit mehreren Werten mit gleicher Häufigkeit (z. B. 1, 3, 5, 6 → je 3 Vorkommen)",
    "Beispiel 2: ungleichmäßige Verteilung mit dominanten Werten (z. B. 3 → 4 Vorkommen, andere weniger)",
    "Unterschiede in der Form der Balkendiagramme: gleichmäßig vs. asymmetrisch"
  ],
  "answerJa": [
    "例1：いくつかの値（1、3、5、6など）が同じ回数（3回）出現し、分布が比較的均等",
    "例2：「3」が4回出現するなど、一部の値に偏りがあり不均等な分布",
    "棒グラフの形の違い：例1は比較的平坦、例2は非対称でピークがある"
  ],
  "explanationDe": [
    "Auf den Folien 19 und 20 werden zwei konkrete Fallbeispiele zur absoluten Häufigkeitsverteilung gezeigt.",
    "Im ersten Beispiel (Folie 19) ist die Verteilung relativ ausgeglichen: Die Werte 1, 3, 5 und 6 kommen jeweils dreimal vor, nur 2 und 4 etwas weniger. Das Balkendiagramm wirkt dadurch ziemlich flach und ausgewogen.",
    "Im zweiten Beispiel (Folie 20) sieht man dagegen eine deutlich ungleichmäßigere Verteilung: Der Wert 3 dominiert mit vier Vorkommen, während andere Werte seltener sind (z. B. 1 nur einmal). Dadurch ergibt sich ein klarer 'Hauptbalken' im Diagramm.",
    "Solche Unterschiede sind wichtig für die Interpretation der Daten: Eine gleichmäßige Verteilung deutet auf Homogenität hin, während ungleichmäßige Verteilungen auf Konzentrationen oder Auffälligkeiten hindeuten können."
  ],
  "explanationJa": [
    "スライド19と20には、絶対頻度分布の2つの具体例が示されています。",
    "最初の例（スライド19）では、値1、3、5、6がそれぞれ3回ずつ出現しており、2と4もそれに近い頻度で現れます。したがって、棒グラフは全体的に平坦で、分布は比較的均等です。",
    "一方、2つ目の例（スライド20）では、値3が4回と他より多く出現し、他の値（例えば1）は1回のみの出現です。この結果、棒グラフには明らかなピークがあり、非対称的な分布となっています。",
    "このような分布の違いは、データの解釈に大きく影響します。均等な分布はデータが全体的に均質であることを示し、偏りのある分布は特定の値に集中している傾向や異常値の存在を示唆します。"
  ],
  "originalSlideText": "Wert Häufigkeit\n1 3\n2 1\n3 3\n4 2\n5 3\n6 3\n\nWert Häufigkeit\n1 1\n2 2\n3 4\n4 3\n5 3\n6 2",
  "explanationImage": "",
  "questionImage": "lecture02/lecture05_q01.png"
},
{
  "id": 16,
  "questionDe": "(s21) Welche Datentypen können mit Balkendiagrammen visualisiert werden und worauf muss man achten?",
  "questionJa": "棒グラフで可視化できるデータ型には何があり、どんな点に注意すべきか？",
  "answerDe": [
    "Kategorisch: Reihenfolge unerheblich",
    "Geordnet: Reihenfolge muss beachtet werden (∀i < j : di < dj)",
    "Numerisch diskret: fehlende Werte mit Häufigkeit 0 anzeigen (∀di ∉ D ⇒ ha(di) = 0)",
    "Numerisch kontinuierlich: Balkendiagramm ungeeignet, besser Histogramm"
  ],
  "answerJa": [
    "カテゴリデータ：順序は考慮しなくてよい",
    "順序データ：順番を考慮する必要がある（すべての i < j に対して di < dj）",
    "離散的な数値データ：存在しない値も頻度0として表示する必要がある（例：値3が存在しなければ ha(3) = 0）",
    "連続的な数値データ：棒グラフには不向きで、ヒストグラムの方が適している"
  ],
  "explanationDe": [
    "Nicht alle Datentypen eignen sich gleichermaßen für die Darstellung mit Balkendiagrammen.",
    "Bei kategorialen Daten (z. B. Farben, Tierarten) spielt die Reihenfolge keine Rolle – die Balken können beliebig nebeneinanderstehen.",
    "Bei geordneten Daten (z. B. Schulnoten, Rangfolgen) muss die Anordnung der Balken die natürliche Reihenfolge der Werte widerspiegeln, z. B. von schlecht nach gut.",
    "Diskrete numerische Werte (z. B. ganze Zahlen) sollten vollständig abgebildet werden – auch Werte, die im Datensatz nicht vorkommen, müssen als Balken mit Höhe 0 dargestellt werden. Das sichert eine lückenlose Skala.",
    "Für kontinuierliche numerische Daten (z. B. Körpergrößen in cm) ist das Balkendiagramm ungeeignet, da es zu viele mögliche Werte gäbe. Hier sollte man Klassen bilden und ein Histogramm verwenden."
  ],
  "explanationJa": [
    "棒グラフはすべてのデータ型に適しているわけではなく、データの性質に応じて使い分ける必要があります。",
    "カテゴリーデータ（例：色、動物の種類）は、順序のないデータなので、棒の並び順に意味はなく、自由に並べてよいです。",
    "一方、順序データ（例：評価ランク、順位）では、棒の並び順が自然な順番（例：1 → 2 → 3）になるように注意する必要があります。",
    "離散的な数値データ（整数など）の場合、たとえその値がデータに含まれていなくても、頻度0として棒を表示しなければなりません。こうすることで、グラフが連続的に見え、空白による誤解を防げます。",
    "連続値（たとえば身長や気温など）は棒グラフに適しておらず、代わりに区間を設けてヒストグラムで表示するのが一般的です。"
  ],
  "originalSlideText": "Balkendiagramm: Datentypen\n▶ Kategorisch:\n▶ Reihenfolge unerheblich\n▶ Geordnet:\n▶ Reihenfolge muss beachtet werden\n∀i < j : di < dj\n\n▶ Numerisch Diskret:\n▶ Fehlende Werte müssen mit Häufigkeit 0 angezeigt werden\n∀di : (dmin < di < dmax ∧di ̸∈ D) −→ ha(di) = 0\n\n▶ Numerisch Kontinuierlich:\n▶ Abstand zwischen zwei Werten muss gleich sein\n▶ Besser: Verwendung von Histogrammen",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 17,
  "questionDe": "(s22) Warum muss die Höhe der Balken begrenzt oder angepasst werden?",
  "questionJa": "棒グラフの高さを制限または調整すべき理由は？",
  "answerDe": [
    "Maximale Häufigkeiten können größer sein als die Anzahl der verfügbaren Pixel",
    "Häufigkeit kleiner als 1 → Balkenhöhe wäre < 1 Pixel",
    "Kleine Häufigkeiten wären nicht mehr sichtbar",
    "Lösung: Mindesthöhe von 1 Pixel für Häufigkeiten > 0"
  ],
  "answerJa": [
    "最大頻度が描画可能なピクセル数を超えることがある",
    "頻度が1未満の場合、棒の高さが1ピクセル未満となる",
    "その結果、頻度の小さいデータが視覚的に見えなくなる可能性がある",
    "対策：0より大きい頻度には、最低でも1ピクセルの高さを与える"
  ],
  "explanationDe": [
    "Wenn man ein Balkendiagramm auf einem Bildschirm darstellt, ist die Anzahl der verfügbaren vertikalen Pixel begrenzt (z. B. 300 Pixel Höhe).",
    "Wenn es sehr hohe Häufigkeiten gibt, kann es passieren, dass kleinere Häufigkeiten so niedrig sind, dass ihr Balken weniger als 1 Pixel hoch wäre – und somit nicht sichtbar.",
    "Beispiel: Wenn eine Kategorie nur einmal vorkommt und die höchste Häufigkeit 1000 beträgt, dann wäre der Balken für die einmalige Kategorie 1/1000 der Höhe – das sind oft weniger als 1 Pixel.",
    "Damit solche kleinen Häufigkeiten trotzdem sichtbar bleiben, wird oft festgelegt: Jede Häufigkeit größer 0 muss mindestens einen Pixel hoch dargestellt werden.",
    "Diese Maßnahme dient dazu, alle Daten sichtbar zu halten und keine Kategorien visuell 'verschwinden' zu lassen."
  ],
  "explanationJa": [
    "棒グラフを画面に表示する際には、縦方向に使えるピクセル数（例：300ピクセル）に限りがあります。",
    "もしある値の頻度が非常に高く、別の値の頻度がとても小さい場合、後者の棒はピクセル単位で1未満になってしまい、画面上で表示されない（つまり視認できない）ことがあります。",
    "たとえば、あるカテゴリの頻度が1000回、別のカテゴリが1回しかない場合、1回の棒の高さは1/1000になり、1ピクセルにも満たない可能性があります。",
    "こうした小さい頻度を視覚的に消えないようにするために、「0より大きいすべての頻度は、最低でも1ピクセルの高さで表示する」というルールを設けることがあります。",
    "これにより、どんなに頻度が低いデータでもグラフ上で確認でき、情報の欠落を防ぐことができます。"
  ],
  "originalSlideText": "Balkendiagramm: Höhe der Balken\n▶ Maximale Häufigkeiten größer als die Anzahl der zur Verfügung stehenden Pixel der Zeichnung\n▶ Höhe des Balkens für kleine Häufigkeiten kleiner als 1\n▶ Um immer zwischen Häufigkeit 0 und kleinen Häufigkeiten unterscheiden zu können\n▶ Die minimale Höhe eines Balkens für Häufigkeiten grösser 0 auf mindestens 1 Pixel setzen",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 18,
  "questionDe": "(s23–24) Wie funktioniert die logarithmische Transformation bei Häufigkeitsverteilungen und warum wird sie verwendet?",
  "questionJa": "頻度分布における対数変換とは何か？また、それはなぜ使われるのか？",
  "answerDe": [
    "Logarithmische Transformation: h(di) = logb(ha(di)) + 1 für ha(di) > 0, sonst 0",
    "Basis meist: b = 10",
    "Wird verwendet, wenn Häufigkeiten mehrere Größenordnungen umfassen"
  ],
  "answerJa": [
    "対数変換の定義：h(di) = logb(ha(di)) + 1（ha(di) > 0 の場合）、それ以外は0",
    "通常、底（b）は10を使用する",
    "頻度の値が非常に大きくばらつく（桁が異なる）場合に用いる"
  ],
  "explanationDe": [
    "Eine logarithmische Transformation wird verwendet, wenn in einer Häufigkeitsverteilung sehr große Unterschiede zwischen den Werten auftreten – z. B. einige Werte kommen 10-mal vor, andere 4000-mal.",
    "In solchen Fällen würden die Balken im Diagramm so stark unterschiedlich ausfallen, dass kleinere Häufigkeiten kaum noch sichtbar wären.",
    "Durch die Transformation mit der Formel h(di) = logb(ha(di)) + 1 (wenn ha(di) > 0), werden die Unterschiede komprimiert, sodass alle Werte im Diagramm besser vergleichbar bleiben.",
    "Beispiel: ha(2) = 10 → log10(10) + 1 = 2; ha(5) = 4000 → log10(4000) + 1 ≈ 4.6. So schrumpft der Abstand visuell.",
    "Die Basis b = 10 ist üblich, es können aber auch andere Basen verwendet werden (z. B. 2 oder e), je nach Datenstruktur."
  ],
  "explanationJa": [
    "対数変換は、頻度分布において値のばらつき（スケールの差）が非常に大きい場合に使われる手法です。たとえば、ある値の頻度が10回、別の値は4000回のように桁が異なるケースです。",
    "このような分布を通常の棒グラフで表すと、頻度の小さいデータは棒が非常に小さくなり、視認できなくなります。",
    "そこで、頻度 ha(di) に対して log変換を行い、視覚的に扱いやすくします。具体的には、ha(di) > 0 のとき、h(di) = logb(ha(di)) + 1 を使います（それ以外は0）。",
    "例：ha(2) = 10 → log₁₀(10) + 1 = 2、ha(5) = 4000 → log₁₀(4000) + 1 ≈ 4.6。このように、差が縮小されて比較しやすくなります。",
    "一般的には底（b）として10が使われますが、2やeなど他の値を用いることもできます。"
  ],
  "originalSlideText": "▶ Logarithmische Skalen\n▶ Umfassen die Häufigkeiten mehrere Größenordnungen, so kann eine logarithmische Transformation hilfreich sein\n\nh(di) =\n{\nlogb(ha(di))+1   ha(di) > 0\n0                      ha(di) = 0\n\n▶ Meist: b = 10",
  "explanationImage": "lecture02/lecture05_ex07.png",
  "questionImage": ""
},
{
  "id": 19,
  "questionDe": "(s25–26) Wie unterscheiden sich absolute, relative und prozentuale Häufigkeit?",
  "questionJa": "絶対頻度・相対頻度・百分率頻度はどう違うのか？",
  "answerDe": [
    "Absolute Häufigkeit ha(dj): Anzahl der Vorkommen eines Wertes dj",
    "Relative Häufigkeit hr(dj): ha(dj) / n",
    "Prozentuale Häufigkeit hp(dj): hr(dj) × 100",
    "Eigenschaften: ∑ hr(dj) = 1; ∑ hp(dj) = 100"
  ],
  "answerJa": [
    "絶対頻度 ha(dj)：ある値 dj の出現回数そのもの",
    "相対頻度 hr(dj)：絶対頻度を全体の数 n で割った値（ha(dj) / n）",
    "百分率頻度 hp(dj)：相対頻度に100を掛けた値（hr(dj) × 100）",
    "特徴：相対頻度の合計は1、百分率頻度の合計は100になる"
  ],
  "explanationDe": [
    "Die absolute Häufigkeit ha(dj) ist die einfachste Form – sie zählt, wie oft ein Wert dj im Datensatz vorkommt.",
    "Die relative Häufigkeit hr(dj) setzt diesen Wert ins Verhältnis zur Gesamtanzahl der Datenpunkte n: hr(dj) = ha(dj) / n.",
    "Die prozentuale Häufigkeit hp(dj) ist lediglich die relative Häufigkeit in Prozent ausgedrückt: hp(dj) = hr(dj) × 100.",
    "Beispiel: Wenn ein Wert 3-mal in einem Datensatz mit 10 Werten vorkommt, dann gilt: ha = 3, hr = 3/10 = 0.3, hp = 30%.",
    "Wichtig: Die Summe aller relativen Häufigkeiten ergibt immer 1, und die Summe aller Prozenthäufigkeiten ergibt 100.",
    "Diese Umrechnungen sind nützlich, um Häufigkeiten vergleichbar zu machen – z. B. zwischen Datensätzen mit unterschiedlicher Größe."
  ],
  "explanationJa": [
    "絶対頻度 ha(dj) は、ある値 dj がデータセットの中に何回現れたかという「回数そのもの」です。",
    "相対頻度 hr(dj) は、それを全体のデータ数 n で割った値です。つまり、全体の中でどのくらいの割合を占めているかを表します。",
    "百分率頻度 hp(dj) は、相対頻度に100を掛けたもので、「全体のうち〇〇％を占める」といった表現になります。",
    "例：ある値が3回出現し、データ全体が10個なら、ha = 3、hr = 3/10 = 0.3、hp = 30% です。",
    "注意点として、相対頻度の合計は必ず1になり、百分率頻度の合計は100になります。",
    "相対頻度や百分率頻度を使うことで、異なるサイズのデータセット間でも比較がしやすくなります。"
  ],
  "originalSlideText": "▶ Relative Häufigkeit\nhr (dj) := ha(dj) / n\n▶ Eigenschaften\n0 ≤ hr (dj) ≤ 1\n∑ hr (dj) = 1\n\n▶ Prozentuale Häufigkeit\nhp(dj) := hr (dj) ·100\n▶ Eigenschaften\n0 ≤ hp(dj) ≤ 100\n∑ hp(dj) = 100",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 20,
  "questionDe": "(s26) Warum können relative Häufigkeiten bei kleinen n irreführend sein?",
  "questionJa": "データ数（n）が小さい場合、なぜ相対頻度は誤解を招きやすいのか？",
  "answerDe": [
    "Bei kleinem n führen kleine absolute Unterschiede zu großen relativen Unterschieden",
    "Beispiel: n = 5, absolute Differenz = 1 → relative Differenz = 20%"
  ],
  "answerJa": [
    "n が小さいと、絶対的な違いが相対的には大きく見えてしまう",
    "例：n = 5 のとき、絶対差が1でも相対差は20％になる"
  ],
  "explanationDe": [
    "Relative Häufigkeiten berechnen sich als Anteil an der Gesamtzahl der Datenpunkte n: hr(dj) = ha(dj)/n.",
    "Wenn n sehr klein ist, kann bereits ein einziger zusätzlicher Wert einen großen prozentualen Unterschied machen.",
    "Beispiel: In einem Datensatz mit n = 5 führt eine Änderung der Häufigkeit von ha = 1 auf ha = 2 bereits zu einer relativen Änderung von 20%.",
    "Das wirkt deutlich größer, als es in absoluten Zahlen ist, und kann dadurch irreführend sein – besonders in Diagrammen oder Berichten.",
    "Deshalb sollte bei sehr kleinen Datensätzen immer zusätzlich die absolute Häufigkeit angegeben werden oder mit Vorsicht interpretiert werden."
  ],
  "explanationJa": [
    "相対頻度は「データ全体に占める割合」として表され、hr(dj) = ha(dj)/n の式で求められます。",
    "しかし、n（データ数）が非常に小さい場合、1つの出現回数の差が、相対的には大きな変化として現れてしまいます。",
    "例：n = 5 のデータセットで、ある値の出現回数が1回から2回に増えると、相対頻度は 20% 増加します（0.2 → 0.4）。",
    "このような変化は視覚的に大きく見えてしまうため、実際以上に重要に見えるという誤解を生むことがあります。",
    "そのため、データ数が少ないときには相対頻度だけでなく、絶対頻度も併せて示すか、慎重に解釈する必要があります。"
  ],
  "originalSlideText": "▶ Basis (Bezugspunkt) der Relativierung muss deutlich sein\n▶ Was ist wichtiger: absoluter oder relativer Wert\n▶ Bei sehr kleinem n sind relative Werte in der Regel irreführend\n▶ n = 5\n▶ Differenz absolut: 1\n→ Differenz prozentual: 20",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 21,
  "questionDe": "(s27–28)Was sind die Vor- und Nachteile von Pie Charts im Vergleich zu Bar Charts?",
  "questionJa": "円グラフ（Pie Chart）と棒グラフ（Bar Chart）の長所と短所は何か？",
  "answerDe": [
    "Pie Charts zeigen relative/prozentuale Verteilung",
    "Vorteil: gut für Geschäftsberichte",
    "Nachteil: Flächen und Winkel schwer interpretierbar",
    "Nachteil: schlecht geeignet für numerische Vergleiche",
    "Bar Charts: besser für präzise Vergleiche"
  ],
  "answerJa": [
    "円グラフは相対的・百分率の分布を表す",
    "長所：ビジネス向け資料には適している",
    "短所：面積や角度の把握が難しい",
    "短所：数値の比較には不向き",
    "棒グラフ：正確な比較に適している"
  ],
  "explanationDe": [
    "Ein Pie Chart (Kreisdiagramm) stellt die relative oder prozentuale Verteilung von Daten als Kreissegmente dar. Jedes Segment entspricht einem Wert.",
    "Pie Charts werden oft in Geschäftsberichten oder Präsentationen verwendet, da sie visuell ansprechend sind.",
    "Allerdings hat das Kreisdiagramm gravierende Nachteile: Menschen haben Schwierigkeiten, Winkel und Flächen zu vergleichen. Dadurch werden Unterschiede zwischen Werten oft schlecht eingeschätzt.",
    "Insbesondere bei vielen Kategorien oder sehr ähnlichen Anteilen ist ein Pie Chart schwer lesbar und vergleichbar.",
    "Ein Balkendiagramm (Bar Chart) zeigt dieselben Informationen, aber durch die Länge der Balken – diese kann vom menschlichen Auge viel präziser verglichen werden.",
    "Daher sind Bar Charts in der wissenschaftlichen Datenanalyse wesentlich gebräuchlicher und verlässlicher."
  ],
  "explanationJa": [
    "円グラフ（Pie Chart）は、各データの相対的割合や百分率を円の一部（扇形）として視覚化するものです。",
    "ビジネス資料などではよく使われ、視覚的に華やかな印象を与えるため、プレゼン資料には適しています。",
    "しかし、面積や角度の違いを人間が正確に読み取るのは難しく、特に数値が接近している場合やカテゴリ数が多い場合には比較しづらくなります。",
    "棒グラフ（Bar Chart）は、同じ情報を棒の長さとして表現するため、視覚的に正確な比較が可能です。",
    "そのため、科学的なデータ解析や報告では、正確性が求められるため棒グラフが一般的に好まれます。"
  ],
  "originalSlideText": "Pie Chart\n▶ Zeigen relative/anteilige Verteilung (meist: prozentuale Verteilung)\n▶ Meist für Geschäftsgraphiken\n▶ Kaum Verwendung im wissenschaftlichen Bereich\n▶ Probleme\n▶ Fläche und Winkel sind schwieriger zu interpretieren als Länge\n▶ Schwierig für (numerische) Vergleiche\n▶ Nutzung von vielen Pie-Charts gleichzeitig ist sehr schwierig",
  "explanationImage": "",
  "questionImage": "lecture02/lecture05_q02.png"
},
{
  "id": 22,
  "questionDe": "(s29–30) (mit Bild) Wann ist ein Line Chart oder Dot Chart sinnvoll und wann nicht?",
  "questionJa": "（画像）折れ線グラフ（Line Chart）やドットグラフ（Dot Chart）はどんなときに有効か？またどんなときに不適切か？",
  "answerDe": [
    "Line Chart: geeignet für kontinuierliche Daten und Zeitreihen",
    "Line Chart: nicht geeignet für kategoriale, geordnete oder diskrete Daten",
    "Dot Chart: geeignet für alle Datentypen (kategorial, geordnet, diskret, kontinuierlich, Zeitreihen)",
    "Dot Chart: sinnvoll, wenn y-Achse nicht bei 0 beginnt"
  ],
  "answerJa": [
    "折れ線グラフ：連続データや時系列データの可視化に適している",
    "折れ線グラフ：カテゴリーデータ、順序データ、離散データには不適切（連続性の誤解を与えるため）",
    "ドットグラフ：すべてのデータ型（カテゴリ、順序、離散、連続、時系列）に使用可能",
    "ドットグラフ：特にy軸が0から始まらないときに有効"
  ],
  "explanationDe": [
    "Das Line Chart (Liniendiagramm) verbindet Datenpunkte mit Linien und zeigt so den Verlauf oder Trend über eine kontinuierliche Skala oder Zeit hinweg.",
    "Es ist besonders nützlich für Zeitreihendaten oder kontinuierliche Messwerte, z. B. Temperaturverlauf über Tage.",
    "Bei diskreten, geordneten oder kategorialen Daten kann das jedoch zu Missverständnissen führen – die Linien suggerieren eine Verbindung oder Zwischenwerte, die es nicht gibt.",
    "Das Dot Chart (Punktdiagramm) stellt Datenpunkte isoliert dar. Es eignet sich für alle Datentypen und ist besonders nützlich, wenn man genaue Punktwerte zeigen will.",
    "Wenn die y-Achse nicht bei 0 startet (z. B. bei Zoom auf Daten), vermeidet das Dot Chart falsche visuelle Eindrücke, die durch verkürzte Balken entstehen würden.",
    "Daher ist das Dot Chart flexibler, während das Line Chart bei falscher Anwendung zu irreführender Interpretation führen kann."
  ],
  "explanationJa": [
    "折れ線グラフ（Line Chart）は、データ点を線で結び、時間や連続的な値の推移（トレンド）を視覚化するために使われます。",
    "特に、日ごとの気温変化や株価のような時系列データ、連続変数の変化を見るのに有効です。",
    "しかし、カテゴリーデータや離散的な数値（整数など）に使用すると、「値と値の間にも意味がある」と誤解されやすいため不適切です。",
    "ドットグラフ（Dot Chart）は、データ点を点で個別に表す形式で、どのデータ型にも適用可能です。特に個別の数値や分布を明示したいときに役立ちます。",
    "また、y軸が0から始まらない（ズーム表示など）場合でも、棒の長さによる誤解を避けられるため、ドットグラフはそのような場面で特に有効です。",
    "そのため、ドットグラフは柔軟性が高く、誤解を与えにくいという点で安全性の高い可視化方法です。"
  ],
  "originalSlideText": "Line Chart\n▶ Zeigt Form und Verlauf der Verteilung\n▶ Zeigt nicht die Werte\n▶ Geeignet für\n▶ Kontinuierliche Daten\n▶ Zeitreihen\n▶ Nicht geeignet für\n▶ Kategorische Daten\n▶ Geordnete Daten\n▶ Diskrete Daten\n(erweckt Eindruck, dass Zwischenwerte existieren)\n\nDot Chart\n▶ Punkte anstelle von Balken\n▶ Geeignet für\n▶ Kategorische Daten\n▶ Geordnete Daten\n▶ Diskrete Daten\n▶ Kontinuierliche Daten\n▶ Zeitreihen\n▶ Sinnvoll, falls y-Achse nicht bei 0 beginnt",
  "explanationImage": "",
  "questionImage": "lecture02/lecture05_q03.png"
},
{
  "id": 23,
  "questionDe": "(s31–34) Was bedeutet Klasseneinteilung bei Häufigkeitsverteilungen und wie wird sie durchgeführt?",
  "questionJa": "頻度分布における「階級の設定（Klasseneinteilung）」とは何か？どう行うのか？",
  "answerDe": [
    "Klasseneinteilung bedeutet Gruppierung von Werten di ∈ D in Klassen kj",
    "Für numerische Werte: gleich große Intervalle",
    "Anzahl der Klassen nk hängt von nd ab:",
    "– nd ≤ 1000: nk = √nd",
    "– nd > 1000: nk = 10 · log(nd)",
    "Breite w = (dmax − dmin) / nk",
    "Histogramm zeigt Häufigkeit h*(kj) pro Klasse"
  ],
  "answerJa": [
    "階級の設定とは、値 di ∈ D を複数のクラス（kj）にグループ分けすること",
    "数値データの場合は等間隔で区切る",
    "クラス数 nk はデータ数 nd によって決まる：",
    "– nd ≤ 1000 のとき：nk = √nd",
    "– nd > 1000 のとき：nk = 10 × log(nd)",
    "区間幅 w = (dmax − dmin) / nk",
    "ヒストグラムで各クラスの頻度 h*(kj) を表示する"
  ],
  "explanationDe": [
    "Die Klasseneinteilung ist ein Verfahren zur Gruppierung von numerischen Datenwerten in Intervalle – sogenannte Klassen.",
    "Anstatt jeden einzelnen Wert zu zeigen, werden ähnliche Werte zusammengefasst. Dies ist besonders bei kontinuierlichen Werten sinnvoll, bei denen es viele oder sogar unendlich viele Ausprägungen geben kann.",
    "Die Breite der Klassen wird über die Formel w = (dmax − dmin) / nk berechnet. Jede Klasse kj enthält dann alle Werte, die in dieses Intervall fallen.",
    "Die Anzahl der Klassen nk kann aus der Datenanzahl nd abgeleitet werden: Ist nd ≤ 1000, nimmt man die Quadratwurzel von nd; bei größeren Datenmengen nutzt man 10 · log(nd).",
    "Für jede Klasse wird dann eine summierte Häufigkeit h*(kj) berechnet und in einem Histogramm dargestellt.",
    "Das Histogramm ist ein Balkendiagramm, bei dem jede Klasse ein Rechteck mit gleicher Breite und Höhe entsprechend der Klassenhäufigkeit ist."
  ],
  "explanationJa": [
    "階級の設定（Klasseneinteilung）とは、多数の値（特に連続的な数値）を一定の範囲にグループ化し、「クラス」としてまとめる方法です。",
    "たとえば身長データを 150〜160cm、160〜170cm のように区切ることで、データの傾向が見やすくなります。",
    "クラスの幅 w は、最大値と最小値の差をクラス数 nk で割って求めます：w = (dmax − dmin) / nk。",
    "クラス数 nk はデータの総数 nd に応じて設定され、小規模（nd ≤ 1000）の場合は √nd、大規模（nd > 1000）の場合は 10 × log(nd) が目安です。",
    "各クラスに属する値の頻度（h*(kj)）を集計し、それを棒の高さとしてヒストグラムに表示します。",
    "ヒストグラムでは、すべての棒の幅は一定で、それぞれの棒の高さがクラス内の出現回数を表します。"
  ],
  "originalSlideText": "Häufigkeitsverteilung: Klasseneinteilung\n▶ Gruppierung der di ∈ D\n▶ nk : Anzahl der Klassen\n▶ w = dmax − dmin / nk : Breite der Klassen\n▶ ∀ 0 ≤ j ≤ nk −1 : kj = {di ∈ D|dmin +w · j ≤ di < dmin +w ·(j +1)}\n▶ h*(kj) = ∑ h*(di)\n▶ Besonders sinnvoll bei kontinuierlichen Werten\n▶ Anzahl der Klassen:\n– nd ≤ 1000: nk = √nd\n– nd > 1000: nk = 10 · log(nd)",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 24,
  "questionDe": "(s34) Wie werden Histogramme dargestellt und worauf muss man bei der Klasseneinteilung achten?",
  "questionJa": "ヒストグラムはどう描画され、階級分けの際にどんな注意点があるか？",
  "answerDe": [
    "Histogramm: Balkendiagramm mit Klassen und deren Häufigkeiten",
    "Form: Rechteck, Breite konstant, Höhe = h*(kj)",
    "x-Achse = Klassenindex j, y-Achse = 0",
    "Farbe: konstant",
    "Achtung bei logarithmischen Werten oder wenn dj = 0 existiert"
  ],
  "answerJa": [
    "ヒストグラムは、各階級（クラス）の頻度を棒の高さで示す棒グラフ",
    "形：長方形、幅は一定、高さはクラスの頻度 h*(kj)",
    "x軸：クラスの番号 j、y軸：0 からスタート",
    "色：すべての棒で同じ",
    "注意点：値が対数的に広がっている場合や 0 を含む場合は特別な処理が必要"
  ],
  "explanationDe": [
    "Ein Histogramm stellt die Verteilung von Daten dar, die zuvor in Klassen (Intervalle) eingeteilt wurden.",
    "Jede Klasse wird durch einen Balken repräsentiert: Die Breite ist konstant, die Höhe entspricht der summierten Häufigkeit h*(kj) dieser Klasse.",
    "Die Balken werden entlang der x-Achse nach ihrer Klasse (Index j) positioniert. Die Farbe bleibt gleich, damit die Höhe als Hauptinformationsquelle dient.",
    "Besonderheiten: Wenn alle Werte dj > 0 und große Unterschiede in den Werten bestehen, kann eine logarithmische Einteilung sinnvoll sein.",
    "Wenn ein Wert dj = 0 existiert, muss eine eigene Klasse mit diesem Wert und seiner Häufigkeit h*(dj) ergänzt werden, damit nichts verloren geht."
  ],
  "explanationJa": [
    "ヒストグラムは、連続的または数の多いデータを「クラス（階級）」に分けて、その分布を視覚的に示すグラフです。",
    "各クラスは長方形の棒で表現され、棒の幅はすべて等しく、棒の高さがそのクラスに属するデータの頻度（h*(kj)）を示します。",
    "棒はx軸上にクラス番号 j として配置され、y軸は原点（0）からスタートします。色は情報を混乱させないように全棒で統一されます。",
    "注意点として、値のスケールに大きなばらつき（例：1、10、1000など）がある場合には、対数変換してから階級分けを行うことでより適切に分布を表現できます。",
    "また、もし値 0 を含む場合（dj = 0）、その値専用のクラスを作り、h*(dj)（その頻度）を加える必要があります。そうしないとデータが欠落する恐れがあります。"
  ],
  "originalSlideText": "▶ Darstellung mit Histogrammen\n▶ Balkendiagramm mit Klassen und deren Häufigkeiten\n▶ Form: Rechteck\n▶ Breite: konstant\n▶ Höhe: h*(kj)\n▶ Positionierung: Koordinatensystem\n▶ x-Achse: j\n▶ y-Achse: 0\n▶ Farbe: konstant\n\n▶ Bemerkungen\n▶ Falls:\n▶ ∀dj ∈ D : dj > 0\n▶ und die Werte umfassen mehrere Größenordnungen\n▶ dann kann es sinnvoll sein, den Logarithmus der dj zu berechnen\n▶ und die Klasseneinteilung auf den logarithmischen Werten vorzunehmen\n▶ Falls ∃j0 : dj0 = 0:\nfüge eine Klasse mit dem Wert 0 und Häufigkeit h*(dj0) hinzu",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 25,
  "questionDe": "(s35–36)Wie wirken sich verschiedene Klasseneinteilungen auf die Visualisierung aus?",
  "questionJa": "階級の分け方が可視化結果にどのような影響を与えるか？",
  "answerDe": [
    "Unterschiedliche Klasseneinteilungen verändern die Gruppierung der Daten",
    "Dadurch ändern sich Höhe und Form der Balken im Histogramm",
    "Feinere Einteilung zeigt mehr Details, gröbere Einteilung betont grobe Muster"
  ],
  "answerJa": [
    "階級の分け方によって、データのグループ化が変わる",
    "その結果、ヒストグラムの棒の高さや全体の形状が変化する",
    "細かく分ければ詳細が見え、粗く分ければ全体的な傾向が強調される"
  ],
  "explanationDe": [
    "Die Einteilung der Werte in Klassen hat einen direkten Einfluss auf die Darstellung im Histogramm.",
    "In den Beispielen der Folien 35 und 36 sieht man, wie sich durch unterschiedliche Gruppierungen (z. B. Klassenbreite oder Anzahl) die Form des Diagramms ändert.",
    "Bei feinerer Einteilung (z. B. 1-2, 3-4, 5-6) erkennt man detailliertere Schwankungen der Häufigkeiten innerhalb kleiner Bereiche.",
    "Gröbere Einteilungen führen zu glatteren Verteilungen, können aber wichtige Details überdecken oder vermischen.",
    "Deshalb muss die Klasseneinteilung gut überlegt sein – sie bestimmt, wie Muster oder Ausreißer visuell wahrgenommen werden."
  ],
  "explanationJa": [
    "階級（クラス）の設定方法は、ヒストグラムの見た目や解釈に直接影響します。",
    "スライド35と36の例では、同じデータでも階級の分け方によってヒストグラムの形が変化していることが確認できます。",
    "たとえば、「1–2」「3–4」「5–6」のように細かく分けると、各区間の頻度の違いが詳しく見えますが、全体の傾向は少し見にくくなることがあります。",
    "一方で、階級を大きくして分けると、分布はなめらかに見える一方で、細かな差異や局所的な特徴が失われることがあります。",
    "そのため、分析目的に応じて適切な階級幅・数を選ぶことが重要です。"
  ],
  "originalSlideText": "Wert Häufigkeit\n1 3\n2 1\n3 3\n4 2\n5 3\n6 3\n\nWert Häufigkeit\n1–2 4\n3–4 5\n5–6 6\n\nWert Häufigkeit\n1 1\n2 2\n3 4\n4 3\n5 3\n6 2\n\nWert Häufigkeit\n1–2 3\n3–4 7\n5–6 5",
  "explanationImage": "lecture02/lecture05_ex08.png",
  "questionImage": ""
},
{
  "id": 26,
  "questionDe": "(s37–39) (mit Bild) Was kennzeichnet eine linkssteile und eine rechtssteile Verteilung bei uni-variaten Daten?",
  "questionJa": "1変量データにおける左に急な分布・右に急な分布とはどのようなものか？",
  "answerDe": [
    "Linkssteile Verteilung (rechtsschief)",
    "Rechtssteile Verteilung (linksschief)"
  ],
  "answerJa": [
    "左に急な分布（右裾分布／右への歪み）",
    "右に急な分布（左裾分布／左への歪み）"
  ],
  "explanationDe": [
    "Eine linkssteile Verteilung (rechtsschief) zeigt viele kleine Werte und wenige große Ausreißer. Beispiel: Einkommen – die meisten Menschen haben niedrige Einkommen, wenige haben sehr hohe.",
    "Eine rechtssteile Verteilung (linksschief) ist das Gegenteil: viele große Werte, aber einige wenige sehr kleine Ausreißer.",
    "Die Schiefe gibt also an, in welche Richtung die Verteilung 'gezogen' wird, oft durch Ausreißer beeinflusst."
  ],
  "explanationJa": [
    "「左に急な分布（右裾分布）」は、小さい値が多く、大きな値が少ない分布です。例えば所得データでは、多くの人が低所得、一部が高所得という構造になります。",
    "「右に急な分布（左裾分布）」はその逆で、データの多くが大きな値を取り、一部だけが非常に小さい値になります。",
    "このような分布の「歪み」は、外れ値の影響によってどちらの方向に分布が引っ張られているかを示します。"
  ],
  "originalSlideText": "Verteilungen\n\nLinkssteile Verteilung\nRechtssteile Verteilung",
  "explanationImage": "lecture02/lecture05_ex09.png",
  "questionImage": ""
},
{
  "id": 27,
  "questionDe": "(s37–39) (mit Bild) Was sind Gleichverteilung und symmetrische Verteilung bei uni-variaten Daten?",
  "questionJa": "1変量データにおける一様分布と対称分布とは何か？",
  "answerDe": [
    "Gleichverteilung (uniform)",
    "Symmetrische Verteilung"
  ],
  "answerJa": [
    "一様分布（全ての値が同じ頻度で出現）",
    "対称分布（平均を中心に左右対称な分布）"
  ],
  "explanationDe": [
    "Eine Gleichverteilung bedeutet, dass alle Werte in einem Bereich gleich häufig vorkommen – z. B. bei einem idealen Würfel (alle Zahlen 1–6 sind gleich wahrscheinlich).",
    "Eine symmetrische Verteilung (z. B. Normalverteilung) hat links und rechts vom Mittelwert die gleiche Form. Sie zeigt keine Schiefe und ist häufig in der Statistik."
  ],
  "explanationJa": [
    "一様分布（Gleichverteilung）は、すべての値が等しい確率または頻度で現れる分布です。たとえば理想的なサイコロは1～6が同じ確率で出ます。",
    "対称分布は、平均値を中心として左右が同じ形になる分布です。代表的なのは正規分布で、統計学でも非常によく登場します。"
  ],
  "originalSlideText": "Verteilungen\n\nGleich Verteilung\nSymmetrische Verteilung",
  "explanationImage": "lecture02/lecture05_ex10.png",
  "questionImage": ""
},
{
  "id": 28,
  "questionDe": "(s37–39) (mit Bild) Was ist eine multimodale Verteilung bei uni-variaten Daten?",
  "questionJa": "1変量データにおける多峰性分布（multimodale Verteilung）とは何か？",
  "answerDe": [
    "Multimodale Verteilung"
  ],
  "answerJa": [
    "多峰性分布（複数の山を持つ分布）"
  ],
  "explanationDe": [
    "Eine multimodale Verteilung besitzt mehrere 'Moden' – also Häufigkeitsspitzen. Das bedeutet, es gibt mehrere Wertebereiche, in denen besonders viele Datenpunkte liegen.",
    "Solche Verteilungen treten häufig auf, wenn die Daten aus mehreren unterschiedlichen Gruppen bestehen – z. B. Altersverteilung von Schülern und Erwachsenen gemeinsam."
  ],
  "explanationJa": [
    "多峰性分布（multimodale Verteilung）は、分布の中に複数の山（ピーク）がある分布を指します。",
    "このような分布は、異なる性質のグループが混ざっている場合によく見られます。たとえば子どもと大人を含む年齢分布では、複数のピークが現れることがあります。"
  ],
  "originalSlideText": "Verteilungen\n\nMulti-Modale Verteilung",
  "explanationImage": "lecture02/lecture05_ex11.png",
  "questionImage": ""
},

{
  "id": 29,
  "questionDe": "(s41) Welche Maße der zentralen Tendenz und Streuung verwendet man bei uni-variaten Daten und wann?",
  "questionJa": "1変量データで使われる代表値と散布度の種類と、それらをいつ使うか？",
  "answerDe": [
    "Modus (mode): bei kategorischen Werten",
    "Median: zusätzlich bei geordneten Werten",
    "Durchschnittliche absolute Abweichung (absolute average deviation): bei geordneten Werten",
    "Mittelwert (mean): zusätzlich bei kontinuierlichen Werten",
    "Varianz (variance), Standardabweichung (standard deviation): bei kontinuierlichen Werten"
  ],
  "answerJa": [
    "最頻値（Modus）：カテゴリーデータに用いる",
    "中央値（Median）：順序データで追加的に使用",
    "平均絶対偏差（durchschnittliche absolute Abweichung）：順序データで使用",
    "平均（Mittelwert）：連続データで追加的に使用",
    "分散（Varianz）・標準偏差（Standardabweichung）：連続データに対して使用"
  ],
  "explanationDe": [
    "Bei uni-variaten Daten – also Daten mit nur einem Attribut – verwendet man unterschiedliche statistische Maßzahlen, je nachdem, wie die Daten strukturiert sind.",
    "Für kategoriale Werte (z. B. Farben, Tierarten) ist der Modus (mode) sinnvoll, also der häufigste Wert.",
    "Wenn die Werte geordnet sind (z. B. Schulnoten), nutzt man zusätzlich den Median (Zentralwert) und die durchschnittliche absolute Abweichung – ein Maß für die Streuung um den Median.",
    "Für kontinuierliche numerische Daten (z. B. Körpergröße) verwendet man den Mittelwert (mean), Varianz (variance) und Standardabweichung (standard deviation), da diese statistischen Kennwerte eine präzise Aussage über Lage und Streuung ermöglichen.",
    "Beispiel: Bei einer Umfrage zur Lieblingsfarbe bringt der Mittelwert keinen Nutzen, aber der Modus zeigt, welche Farbe am beliebtesten ist. Für Körpergrößen hingegen sind Mittelwert und Standardabweichung sehr aussagekräftig."
  ],
  "explanationJa": [
    "1変量データ（1つの属性しか持たないデータ）に対して、データの種類に応じて異なる統計量が用いられます。",
    "カテゴリーデータ（例：色、製品カテゴリ）では、最も頻度の高い値である「最頻値（Modus）」が使われます。平均値などは意味を持ちません。",
    "順序データ（例：成績のランク）では、中央値（Median）や平均絶対偏差（durchschnittliche absolute Abweichung）も使われ、データの中心やばらつきを表します。",
    "連続データ（例：身長、体重などの実数値）では、平均（Mittelwert）、分散（Varianz）、標準偏差（Standardabweichung）が使われ、より精密な統計的分析が可能です。",
    "例：好きな色のアンケートでは「平均色」を求めても意味がなく、最も多く選ばれた色（Modus）が適切です。一方、身長データなら、平均やばらつきを表す分散・標準偏差が有効です。"
  ],
  "originalSlideText": "Uni-Variate Daten (1D): Beschreibende Statistik\n\n▶ Ziel: Reduktion\n▶ Viele Zahlen → wenige Zahlen\n\nZentrale\nTendenz\n\nVariabilität\n\nModus\nMedian Durchschnittliche ab-\nsolute Abweichung\nMittelwert Varianz, Standardab-\nweichung\n\n▶ Kategorische Werte\n▶ Modus\n▶ Geordnete Werte zusätzlich\n▶ Median\n▶ Durchschnittliche absolute Abweichung\n▶ Kontinuierliche Werte zusätzlich\n▶ Mittelwert\n▶ Varianz\n▶ Standardabweichung",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 30,
  "questionDe": "(s42) Was ist der Modus und was bedeuten uni- und multimodale Verteilungen?",
  "questionJa": "最頻値（Modus）とは何か？単峰性（uni-modal）と多峰性（multi-modal）の違いは？",
  "answerDe": [
    "Modus (mode): häufigster Wert im Datensatz",
    "Uni-modale Verteilung: nur ein Modus",
    "Multi-modale Verteilung: mehrere Werte mit gleicher maximaler Häufigkeit"
  ],
  "answerJa": [
    "最頻値（Modus）は、データ中で最も頻繁に出現する値",
    "単峰性分布（uni-modal）：最頻値が1つだけの分布",
    "多峰性分布（multi-modal）：同じ最大頻度を持つ値が複数ある分布"
  ],
  "explanationDe": [
    "Der Modus (mode) ist der Wert, der in einem Datensatz am häufigsten vorkommt. Er ist besonders hilfreich bei kategorialen oder geordneten Daten.",
    "Wenn nur ein solcher häufigster Wert existiert, spricht man von einer uni-modal (ein-gipflig) verteilten Datenmenge.",
    "Existieren mehrere Werte mit gleicher maximaler Häufigkeit, handelt es sich um eine multi-modale Verteilung.",
    "Beispiel: In der Zahlenreihe {1, 2, 2, 3, 4} ist der Modus = 2 (uni-modal). In {1, 1, 2, 2, 3} haben 1 und 2 dieselbe maximale Häufigkeit → die Verteilung ist multi-modal.",
    "Der Modus kann in Kombination mit Median und Mittelwert Hinweise auf die Verteilung und Schiefe liefern."
  ],
  "explanationJa": [
    "最頻値（Modus）は、データセット内で最も多く出現した値のことです。カテゴリーデータや順序データで特に有効です。",
    "最頻値が1つだけ存在する場合、その分布は「単峰性（uni-modal）」と呼ばれます。1つの明確なピークを持っている状態です。",
    "一方、複数の値が同じ最大頻度で現れる場合は「多峰性（multi-modal）」といい、ピークが複数存在することを意味します。",
    "例：データが {1, 2, 2, 3, 4} のとき、最頻値は2のみ（uni-modal）。{1, 1, 2, 2, 3} の場合は、1と2が同じ頻度で出現し、multi-modal になります。",
    "Modus は、中央値（Median）や平均（Mittelwert）と組み合わせることで、分布の形や歪みの判断に役立ちます。"
  ],
  "originalSlideText": "▶ Modus (mode)\n▶ Häufigster Wert:\nmodus = {dj | h*(dj) = max₁≤i≤dn {h*(di)}}\n▶ Falls eindeutig:\nuni-modale Verteilung\n▶ Falls nicht eindeutig:\nmulti-modale Verteilung",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 30,
  "questionDe": "(s42) Was ist der Modus und was bedeuten uni- und multimodale Verteilungen?",
  "questionJa": "最頻値（Modus）とは何か？単峰性（uni-modal）と多峰性（multi-modal）の違いは？",
  "answerDe": [
    "Modus (mode): häufigster Wert im Datensatz",
    "Uni-modale Verteilung: nur ein Modus",
    "Multi-modale Verteilung: mehrere Werte mit gleicher maximaler Häufigkeit"
  ],
  "answerJa": [
    "最頻値（Modus）は、データ中で最も頻繁に出現する値",
    "単峰性分布（uni-modal）：最頻値が1つだけの分布",
    "多峰性分布（multi-modal）：同じ最大頻度を持つ値が複数ある分布"
  ],
  "explanationDe": [
    "Der Modus (mode) ist der Wert, der in einem Datensatz am häufigsten vorkommt. Er ist besonders hilfreich bei kategorialen oder geordneten Daten.",
    "Wenn nur ein solcher häufigster Wert existiert, spricht man von einer uni-modal (ein-gipflig) verteilten Datenmenge.",
    "Existieren mehrere Werte mit gleicher maximaler Häufigkeit, handelt es sich um eine multi-modale Verteilung.",
    "Beispiel: In der Zahlenreihe {1, 2, 2, 3, 4} ist der Modus = 2 (uni-modal). In {1, 1, 2, 2, 3} haben 1 und 2 dieselbe maximale Häufigkeit → die Verteilung ist multi-modal.",
    "Der Modus kann in Kombination mit Median und Mittelwert Hinweise auf die Verteilung und Schiefe liefern."
  ],
  "explanationJa": [
    "最頻値（Modus）は、データセット内で最も多く出現した値のことです。カテゴリーデータや順序データで特に有効です。",
    "最頻値が1つだけ存在する場合、その分布は「単峰性（uni-modal）」と呼ばれます。1つの明確なピークを持っている状態です。",
    "一方、複数の値が同じ最大頻度で現れる場合は「多峰性（multi-modal）」といい、ピークが複数存在することを意味します。",
    "例：データが {1, 2, 2, 3, 4} のとき、最頻値は2のみ（uni-modal）。{1, 1, 2, 2, 3} の場合は、1と2が同じ頻度で出現し、multi-modal になります。",
    "Modus は、中央値（Median）や平均（Mittelwert）と組み合わせることで、分布の形や歪みの判断に役立ちます。"
  ],
  "originalSlideText": "▶ Modus (mode)\n▶ Häufigster Wert:\nmodus = {dj | h*(dj) = max₁≤i≤dn {h*(di)}}\n▶ Falls eindeutig:\nuni-modale Verteilung\n▶ Falls nicht eindeutig:\nmulti-modale Verteilung",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 31,
  "questionDe": "(s42) Wie berechnet man Median und durchschnittliche absolute Abweichung?",
  "questionJa": "中央値（Median）と平均絶対偏差（durchschnittliche absolute Abweichung）はどのように計算されるか？",
  "answerDe": [
    "Median: mittlerer Wert in geordneter Liste",
    "– n ungerade: median = x₍ₙ₊₁₎⁄₂",
    "– n gerade: median = (xₙ⁄₂ + x₍ₙ⁄₂₊₁₎) ⁄ 2",
    "Durchschnittliche absolute Abweichung: x̄ = (1/n) ∑|xᵢ − median|"
  ],
  "answerJa": [
    "中央値（Median）：データを昇順に並べたときの中央の値",
    "– n が奇数：中央値 = x₍ₙ₊₁₎⁄₂ 番目の値",
    "– n が偶数：中央値 = 中央2つの平均",
    "平均絶対偏差：x̄ = (1/n) × ∑|xᵢ − median|（各データと中央値の差の平均）"
  ],
  "explanationDe": [
    "Der Median ist der zentrale Wert einer geordneten Liste von Daten.",
    "Wenn die Anzahl n der Daten ungerade ist, ist der Median einfach das mittlere Element.",
    "Wenn n gerade ist, nimmt man den Durchschnitt der beiden mittleren Werte.",
    "Die durchschnittliche absolute Abweichung ist ein Maß dafür, wie stark die Daten im Durchschnitt vom Median abweichen.",
    "Sie wird berechnet, indem man für jeden Datenpunkt den Betrag der Differenz zum Median nimmt, diese summiert und dann durch n teilt.",
    "Diese Kennzahl ist besonders robust gegenüber Ausreißern und eignet sich für geordnete oder ordinalskalierte Daten."
  ],
  "explanationJa": [
    "中央値（Median）は、データを昇順に並べたときに中央にくる値です。",
    "n が奇数のときは、ちょうど真ん中のデータが中央値になります。n が偶数のときは、中央の2つの値の平均が中央値です。",
    "平均絶対偏差（durchschnittliche absolute Abweichung）は、各データが中央値からどれだけ離れているかの平均を示す指標です。",
    "具体的には、すべてのデータについて「その値 − 中央値」の絶対値を取り、それを合計してデータ数 n で割ります。",
    "この値は、外れ値の影響を受けにくく、順序尺度のデータにも適用できるため、頑健な散布度の指標として使われます。"
  ],
  "originalSlideText": "▶ Median (median)\n▶ Mittlerer Wert\nmedian =\n{\nxi          i = (n+1)/2     n ungerade\n(xi + xi+1)/2   i = n/2     n gerade\n▶ ist gleich dem 2.ten Quartil\n\n▶ Durchschnittliche absolute Abweichung\nx̄ = (1/n) ∑|xᵢ − median|\nEs gilt: ∑|xᵢ − m| ist minimal ⇕ m = median",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 32,
  "questionDe": "(s43) Was ist der Unterschied zwischen Population und Stichprobe bei Mittelwert, Varianz und Standardabweichung?",
  "questionJa": "母集団と標本の違い、およびそれに基づく平均・分散・標準偏差の計算方法の違いは？",
  "answerDe": [
    "Population: Gesamtheit aller möglichen Werte {Xi}, Größe N",
    "Stichprobe: tatsächlich gemessene Werte {xi}, Größe n",
    "Mittelwert: µ = (1/N) ∑ Xi (Population), x̄ = (1/n) ∑ xi (Stichprobe)",
    "Varianz: σ² = (1/N) ∑(Xi − µ)² (Population), s² = (1/(n−1)) ∑(xi − x̄)² (Stichprobe)",
    "Standardabweichung: σ = √σ², s = √s²"
  ],
  "answerJa": [
    "母集団（Population）：測定対象となるすべての値の集合 {Xi}、大きさ N",
    "標本（Stichprobe）：実際に観測・取得されたデータ {xi}、大きさ n",
    "平均：母集団では µ = (1/N) ∑ Xi、標本では x̄ = (1/n) ∑ xi",
    "分散：母集団では σ² = (1/N) ∑(Xi − µ)²、標本では s² = (1/(n−1)) ∑(xi − x̄)²",
    "標準偏差：母集団は σ = √σ²、標本は s = √s²"
  ],
  "explanationDe": [
    "In der Statistik unterscheidet man zwischen Population (Grundgesamtheit) und Stichprobe (Beobachtungsmenge).",
    "Die Population umfasst alle möglichen Elemente, über die man eine Aussage treffen möchte – z. B. alle Bürger eines Landes.",
    "Die Stichprobe ist die Teilmenge, die tatsächlich gemessen wurde – z. B. 1000 befragte Personen.",
    "Da man bei Stichproben nur einen Ausschnitt betrachtet, korrigiert man die Berechnung der Varianz, indem man durch (n − 1) statt n teilt. Dies nennt man Bessel-Korrektur.",
    "Der Mittelwert wird bei Population und Stichprobe gleichartig berechnet, aber auf Basis unterschiedlicher Datenmengen.",
    "Standardabweichung ist jeweils die Wurzel der Varianz und misst die durchschnittliche Abweichung vom Mittelwert."
  ],
  "explanationJa": [
    "統計においては、全体を対象とする「母集団（Population）」と、実際に観測したデータ「標本（Stichprobe）」を区別します。",
    "母集団は理論的に存在するすべての対象（例：全国民の身長）であり、標本はそこから実際に観測した一部（例：100人の調査結果）です。",
    "平均はどちらも数値を合計してデータ数で割って求めますが、分散と標準偏差には違いがあります。",
    "母集団の分散は N で割るのに対し、標本の分散は自由度を考慮して n−1 で割ります（これは「不偏分散」の考えに基づきます）。",
    "この補正を行わないと、母集団に比べて標本の分散が過小評価されてしまうからです。",
    "標準偏差は分散の平方根で、平均からのズレの大きさを表します。"
  ],
  "originalSlideText": "▶ Population\n▶ Menge aller möglichen Elemente, die gemessen werden sollen {Xi}\n▶ Theoretische Konstruktion\n▶ Größe der Population: N = |{Xi}|\n\n▶ Messwerte\n▶ Menge aller Elemente, die tatsächlich gemessen wurden {xi}\n▶ Teilmenge der zugehörigen Population\n▶ Anzahl der Messwerte: n = |{xi}|\n\nPopulation\nMittelwert µ = ∑ Xi / N\nVarianz σ² = ∑(Xi − µ)² / N\nStandardabweichung σ = √σ²\n\nMesswerte\nMittelwert x̄ = ∑ xi / n\nVarianz s² = ∑(xi − x̄)² / (n−1)\nStandardabweichung s = √s²",
  "explanationImage": "lecture02/lecture05_ex12.png",
  "questionImage": ""
},
{
  "id": 31,
  "questionDe": "(s42) Wie berechnet man Median und durchschnittliche absolute Abweichung?",
  "questionJa": "中央値（Median）と平均絶対偏差（durchschnittliche absolute Abweichung）はどのように計算されるか？",
  "answerDe": [
    "Median: mittlerer Wert in geordneter Liste",
    "– n ungerade: median = x₍ₙ₊₁₎⁄₂",
    "– n gerade: median = (xₙ⁄₂ + x₍ₙ⁄₂₊₁₎) ⁄ 2",
    "Durchschnittliche absolute Abweichung: x̄ = (1/n) ∑|xᵢ − median|"
  ],
  "answerJa": [
    "中央値（Median）：データを昇順に並べたときの中央の値",
    "– n が奇数：中央値 = x₍ₙ₊₁₎⁄₂ 番目の値",
    "– n が偶数：中央値 = 中央2つの平均",
    "平均絶対偏差：x̄ = (1/n) × ∑|xᵢ − median|（各データと中央値の差の平均）"
  ],
  "explanationDe": [
    "Der Median ist der zentrale Wert einer geordneten Liste von Daten.",
    "Wenn die Anzahl n der Daten ungerade ist, ist der Median einfach das mittlere Element.",
    "Wenn n gerade ist, nimmt man den Durchschnitt der beiden mittleren Werte.",
    "Die durchschnittliche absolute Abweichung ist ein Maß dafür, wie stark die Daten im Durchschnitt vom Median abweichen.",
    "Sie wird berechnet, indem man für jeden Datenpunkt den Betrag der Differenz zum Median nimmt, diese summiert und dann durch n teilt.",
    "Diese Kennzahl ist besonders robust gegenüber Ausreißern und eignet sich für geordnete oder ordinalskalierte Daten."
  ],
  "explanationJa": [
    "中央値（Median）は、データを昇順に並べたときに中央にくる値です。",
    "n が奇数のときは、ちょうど真ん中のデータが中央値になります。n が偶数のときは、中央の2つの値の平均が中央値です。",
    "平均絶対偏差（durchschnittliche absolute Abweichung）は、各データが中央値からどれだけ離れているかの平均を示す指標です。",
    "具体的には、すべてのデータについて「その値 − 中央値」の絶対値を取り、それを合計してデータ数 n で割ります。",
    "この値は、外れ値の影響を受けにくく、順序尺度のデータにも適用できるため、頑健な散布度の指標として使われます。"
  ],
  "originalSlideText": "▶ Median (median)\n▶ Mittlerer Wert\nmedian =\n{\nxi          i = (n+1)/2     n ungerade\n(xi + xi+1)/2   i = n/2     n gerade\n▶ ist gleich dem 2.ten Quartil\n\n▶ Durchschnittliche absolute Abweichung\nx̄ = (1/n) ∑|xᵢ − median|\nEs gilt: ∑|xᵢ − m| ist minimal ⇕ m = median",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 33,
  "questionDe": "(s44) Wie lässt sich der Mittelwert alternativ über Häufigkeiten berechnen?",
  "questionJa": "頻度を使って平均値を計算する別の方法とは？",
  "answerDe": [
    "x̄ = (1/n) · ∑ xi",
    "= (1/n) · ∑ ha(dj) · dj",
    "= ∑ hr(dj) · dj"
  ],
  "answerJa": [
    "x̄ = (1/n) × ∑ xi（通常の平均の定義）",
    "= (1/n) × ∑ ha(dj) × dj（絶対頻度を使った計算）",
    "= ∑ hr(dj) × dj（相対頻度を使った計算）"
  ],
  "explanationDe": [
    "Der Mittelwert kann nicht nur durch direktes Aufaddieren aller Einzelwerte xi berechnet werden, sondern auch unter Verwendung der Häufigkeitsverteilung.",
    "Dazu summiert man die Produkte aus der Häufigkeit ha(dj) jedes Wertes dj und dem Wert selbst und teilt durch die Gesamtanzahl n.",
    "Alternativ kann man auch mit der relativen Häufigkeit hr(dj) arbeiten: Dann ergibt sich der Mittelwert als gewichtete Summe der Werte dj, gewichtet mit hr(dj).",
    "Diese Methode ist besonders nützlich, wenn die Daten bereits in gruppierter oder tabellarischer Form (Häufigkeitstabelle) vorliegen.",
    "Beispiel: Wenn die Zahl 3 fünfmal vorkommt und die Zahl 5 zweimal, dann trägt 3 mehr zum Mittelwert bei als 5."
  ],
  "explanationJa": [
    "平均値（Mittelwert）は、単にすべてのデータを足して数で割るという通常の方法だけでなく、頻度を使っても求めることができます。",
    "絶対頻度（ha(dj)）を使う方法では、各値 dj にその出現回数を掛けて合計し、それを全体のデータ数 n で割ります。",
    "また、相対頻度（hr(dj)）を使えば、各値にその割合を掛けて合計することで平均値を求められます。",
    "この方法は、データが頻度分布表などの形式ですでに与えられているときに非常に便利です。",
    "例：3が5回、5が2回出てくるデータでは、3が平均に与える影響は5よりも大きくなります。"
  ],
  "originalSlideText": "▶ Mittelwert (mean)\n▶ Alternative Berechnung\nx̄ = 1/n · ∑ xi = 1/n · ∑ ha(dj) · dj = ∑ hr(dj) · dj\n▶ Es gilt:\n∑(xi − x̄) = 0\n∑(xi − x̄)² ist minimal ⇕ x̄ = mean",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 34,
  "questionDe": "(s45) Was bedeutet Freiheitsgrad und warum ist er bei der Berechnung der Stichprobenvarianz wichtig?",
  "questionJa": "自由度（Freiheitsgrad）とは何か？標本分散の計算においてなぜ重要か？",
  "answerDe": [
    "Freiheitsgrad = n − m (z. B. m = 1 für Mittelwert)",
    "Nur n − 1 der Werte xi sind frei wählbar, wenn der Mittelwert gegeben ist",
    "Deshalb ist der Divisor der Stichprobenvarianz (n − 1)"
  ],
  "answerJa": [
    "自由度（Freiheitsgrad）＝ n − m（例：平均を使う場合は m = 1）",
    "平均値が固定されているとき、n 個の値のうち自由に選べるのは n − 1 個のみ",
    "そのため、標本分散の分母には (n − 1) を使う"
  ],
  "explanationDe": [
    "Freiheitsgrade geben an, wie viele Datenpunkte in einer Berechnung unabhängig variieren dürfen.",
    "Wenn man z. B. den Mittelwert x̄ vorgibt, dann sind nur n − 1 Werte xi frei wählbar – der letzte muss so sein, dass die Summe der Abweichungen vom Mittelwert null ergibt.",
    "Aus diesem Grund verwendet man bei der Stichprobenvarianz den Divisor (n − 1) statt n, um eine systematische Unterschätzung zu vermeiden.",
    "Diese Korrektur nennt man Bessel-Korrektur und sie sorgt dafür, dass die Varianz der Stichprobe im Mittel ein unverzerrter Schätzer für die wahre Populationsvarianz ist."
  ],
  "explanationJa": [
    "自由度とは、統計量の計算において、データの中で自由に選べる（独立に変動できる）値の数のことです。",
    "例えば平均（x̄）をすでに計算済みとした場合、n 個のうち n − 1 個の値は自由に選べますが、最後の1個は「全体の平均を満たすように」決めなければなりません。",
    "この制約のため、標本分散を求めるときには分母を n ではなく (n − 1) にします。これにより、母集団の分散を過小評価しないように補正されます。",
    "この補正は「ベッセル補正（Bessel-Korrektur）」と呼ばれ、標本分散が母分散の不偏推定量になるように設計されています。"
  ],
  "originalSlideText": "▶ Anzahl der Freiheitsgrade\n▶ Gegeben:\n▶ n Beobachtungen\n▶ m Mittelwerte\n▶ Frage: Wie viele Beobachtungen können variieren?\n▶ Antwort: n − m\n▶ Begründung für m = 1:\nWegen ∑(xi − x̄) = 0 können nur n − 1 der n Variablen xi frei gewählt werden\n▶ Daraus ergibt sich der Divisor für s²",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 35,
  "questionDe": "(s46) Welche Vor- und Nachteile haben Mittelwert, Median und Varianz?",
  "questionJa": "平均（Mittelwert）・中央値（Median）・分散（Varianz）はそれぞれどんな長所と短所があるか？",
  "answerDe": [
    "Mittelwert, Varianz, Standardabweichung: empfindlich gegenüber Ausreißern",
    "Mittelwert: wenig aussagekräftig bei nicht-symmetrischen Verteilungen",
    "Median: robust gegenüber Ausreißern",
    "Median: begrenzte Aussagekraft bei multi-modalen Verteilungen"
  ],
  "answerJa": [
    "平均・分散・標準偏差：外れ値の影響を受けやすい",
    "平均：非対称な分布では代表値としての意味が薄くなる",
    "中央値：外れ値に強く、頑健な指標",
    "中央値：多峰性分布では中心を示す能力が限定される"
  ],
  "explanationDe": [
    "Der Mittelwert (mean) und darauf basierende Maße wie Varianz und Standardabweichung reagieren stark auf Ausreißer, also Werte, die weit vom Rest entfernt liegen.",
    "Das bedeutet: Schon ein einzelner extremer Wert kann den Mittelwert deutlich verschieben und somit ein verzerrtes Bild der zentralen Tendenz geben.",
    "Der Median hingegen ist robust gegenüber Ausreißern – er wird von extremen Werten nicht beeinflusst, da er nur die Position in der geordneten Liste betrachtet.",
    "Allerdings hat der Median Nachteile bei multi-modalen Verteilungen (mit mehreren Häufigkeitsspitzen), weil er dort keine Information über die Struktur der Daten liefert.",
    "Beispiel: Bei einem Datensatz mit den Werten {10, 10, 10, 100} ist der Mittelwert = 32,5 (stark verzerrt), der Median = 10 (repräsentativ für die Mehrheit)."
  ],
  "explanationJa": [
    "平均（Mittelwert）や分散（Varianz）、標準偏差（Standardabweichung）は、外れ値（極端な値）に大きく影響されます。",
    "例えば、データに1つだけ極端に大きな値があると、平均が大きく引っ張られ、全体の傾向を正確に表さなくなります。",
    "一方、中央値（Median）は順位情報をもとにしているため、外れ値に影響されにくく、頑健な代表値です。",
    "ただし、中央値には弱点もあります。多峰性（multi-modal）の分布、つまりピークが複数ある場合には、その中心を単純に示すだけで、分布の構造を十分に反映できません。",
    "例：データが {10, 10, 10, 100} のとき、平均は 32.5 と大きく偏ってしまいますが、中央値は 10 で、多数派をよく表しています。"
  ],
  "originalSlideText": "Bemerkungen\n▶ Mittelwert, Varianz, Standardabweichung\n▶ Empfindlich gegen Ausreißer\n▶ Keine (geringe) Aussagekraft bei nicht-symmetrischen Verteilungen\n\n▶ Median\n▶ Begrenzte Aussagekraft bei multi-modalen Verteilungen",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 36,
  "questionDe": "(s46) Was sagt die Reihenfolge von Modus, Median und Mittelwert über die Schiefe der Verteilung aus?",
  "questionJa": "Modus・Median・Mittelwertの並び順が分布の歪みをどのように示すか？",
  "answerDe": [
    "Links-seitige Verteilung: Modus ≤ Median ≤ Mittelwert",
    "Symmetrische Verteilung: Modus = Median = Mittelwert",
    "Rechts-seitige Verteilung: Modus ≥ Median ≥ Mittelwert"
  ],
  "answerJa": [
    "左裾（右に歪んだ）分布：Modus ≤ Median ≤ Mittelwert",
    "対称分布：Modus = Median = Mittelwert",
    "右裾（左に歪んだ）分布：Modus ≥ Median ≥ Mittelwert"
  ],
  "explanationDe": [
    "Die Anordnung der drei zentralen Lagemasse – Modus (häufigster Wert), Median (Zentralwert) und Mittelwert (Durchschnitt) – liefert Informationen über die Schiefe (Asymmetrie) einer Verteilung.",
    "Bei einer links-seitigen Verteilung (rechtsschief) liegen viele kleine Werte vor, Ausreißer auf der rechten Seite ziehen den Mittelwert nach oben. Deshalb: Modus < Median < Mittelwert.",
    "Bei einer symmetrischen Verteilung – z. B. Normalverteilung – fallen alle drei Kennwerte zusammen.",
    "Bei einer rechts-seitigen Verteilung (linksschief) sind große Werte häufiger, aber einige kleine Ausreißer ziehen den Mittelwert nach unten, also: Modus > Median > Mittelwert.",
    "Diese Beziehung hilft, die Form der Verteilung auch ohne graphische Darstellung zu erkennen."
  ],
  "explanationJa": [
    "3つの代表値（最頻値 Modus・中央値 Median・平均 Mittelwert）の並び順を見ることで、分布の「歪み（非対称性）」を判断することができます。",
    "左裾分布（右に尾を引く形）では、小さい値が多く、右側に外れ値があるため、平均が最も大きくなり、順番は Modus < Median < Mittelwert になります。",
    "対称分布（たとえば正規分布）の場合は、3つの値がすべて同じになります。",
    "右裾分布（左に尾を引く形）では、大きな値が多い一方、小さい外れ値によって平均が下に引っ張られるため、順番は Modus > Median > Mittelwert になります。",
    "グラフを描かなくても、この順序関係を見ることで分布の形をある程度判断することができます。"
  ],
  "originalSlideText": "Verteilung\nLinks-seitig: Modus ≤ Median ≤ Mittelwert\nSymmetrisch: Modus = Median = Mittelwert\nRechts-seitig: Modus ≥ Median ≥ Mittelwert",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 37,
  "questionDe": "(s47) Was bedeuten Schiefe und Wölbung (Skewness & Kurtosis) und wie interpretiert man den Exzess?",
  "questionJa": "歪度（Schiefe）・尖度（Wölbung）・Exzessとは何か？どのように解釈されるか？",
  "answerDe": [
    "Schiefe (skewness): Maß für Asymmetrie",
    "– ≈ 0: symmetrisch",
    "– ≫ 0: links-seitig",
    "– ≪ 0: rechts-seitig",
    "Wölbung (kurtosis): Maß für die Gipfelform",
    "Exzess = Wölbung − 3",
    "– ≈ 0: normalgipflig",
    "– ≫ 0: steilgipflig",
    "– ≪ 0: flachgipflig"
  ],
  "answerJa": [
    "歪度（Schiefe）：分布の非対称性を表す指標",
    "– ≈ 0：対称分布",
    "– ≫ 0：左側に裾を引く（左歪み）",
    "– ≪ 0：右側に裾を引く（右歪み）",
    "尖度（Wölbung）：分布の尖り具合（山の鋭さ）を表す指標",
    "Exzess（過剰尖度）= 尖度 − 3",
    "– ≈ 0：正規分布と同じ程度の尖り",
    "– ≫ 0：尖った山（高くて細い）",
    "– ≪ 0：平らな山（低くて広い）"
  ],
  "explanationDe": [
    "Die Schiefe (skewness) misst, ob eine Verteilung nach links oder rechts verzogen ist.",
    "Wenn Schiefe ≈ 0, ist die Verteilung symmetrisch (z. B. Normalverteilung).",
    "Eine positive Schiefe (≫ 0) bedeutet, dass der rechte Rand länger ist (links-steile Verteilung).",
    "Eine negative Schiefe (≪ 0) zeigt einen längeren linken Rand (rechts-steile Verteilung).",
    "Die Wölbung (kurtosis) gibt an, wie schmal und hoch (steil) oder breit und flach (flach) die Verteilungsgipfel sind.",
    "Für die Interpretation verwendet man den Exzess = Wölbung − 3. Der Normalwert ist 0 (entspricht Normalverteilung).",
    "Beispiel: Eine steilgipflige Verteilung (Exzess > 0) weist häufige Werte nahe dem Mittelwert auf, während eine flachgipflige Verteilung breiter verteilt ist."
  ],
  "explanationJa": [
    "歪度（Schiefe）は、分布が左右非対称かどうかを示す指標です。",
    "Schiefe ≈ 0 のときは、分布は対称です（例：正規分布）。",
    "Schiefe ≫ 0 ならば、左に山が偏っていて右に裾が伸びている（左側に歪んだ分布）という意味です。",
    "反対に Schiefe ≪ 0 の場合は、右に山が偏っていて左に裾が伸びる（右に歪んだ分布）ことを示します。",
    "尖度（Wölbung）は分布の山の「尖り具合」を表します。高くて細い山か、低くて広い山かという違いを捉えます。",
    "Exzess（過剰尖度）は、「尖度 − 3」で定義され、正規分布を基準にして尖りすぎているか・平らすぎるかを判断します。",
    "たとえば Exzess > 0 のときは、中央に値が集中した「尖った分布」、Exzess < 0 のときは広く分散した「平たい分布」です。"
  ],
  "originalSlideText": "▶ Symmetrie\n▶ Schiefe (skewness)\nschiefe = (1/n) · ∑((xi − x̄)/s)³\nSchiefe Verteilung:\n≈ 0 Symmetrisch\n≫ 0 Links-seitig\n≪ 0 Rechts-seitig\n\n▶ Wölbung (kurtosis)\nwölbung = (1/n) · ∑((xi − x̄)/s)⁴\n▶ Exzess: exzess = wölbung − 3\nExzess Verteilung:\n≈ 0 Normalgipflig\n≫ 0 Steilgipflig\n≪ 0 Flachgipflig",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 38,
  "questionDe": "(s48–49) (mit Bild) Wie vergleicht man mehrere Häufigkeitsverteilungen und wann ist ein Stacked Bar-Chart sinnvoll?",
  "questionJa": "複数の頻度分布の比較方法と、積み上げ棒グラフ（Stacked Bar-Chart）の使用が適切な場合は？",
  "answerDe": [
    "Normale Balkendiagramme: gut für den Vergleich zwischen Verteilungen pro Wert dj",
    "Weniger geeignet für den Vergleich innerhalb einer Verteilung bei großen Häufigkeitswerten",
    "Stacked Bar-Chart: sinnvoll bei Fokus auf aggregierte Häufigkeit",
    "Nicht geeignet, wenn exakter Vergleich zwischen Einzelhäufigkeiten nötig ist"
  ],
  "answerJa": [
    "通常の棒グラフ：値ごとの複数分布（Häufigkeit）の比較に適している",
    "ただし、頻度の値の幅が大きいと比較が困難になることがある",
    "積み上げ棒グラフ（Stacked Bar-Chart）：合計値の可視化や全体的な傾向を示すのに有効",
    "ただし、個々の頻度の正確な比較には不向き"
  ],
  "explanationDe": [
    "Wenn mehrere Verteilungen (z. B. Häufigkeit 1 und Häufigkeit 2) für dieselben Werte dj verglichen werden sollen, ist ein einfaches gruppiertes Balkendiagramm gut geeignet.",
    "Dabei stehen die Balken nebeneinander und man erkennt direkt, welche Verteilung bei welchem dj höher ist.",
    "Probleme entstehen, wenn die Häufigkeiten stark variieren – dann werden kleinere Unterschiede überdeckt.",
    "Ein Stacked Bar-Chart kann verwendet werden, wenn die Gesamthäufigkeit pro Wert dj im Vordergrund steht.",
    "Dabei wird jede Verteilung als Teil des Gesamtbalkens dargestellt. Der Nachteil: Man kann untere Segmente (z. B. Häufigkeit 2) schlechter vergleichen, da sie nicht an der gleichen Basislinie beginnen.",
    "Für den präzisen Vergleich einzelner Werte ist daher ein gruppiertes Balkendiagramm meist besser geeignet."
  ],
  "explanationJa": [
    "複数の頻度分布（例：Häufigkeit 1 と Häufigkeit 2）を比較する場合、通常の（グループ化された）棒グラフを使えば、各値 dj に対して分布ごとの高さを直接比較できます。",
    "この方法は、値ごとの傾向を明確に視覚化できるため便利ですが、値の範囲が広すぎると、細かな違いが見えづらくなることがあります。",
    "積み上げ棒グラフ（Stacked Bar-Chart）は、各値における全体の頻度（合計）を視覚化したいときに適しています。特に、全体量の構成を見たいときに便利です。",
    "ただし、積み上げられた下層部分（例えば Häufigkeit 2）は、位置が固定されていないため、正確な比較が難しくなります。",
    "そのため、個別の分布を比較したい場合は、棒グラフを横に並べたグループ化表示のほうが望ましいです。"
  ],
  "originalSlideText": "▶ Vergleich zwischen Häufigkeit 1 und Häufigkeit 2 pro dj: gut\n▶ Vergleich der dj innerhalb Häufigkeit 1 oder 2: nicht immer optimal (bei großem Wertebereich)\n▶ Alternative: Stacked Bar-Chart\n▶ sinnvoll bei Aggregation der Häufigkeiten\n▶ Häufigkeit 1: Vergleich einfach\n▶ Häufigkeit 2: Vergleich nicht offensichtlich\n▶ Sonst: aggregierten Wert als eigenes Attribut betrachten",
  "explanationImage": "lecture02/lecture05_ex13.png",
  "questionImage": ""
},
{
  "id": 39,
  "questionDe": "(s50) (mit Bild) Was sind die Eigenschaften der Normalverteilung und Standardnormalverteilung?",
  "questionJa": "正規分布および標準正規分布の特性は？",
  "answerDe": [
    "Dichtefunktion: f(x, µ, σ) = (1 / √(2πσ²)) · e^(−(x−µ)² / (2σ²))",
    "Mittelwert = Median = Modus = µ",
    "Varianz: σ²",
    "Schiefe = 0 (symmetrisch)",
    "Wölbung = 3, Exzess = 0",
    "Standardnormalverteilung: µ = 0, σ = 1"
  ],
  "answerJa": [
    "密度関数：f(x, µ, σ) = (1 / √(2πσ²)) · e^(−(x−µ)² / (2σ²))",
    "平均・中央値・最頻値すべてが µ に一致",
    "分散：σ²",
    "歪度（Schiefe）= 0（対称分布）",
    "尖度（Wölbung）= 3、過剰尖度（Exzess）= 0",
    "標準正規分布：µ = 0、σ = 1"
  ],
  "explanationDe": [
    "Die Normalverteilung ist eine wichtige theoretische Verteilung, die oft zur Modellierung natürlicher Prozesse verwendet wird.",
    "Sie ist symmetrisch um den Mittelwert µ, und ihre Dichtefunktion hat die charakteristische 'Glockenform'.",
    "In der Normalverteilung fallen Mittelwert, Median und Modus alle auf denselben Wert µ – das zeigt ihre perfekte Symmetrie.",
    "Die Varianz σ² beschreibt die Streuung der Werte, die Standardabweichung ist ihre Quadratwurzel.",
    "Der Exzess (Wölbung − 3) beträgt 0, was bedeutet, dass die Verteilung nicht zu spitz oder zu flach ist, sondern genau der 'normalen' Kurvenform entspricht.",
    "Die Standardnormalverteilung ist ein Spezialfall mit µ = 0 und σ = 1 und wird zur Standardisierung von Werten verwendet (z. B. z-Werte)."
  ],
  "explanationJa": [
    "正規分布は、自然現象や測定誤差など、多くの実世界のデータに近似される理論的な分布で、「釣鐘型」の形状を持ちます。",
    "この分布では、平均（Mittelwert）、中央値（Median）、最頻値（Modus）がすべて同じ µ となり、分布が完全に対称です。",
    "分散（σ²）はデータの広がりを表し、標準偏差はその平方根です。",
    "歪度（Schiefe）が 0 なので分布は非対称性がなく、尖度（Wölbung）が 3、過剰尖度（Exzess）は 0 なので、尖り具合も標準的です。",
    "標準正規分布とは、この正規分布の中で平均 µ = 0、標準偏差 σ = 1 に標準化された特別なケースで、z値などの変換に使われます。"
  ],
  "originalSlideText": "Normalverteilung\n▶ Dichtefunktion: f(x ,µ,σ) = 1 / √(2·π·σ²) · e^−(x−µ)² / (2·σ²)\n▶ Mittelwert, Median, Modus: µ\n▶ Varianz: σ²\n▶ Schiefe: 0\n▶ Wölbung: 3\n▶ Exzess: 0\n▶ Standardnormalverteilung: µ = 0, σ = 1\nf(x) = 1 / √(2·π) · e^−x² / 2",
  "explanationImage": "lecture02/lecture05_ex14.png",
  "questionImage": ""
},
{
  "id": 40,
  "questionDe": "(s51) (mit Bild) Was sind die Eigenschaften der Poisson-Verteilung? Wann nähert sie sich der Normalverteilung an?",
  "questionJa": "（画像）ポアソン分布の特徴は？どの条件で正規分布に近づくか？",
  "answerDe": [
    "Dichtefunktion: f(k, λ) = (λ^k / k!) · e^(−λ)",
    "Mittelwert = Varianz = λ",
    "Median: λ − ln(2) ≤ Median ≤ λ + 1/3",
    "Schiefe = 1/√λ",
    "Wölbung = 3 + 1/λ",
    "Für λ ≥ 30: näherungsweise Normalverteilung"
  ],
  "answerJa": [
    "密度関数：f(k, λ) = (λ^k / k!) × e^(−λ)",
    "平均と分散はともに λ に等しい",
    "中央値は λ − ln(2) 以上、λ + 1/3 以下の範囲にある",
    "歪度（Schiefe）：1/√λ",
    "尖度（Wölbung）：3 + 1/λ",
    "λ ≥ 30 のとき、正規分布に近似される"
  ],
  "explanationDe": [
    "Die Poisson-Verteilung beschreibt die Wahrscheinlichkeiten, mit der eine bestimmte Anzahl an Ereignissen (k) in einem festen Zeitraum oder Raumabschnitt eintritt.",
    "Typische Beispiele sind: Anzahl der E-Mails pro Stunde, Ankünfte im Callcenter oder Fehler auf einer Produktionslinie.",
    "Der Parameter λ steht für die durchschnittliche Anzahl der Ereignisse pro Intervall. Er bestimmt sowohl den Mittelwert als auch die Varianz – beide sind gleich λ.",
    "Bei kleinen λ ist die Verteilung stark rechtsschief: Die meisten Werte liegen nahe bei 0, und es gibt einige große Ausreißer.",
    "Je größer λ wird, desto mehr ähnelt die Verteilung einer symmetrischen Glockenkurve – also der Normalverteilung.",
    "Ab etwa λ = 30 ist die Poisson-Verteilung der Normalverteilung so ähnlich, dass man für praktische Zwecke die Normalverteilung als Näherung verwenden kann.",
    "Die Schiefe nimmt mit wachsendem λ ab (1/√λ), ebenso die Abweichung der Wölbung vom Normalverteilungswert (Wölbung → 3)."
  ],
  "explanationJa": [
    "ポアソン分布は、ある時間や空間の中で、特定の出来事が「何回起こるか」を確率的に表す分布です。",
    "例としては、1時間あたりに受ける電話の本数、工場で一定時間内に発生する故障の回数、1kmあたりに交通事故が発生する件数などがあります。",
    "この分布のパラメータ λ（ラムダ）は、「1単位あたりに平均して何回イベントが発生するか」を表します。λ は平均値（Mittelwert）であり、同時に分散（Varianz）にも等しいという特徴があります。",
    "λ が小さいと、多くの値が 0 付近に集中し、長い尾が右側に伸びた非対称（右裾が長い）分布になります。これは「左に急な分布（rechtsschief）」と呼ばれます。",
    "しかし λ が大きくなるにつれ、分布は徐々に対称になり、中央に山のある形へと変化します。",
    "特に λ が 30 以上になると、その形は正規分布（Normalverteilung）と非常によく似てくるため、実務上は正規分布を使って近似することができます。",
    "このように、ポアソン分布は λ の大きさによって形が大きく変わる特徴があり、λ が大きいほど対称性が増し、計算も正規分布を使って簡略化できます。"
  ],
  "originalSlideText": "Poisson-Verteilung\n▶ Dichtefunktion: f(k, λ) = λ^k / k! · e^−λ\n▶ Mittelwert: λ\n▶ Median: λ − ln(2) ≤ median ≤ λ + 1/3\n▶ Varianz: λ\n▶ Schiefe: 1/√λ\n▶ Wölbung: 3 + 1/λ\n▶ Für kleine λ stark asymmetrisch\n▶ Für λ ≥ 30 → annähernd normalverteilt (µ = λ, σ² = λ)",
  "explanationImage": "lecture02/lecture05_ex15.png",
  "questionImage": ""
},
{
  "id": 41,
  "questionDe": "(s52) (mit Bild) Was kennzeichnet die Exponentialverteilung?",
  "questionJa": "（画像）指数分布（Exponentialverteilung）の特徴とは？",
  "answerDe": [
    "Dichtefunktion: f(x, λ) = λ · e^(−λ·x) für x ≥ 0, sonst 0",
    "Mittelwert = 1/λ",
    "Median = ln(2)/λ",
    "Varianz = 1/λ²",
    "Schiefe = 2",
    "Wölbung = 9"
  ],
  "answerJa": [
    "密度関数：f(x, λ) = λ × e^(−λ·x)（x ≥ 0）、それ以外は0",
    "平均：1/λ",
    "中央値：ln(2)/λ",
    "分散：1/λ²",
    "歪度（Schiefe）：2（大きく右に歪んだ分布）",
    "尖度（Wölbung）：9（非常に尖った分布）"
  ],
  "explanationDe": [
    "Die Exponentialverteilung beschreibt die Zeitdauer zwischen zwei aufeinanderfolgenden, zufälligen Ereignissen.",
    "Sie wird häufig verwendet in Warteschlangensystemen, Zuverlässigkeitsanalysen und Modellierung von Lebensdauern – z. B. Zeit bis zum nächsten Maschinenfehler.",
    "Die Verteilung ist auf den positiven Bereich beschränkt (x ≥ 0) und nimmt exponentiell ab: je größer x, desto kleiner die Wahrscheinlichkeit.",
    "Der Mittelwert und die Varianz hängen direkt vom Parameter λ ab – ein größerer λ bedeutet eine stärkere Konzentration der Daten bei kleinen x.",
    "Die Verteilung ist stark rechtsschief (Schiefe = 2) und sehr spitz (Wölbung = 9), was bedeutet, dass viele kleine Werte vorkommen, aber auch wenige, sehr große Ausreißer möglich sind.",
    "Im Gegensatz zur Normalverteilung ist die Exponentialverteilung nicht symmetrisch, sondern einseitig."
  ],
  "explanationJa": [
    "指数分布（Exponentialverteilung）は、「次のイベントまでの時間」を表す確率分布です。",
    "例として、ある機械が故障するまでの時間、次にバスが到着するまでの待ち時間などがこの分布でモデル化されます。",
    "この分布は x ≥ 0 の範囲に定義されており、x が大きくなるほど急速に確率密度が減少します。つまり、短い時間でイベントが発生する可能性が高く、長い時間待つ確率はどんどん小さくなります。",
    "平均（1/λ）や分散（1/λ²）は λ によって決まり、λ が大きくなるほど分布は x = 0 近くに集中します。",
    "歪度（Schiefe）= 2 は強い右裾の分布を意味し、尖度（Wölbung）= 9 は非常に尖った分布であることを示します。",
    "この分布は非対称で、正規分布のように左右均等ではなく、「偏った分布」の代表例です。"
  ],
  "originalSlideText": "Exponentialverteilung\n▶ Dichtefunktion\nf(x, λ) = { λ · e^−λ·x  (x ≥ 0)  |  0  (x < 0) }\n▶ Mittelwert: 1/λ\n▶ Median: ln(2)/λ\n▶ Varianz: 1/λ²\n▶ Schiefe: 2\n▶ Wölbung: 9",
  "explanationImage": "lecture02/lecture05_ex16.png",
  "questionImage": ""
},
{
  "id": 42,
  "questionDe": "(s53) Wie berechnet man kumulierte Häufigkeiten und was bedeutet dp%?",
  "questionJa": "累積頻度の計算方法とdp%の意味とは？",
  "answerDe": [
    "Voraussetzung: geordnete Werte dj (∀i < j: di ≤ dj)",
    "Kumulierte Häufigkeit: H*(dk) = ∑ von j = 1 bis k über h*(dj)",
    "dp% ist der größte Wert dj, bei dem die kumulierte Häufigkeit ≤ p% ist"
  ],
  "answerJa": [
    "前提：値 dj は昇順に並んでいる（すべての i < j に対して di ≤ dj）",
    "累積頻度：H*(dk) = j = 1 から k までの h*(dj) の合計",
    "dp% は「累積頻度が p% 以下となる最大の dj 値」を意味する"
  ],
  "explanationDe": [
    "Die kumulierte Häufigkeit H*(dk) gibt an, wie viele Datenwerte kleiner oder gleich dem Wert dk sind.",
    "Dazu werden alle Häufigkeiten h*(dj) vom kleinsten Wert bis zu dj aufsummiert.",
    "Beispiel: Wenn die Häufigkeiten für Werte 1 bis 5 lauten: h*(1) = 2, h*(2) = 3, h*(3) = 4, dann ist H*(3) = 2 + 3 + 4 = 9.",
    "Der Wert dp% wird verwendet, um Schwellenwerte zu bestimmen – z. B. der Wert, unter dem 90 % der Daten liegen.",
    "Das ist nützlich bei Schwellenwertanalysen, z. B. im Qualitätsmanagement, oder zur Definition von Quantilen."
  ],
  "explanationJa": [
    "累積頻度（H*(dk））とは、「値 dk 以下のデータがいくつあるか」を表す値です。",
    "具体的には、最小の値から順に、その値までに出現した頻度（h*(dj)）をすべて合計します。",
    "例：値1〜3の頻度がそれぞれ2, 3, 4 のとき、H*(3) = 2 + 3 + 4 = 9 となります。",
    "dp% は「全体のうち、p% 以下の累積頻度を満たす最大の値 dj」を示します。たとえば、dp90% は「全体の90%がこの値以下にある」といえる値です。",
    "このような指標は、品質管理での合格基準の設定や、分布の下限・上限の決定などで用いられます。"
  ],
  "originalSlideText": "▶ Voraussetzung: geordnete Daten\n▶ Frage: Wie viele Werte sind kleiner als der aktuelle Wert?\n▶ Seien die Werte dj geordnet: ∀i < j : di ≤ dj\n▶ Summiere die Häufigkeiten vom kleinsten bis zum aktuellen Datenpunkt auf\nH*(dk) = ∑ von j=1 bis k h*(dj)\n▶ dp% := max {dj | H*(dj) ≤ p%}",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 43,
  "questionDe": "(s54) Was sind Quartile und wie sind sie im Kontext von Quantilen definiert?",
  "questionJa": "四分位数（Quartile）とは何か？Quantileとしてどのように定義されるか？",
  "answerDe": [
    "Quantile: Werte, die die Verteilung in Teilbereiche aufteilen",
    "Quartile: spezielle Quantile mit n = 4",
    "Q1: bis zu 25 % der Werte",
    "Q2: bis zu 50 % der Werte (Median)",
    "Q3: bis zu 75 % der Werte",
    "Q4: bis zu 100 % der Werte"
  ],
  "answerJa": [
    "分位点（Quantile）は、データを一定の割合で区切るための値",
    "四分位数（Quartile）は、Quantile を4等分する特別なケース（n = 4）",
    "Q1：データの下位25％を含む",
    "Q2：下位50％（中央値に相当）",
    "Q3：下位75％までをカバー",
    "Q4：全体（100％）を含む"
  ],
  "explanationDe": [
    "Quantile teilen die sortierte Datenverteilung in gleiche Anteile. Ein p-Quantil ist der Wert, unter dem höchstens p % der Daten liegen.",
    "Quartile sind spezielle Quantile, die die Daten in vier gleich große Gruppen aufteilen.",
    "Q1 (1. Quartil) markiert den Punkt, unter dem 25 % der Werte liegen.",
    "Q2 entspricht dem Median und teilt die Daten in zwei Hälften.",
    "Q3 ist der Wert, unter dem 75 % der Werte liegen.",
    "Q4 ist formal der maximale Wert, da es 100 % der Daten abdeckt.",
    "Diese Einteilung hilft, die Verteilung zu verstehen und Ausreißer zu identifizieren."
  ],
  "explanationJa": [
    "Quantile（分位点）とは、データを並べたときに、一定の割合で分割するためのしきい値を意味します。たとえば、p分位点とは、全体のうちp%がその値以下にあるという意味です。",
    "Quartile（四分位数）は、分位点の特別な場合で、データを4つの等しい部分に分ける指標です。",
    "第1四分位数（Q1）は、下位25%までのデータをカバーします。",
    "第2四分位数（Q2）は中央値と一致し、データをちょうど半分に分けます。",
    "第3四分位数（Q3）は、全体の75%までのデータを含みます。",
    "Q4 は理論的には最大値を含む領域で、全体の100%をカバーします。",
    "これらの指標を使うことで、データの分布の広がりや偏り、外れ値の有無などを簡潔に把握できます。"
  ],
  "originalSlideText": "Quantile\n▶ Gliederung der Verteilung in Teilbereiche\n▶ Das Quantil ist der größte Wert di, unterhalb dessen höchstens p % der Werte liegen\n▶ Typisch: Quartile Qi\n▶ 4 Teilbereiche (n = 4)\n▶ Quartil Q1: bis zu 25 % der Werte\n▶ Quartil Q2: bis zu 50 % der Werte\n▶ Quartil Q3: bis zu 75 % der Werte\n▶ Quartil Q4: 100 % der Werte\n▶ Bemerkung: Quartil Q2 entspricht dem Median",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 44,
  "questionDe": "(s55–56) (mit Bild) Was zeigt ein Boxplot und worin unterscheiden sich Tukey-Boxplot und Min-Max-Boxplot?",
  "questionJa": "Boxplotは何を示すか？Tukey型とMin-Max型の違いは？",
  "answerDe": [
    "Boxplot zeigt: Median (Linie), Interquartilsbereich [Q1, Q3] als Box",
    "Tukey-Boxplot: Whisker = Q1 − 1,5·IQR bis Q3 + 1,5·IQR; Ausreißer als Punkte",
    "Min-Max-Boxplot: Whisker = Min bis Max; keine explizite Darstellung von Ausreißern"
  ],
  "answerJa": [
    "Boxplot は中央値（線）と四分位範囲 [Q1, Q3] を示す（箱）",
    "Tukey型Boxplot：ひげ（Whisker）は Q1−1.5×IQR から Q3+1.5×IQR まで、外れ値は点で表示",
    "Min-Max型Boxplot：ひげは最小値から最大値まで、外れ値は特に示されない"
  ],
  "explanationDe": [
    "Ein Boxplot ist ein kompaktes Diagramm zur Darstellung der Verteilung eines Datensatzes. Es zeigt zentrale Lage, Streuung und Ausreißer.",
    "Die Box reicht von Q1 (25 %-Quantil) bis Q3 (75 %-Quantil) – das ist der Interquartilsbereich (IQR). In der Mitte befindet sich der Median.",
    "Der sogenannte Whisker (‚Schnurrhaare‘) zeigt die Daten außerhalb der Box.",
    "Beim Tukey-Boxplot reichen die Whisker typischerweise bis zu Q1 − 1,5·IQR und Q3 + 1,5·IQR. Werte außerhalb dieses Bereichs gelten als Ausreißer und werden als einzelne Punkte dargestellt.",
    "Im Min-Max-Boxplot dagegen reichen die Whisker bis zum kleinsten und größten Wert, unabhängig von IQR. Ausreißer werden hier nicht gesondert gekennzeichnet.",
    "Boxplots sind besonders hilfreich, um mehrere Verteilungen visuell zu vergleichen und Extremwerte auf einen Blick zu erkennen."
  ],
  "explanationJa": [
    "Boxplot（箱ひげ図）は、データの中心（中央値）、ばらつき（四分位範囲）、および外れ値を視覚的に示すシンプルで強力なグラフです。",
    "箱（Box）は第1四分位数（Q1）から第3四分位数（Q3）までを示しており、中央に中央値（Median）の線があります。この範囲は「四分位範囲（IQR）」と呼ばれます。",
    "ひげ（Whisker）は、箱の外側に広がる線で、分布の広がりを表します。",
    "Tukey型のBoxplotでは、ひげの範囲は Q1 − 1.5×IQR から Q3 + 1.5×IQR の間に限定され、それより外の値は外れ値と見なされて点で表示されます。",
    "一方、Min-Max型のBoxplotでは、ひげが最小値から最大値まで伸びており、外れ値の特別な扱いはありません。",
    "Boxplotは、複数のデータセットの分布を比較したり、外れ値の有無をひと目で把握したりするのに非常に役立ちます。"
  ],
  "originalSlideText": "Boxplot\n▶ Median: Linie\n▶ [d25%, d75%]: Box\n▶ IQR = d75% − d25%\n▶ Tukey-Boxplot\n▶ Whisker: d75% + 1,5·IQR / d25% − 1,5·IQR\n▶ Ausreißer: einzelne Punkte\n▶ Min-Max-Boxplot\n▶ Whisker: dmin bis dmax\n▶ Ausreißer: keine Darstellung",
  "explanationImage": "lecture02/lecture05_ex17.png",
  "questionImage": ""
},
{
  "id": 45,
  "questionDe": "(s56) (mit Bild) Welche Varianten von Boxplots sind dargestellt und was zeigen sie jeweils?",
  "questionJa": "この図に示されているBoxplotの種類は何か？それぞれどんな特徴を示しているか？",
  "answerDe": [
    "1. Von links: Ausreißer als Punkte, keine Box (nur Medianlinien)",
    "2. Tukey-Boxplot mit Ausreißer",
    "3. Alternative Darstellung: Punkt statt Box, mit Whisker",
    "4. Min-Max-Boxplot: Whisker reicht bis Min/Max, keine Ausreißer"
  ],
  "answerJa": [
    "左から順に：外れ値を点で表示、箱なし（中央値のみ）",
    "Tukey型Boxplot：外れ値あり、IQRベースのWhisker",
    "代替スタイル：中央値を点で表現、簡易Whiskerつき",
    "Min-Max型Boxplot：ひげが最小値から最大値まで、外れ値の特別な表示なし"
  ],
  "explanationDe": [
    "Diese Abbildung zeigt vier unterschiedliche Visualisierungen von Boxplots:",
    "1. Ganz links: Hier werden nur Medianlinien (kleine horizontale Striche) angezeigt. Der Ausreißer ganz oben (bei ca. 75–80) ist durch einen Kreis markiert. Es gibt keine klassische Box.",
    "2. Zweites Diagramm von links: Das ist ein typischer Tukey-Boxplot. Die Box zeigt den Interquartilsbereich (Q1 bis Q3), die Linie darin den Median. Der Kreis oben stellt einen milden Ausreißer dar (außerhalb Q3 + 1,5·IQR).",
    "3. Drittes Diagramm: Eine vereinfachte Darstellung. Statt einer Box ist nur ein dicker Punkt für den Median sichtbar. Die Whisker markieren die Spannweite der Daten innerhalb 1,5·IQR. Diese Form ist selten, aber kompakt.",
    "4. Ganz rechts: Das ist ein Min-Max-Boxplot. Die Whisker reichen von Minimum bis Maximum. Es werden keine Ausreißer explizit dargestellt – selbst extreme Werte fließen direkt in die Whisker ein."
  ],
  "explanationJa": [
    "この画像には、4種類のBoxplot（箱ひげ図）の表現方法が示されています：",
    "1. 一番左：この形式ではBox（箱）は描かれておらず、中央値を表す水平線が複数（中央値の候補？）表示されています。最上部に円で示された点は、外れ値を意味しています（約75〜80付近）。",
    "2. 左から2番目：これはTukey型のBoxplotです。箱は第1四分位数（Q1）から第3四分位数（Q3）までの範囲を示し、箱内の横線が中央値です。ひげは1.5×IQRの範囲まで伸び、それを超える値（この場合上側）には外れ値として丸印がついています。",
    "3. 左から3番目：代替的な簡易表現です。箱ではなく中央に点（黒丸）を用いて中央値を示しています。ひげはやや短く、データの広がりを簡略に示しています。シンプルですが、詳細情報には欠けます。",
    "4. 一番右：Min-Max型のBoxplotで、ひげはデータの最小値から最大値までをカバーします。外れ値の特別な表現はなく、極端な値もそのまま範囲内に含めて描かれています。",
    "これらのバリエーションは、データの性質や可視化の目的に応じて使い分けることが重要です。外れ値の有無を明示したいならTukey型が適していますが、全体のレンジを把握するにはMin-Max型も有効です。"
  ],
  "originalSlideText": "Werte: 15, 20, 25, 30, 33, 34, 35, 37, 40, 75\nAbbildung: Links: Tukey-Boxplot ohne senkrechte Linien; Mitte-Links: Tukey-Boxplot;\nRechts: Alternative Darstellung des Tukey-Boxplots; Mitte-Rechts: Min-Max-Boxplot",
  "explanationImage": "",
  "questionImage": "lecture02/lecture05_q04.png"
},
{
  "id": 46,
  "questionDe": "(s57) Was sind bi-variate Daten und welche Arten von Beziehungen können zwischen zwei Attributen bestehen?",
  "questionJa": "2変数データ（bi-variate Daten）とは何か？2つの属性の間にはどんな関係があり得るか？",
  "answerDe": [
    "Bi-variate Daten: Datensätze mit zwei Attributen",
    "Beziehungen: monoton steigend, monoton fallend, nicht-monoton",
    "Weitere mögliche Beziehungen: keine Korrelation, lineare oder nichtlineare Zusammenhänge"
  ],
  "answerJa": [
    "2変数データ（bi-variate Daten）：2つの属性（変数）を持つデータ",
    "関係の種類：単調増加、単調減少、非単調な関係",
    "その他の関係：相関なし、線形的または非線形的な関係"
  ],
  "explanationDe": [
    "Bi-variate Daten sind Datensätze, die genau zwei Attribute oder Merkmale enthalten – z. B. Körpergröße und Gewicht einer Person.",
    "Zwischen diesen zwei Attributen kann es verschiedene Arten von Beziehungen geben.",
    "Eine monoton steigende Beziehung bedeutet: Wenn ein Wert steigt, steigt der andere auch (z. B. Körpergröße und Gewicht).",
    "Monoton fallend heißt: Wenn ein Wert steigt, sinkt der andere (z. B. Temperatur und Heizverbrauch).",
    "Nicht-monotone Beziehungen können komplizierter sein – zum Beispiel steigen und fallen die Werte wechselseitig.",
    "In der Praxis unterscheidet man auch zwischen linearen und nichtlinearen Beziehungen sowie Fällen ohne erkennbare Korrelation."
  ],
  "explanationJa": [
    "2変数データ（bi-variate Daten）とは、各データ点が2つの属性（変数）を持っているデータのことです。例えば「身長」と「体重」をセットで記録したデータが該当します。",
    "この2つの変数の間にはさまざまな関係性があり得ます。",
    "「単調増加」の関係とは、一方の値が増えると他方も増えるパターンで、身長が高くなると体重も重くなるというような例です。",
    "「単調減少」は逆に、一方が増えると他方が減る関係で、たとえば外の気温が上がると暖房の使用量が減るといった関係です。",
    "「非単調な関係」では、増減が複雑に入り混じるようなパターンとなります。",
    "また、線形的（直線的）な関係、非線形（曲線的）な関係、あるいはまったく相関がない（関係が見られない）場合もあります。"
  ],
  "originalSlideText": "Bi-variate Daten\n▶ Daten mit zwei Attributen\n▶ Frage: Gibt es einen Zusammenhang zwischen Attribut 1 und Attribut 2?\n▶ Beziehungen zwischen zwei Attributen:\n▶ monoton steigend\n▶ monoton fallend\n▶ nicht-monoton",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 47,
  "questionDe": "(s58) Wie kann man mehrere Attribute mit bekannten Visualisierungstechniken darstellen und welche Einschränkungen gibt es dabei?",
  "questionJa": "複数の属性を従来の可視化手法で表現する方法とその限界とは？",
  "answerDe": [
    "Bekannte Visualisierungen: Balkendiagramme, Punktdiagramme, Linien, Farbe, Größe",
    "Nutzung zusätzlicher visueller Kanäle zur Darstellung weiterer Attribute",
    "Einschränkungen: nur begrenzte Anzahl visueller Kanäle gleichzeitig interpretierbar",
    "Unterschiedliche Lesbarkeit: z. B. Farbe leicht erkennbar, Winkel schwer interpretierbar"
  ],
  "answerJa": [
    "代表的な可視化手法：棒グラフ、散布図、折れ線、色、サイズなど",
    "追加の視覚チャネル（色やサイズなど）を用いて複数属性を同時に表示",
    "限界：一度に認識できる視覚チャネルの数には限りがある",
    "視認性の違い：色は認識しやすいが、角度などは解釈が難しい"
  ],
  "explanationDe": [
    "In klassischen Visualisierungen wie Balken- oder Punktdiagrammen wird meist nur ein Attribut dargestellt.",
    "Um mehrere Attribute gleichzeitig zu zeigen, nutzt man weitere visuelle Kanäle: z. B. Farbe, Form, Größe oder Position.",
    "Beispiel: In einem Punktdiagramm kann die Position die Werte von zwei Attributen zeigen, während die Farbe ein drittes Attribut codiert.",
    "Aber: Menschen können nur eine begrenzte Anzahl von visuellen Codierungen gleichzeitig zuverlässig interpretieren.",
    "Einige Kanäle wie Farbe oder Größe sind leichter zu verstehen, während andere – etwa Winkel oder Textur – schwerer zu interpretieren sind.",
    "Daher stoßen herkömmliche Visualisierungstechniken bei mehrdimensionalen Daten schnell an ihre Grenzen."
  ],
  "explanationJa": [
    "棒グラフや散布図などの従来の可視化手法では、基本的に1つの属性だけを扱うことが多いです。",
    "しかし複数の属性を同時に可視化したいときは、色、形、大きさ、位置などの追加の視覚的要素（チャネル）を使います。",
    "例えば散布図では、x軸とy軸で2つの変数を示し、点の色を使って3つ目の変数を表すことができます。",
    "ただし、人間が一度に解釈できる視覚情報には限界があり、使えるチャネルの数も限られています。",
    "色や大きさは比較的わかりやすいですが、角度やテクスチャといった情報は認識が難しくなります。",
    "このように、多次元データを従来の可視化手法で扱うには限界があり、注意が必要です。"
  ],
  "originalSlideText": "▶ Bekannte Visualisierungen können mehrere Attribute kombinieren\n▶ zusätzliche visuelle Kanäle:\n– Position (x,y), Farbe, Winkel, Größe, Form …\n▶ Einschränkung: begrenzte Anzahl an Kanälen ist gleichzeitig sinnvoll nutzbar\n▶ Beispiel: Farbe leicht unterscheidbar, Winkel schwerer",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 48,
  "questionDe": "(s59) Was sind Small-Multiples und welche Vorteile und Nachteile haben sie, insbesondere bei Pie-Charts?",
  "questionJa": "Small-Multiples（スモールマルチプル）とは？特にPie Chartと組み合わせたときの利点・欠点は？",
  "answerDe": [
    "Small-Multiples: Serie gleichartiger Diagramme zur Vergleichbarkeit",
    "Vorteil: gute Vergleichbarkeit bei gleicher Skala",
    "Nachteil: Pie-Charts schwer vergleichbar wegen Form, Fläche, Winkel"
  ],
  "answerJa": [
    "Small-Multiples：同じ種類の図を並べて比較する手法",
    "利点：スケールを統一すれば、異なるデータの比較がしやすい",
    "欠点：Pie Chartと組み合わせると、形状・面積・角度の違いが直感的に比較しづらくなる"
  ],
  "explanationDe": [
    "Small-Multiples sind eine Technik, bei der viele gleichartige Visualisierungen nebeneinander dargestellt werden, z. B. für verschiedene Kategorien oder Zeitpunkte.",
    "Der Vorteil besteht darin, dass sich Unterschiede und Trends durch den direkten visuellen Vergleich gut erkennen lassen – vorausgesetzt, alle Diagramme nutzen die gleiche Skala.",
    "Bei Pie-Charts ist das schwieriger: Menschen haben Probleme, Flächen und Winkel korrekt zu vergleichen.",
    "Zum Beispiel kann es schwer sein, auf Anhieb zu erkennen, ob der blaue Bereich in Kreis A größer oder kleiner ist als im Kreis B, selbst wenn der Unterschied objektiv messbar ist.",
    "Daher sind Balkendiagramme für Small-Multiples oft besser geeignet als Pie-Charts."
  ],
  "explanationJa": [
    "Small-Multiples（スモールマルチプル）とは、同じ種類の可視化（例：グラフや図）を複数並べて表示することで、異なる条件や時間、カテゴリごとの変化を比較しやすくする技法です。",
    "同じスケールを使うことで、視覚的に違いを明確に把握できるという利点があります。",
    "ただし、Pie Chart（円グラフ）と組み合わせた場合は注意が必要です。",
    "人間は面積や角度のわずかな違いを直感的に比較するのが苦手で、たとえば「青い部分がどれくらい増えたか／減ったか」を複数の円グラフで比較するのは難しいです。",
    "そのため、Small-Multiplesを使う場合はPie Chartよりも棒グラフなどの方が比較しやすいことが多いです。"
  ],
  "originalSlideText": "Small-Multiples\n▶ Serie gleichartiger Diagramme\n▶ Beispiel: jeweils Pie-Chart mit 3 Segmenten\n▶ Problem: Pie-Charts schwer vergleichbar\n▶ Form, Fläche, Winkel nicht leicht interpretierbar\n▶ Skala fehlt → Vergleich erschwert",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 49,
  "questionDe": "(s60) (mit Bild) Wie können Bar-Charts zur Darstellung bi-variater Daten genutzt werden?",
  "questionJa": "棒グラフ（Bar Chart）は2変数データをどう可視化できるか？",
  "answerDe": [
    "Bar-Chart zeigt Wert eines Attributs (z. B. Preis) pro Ausprägung eines anderen Attributs (z. B. Produkt)",
    "Geeignet für kategorische Daten",
    "Einfache Zuordnung: x-Achse = Kategorien, y-Achse = numerische Werte"
  ],
  "answerJa": [
    "棒グラフは、1つの属性（例：商品カテゴリ）ごとに別の属性（例：価格や数量）を対応させて表現できる",
    "カテゴリデータに適している",
    "例：x軸が製品名、y軸が価格を示すなど、対応関係が明快に可視化できる"
  ],
  "explanationDe": [
    "Bar-Charts (Balkendiagramme) sind eine klassische Methode zur Darstellung bi-variater Daten, insbesondere wenn eine der beiden Variablen kategorial ist.",
    "Dabei wird eine Variable (z. B. Produktname, Region) auf der x-Achse dargestellt, während die andere (z. B. Umsatz, Preis) als Balkenhöhe auf der y-Achse abgebildet wird.",
    "So lassen sich Unterschiede oder Trends über verschiedene Kategorien hinweg leicht erkennen.",
    "In der gezeigten Abbildung sind z. B. Produkte A–E auf der x-Achse, und deren jeweilige Werte (Preis oder Menge) als vertikale Balken sichtbar.",
    "Dies ist besonders nützlich bei der Darstellung von Rankings, Verteilungen oder Gruppierungen in Geschäftsdaten oder Umfragen."
  ],
  "explanationJa": [
    "棒グラフ（Bar Chart）は、2つの変数のうち1つがカテゴリデータ（例：商品名や地域）であるときに、非常に効果的な可視化手法です。",
    "カテゴリ属性をx軸に取り、それに対応する数値（例：売上、価格、数量など）をy軸の棒の高さで表現します。",
    "これにより、各カテゴリ間での数値の違いや傾向を一目で把握することができます。",
    "図では、A～Eの製品がx軸に並び、それぞれに対する数値データが棒の高さで表されています。",
    "この形式はランキングや分布、比較が重要なシーン（ビジネスレポートやアンケート結果の分析など）に非常によく用いられます。"
  ],
  "originalSlideText": "Bar-Chart als Bi-variate Darstellung\n▶ x-Achse: Kategorien (z. B. Produkte A–E)\n▶ y-Achse: Werte (z. B. Preis, Umsatz)\n▶ Balkenhöhe zeigt den Wert für jede Kategorie\n▶ Vergleich über Kategorien möglich",
  "explanationImage": "lecture02/lecture05_ex18.png",
  "questionImage": ""
},
{
  "id": 50,
  "questionDe": "(s61) Was sind gekoppelte Histogramme (linked histograms) und wie werden sie gekoppelt?",
  "questionJa": "リンク付きヒストグラム（linked histograms）とは？どうリンクさせるのか？",
  "answerDe": [
    "Gekoppelte Histogramme: mehrere Histogramme, die unterschiedliche Attribute zeigen",
    "Kopplung: durch Interaktion – Auswahl in einem Histogramm beeinflusst die Darstellung im anderen",
    "Ziel: Korrelationen oder Verteilungen über gemeinsame Datenbasis erkennen"
  ],
  "answerJa": [
    "リンク付きヒストグラム（linked histograms）：異なる属性を示す複数のヒストグラムを連携させたもの",
    "リンクの方法：片方のヒストグラムで選択（highlight）すると、もう一方の表示も自動的に連動する",
    "目的：共通のデータにおける分布や相関関係を視覚的に理解すること"
  ],
  "explanationDe": [
    "Gekoppelte Histogramme (linked histograms) bestehen aus zwei oder mehr Histogrammen, die verschiedene Attribute darstellen, aber dieselbe Datenbasis verwenden.",
    "Der Schlüssel liegt in der Interaktivität: Wenn man in einem Histogramm eine Auswahl trifft (z. B. ein Intervall markiert), wird diese Auswahl auch im anderen Histogramm hervorgehoben.",
    "So kann man Zusammenhänge zwischen Attributen entdecken, z. B. ob bestimmte Werte im einen Attribut mit bestimmten Bereichen im anderen Attribut verbunden sind.",
    "Beispiel: Man markiert im Histogramm der Variable ‚Einkommen‘ alle Werte über 100 000 €, und im Histogramm ‚Alter‘ wird automatisch angezeigt, in welchen Altersgruppen diese Einkommen vorkommen.",
    "Diese Technik wird häufig in interaktiven Dashboards oder Visual Analytics-Systemen verwendet."
  ],
  "explanationJa": [
    "リンク付きヒストグラム（linked histograms）は、異なる属性の分布を示す複数のヒストグラムを相互に連動させた可視化手法です。",
    "ポイントは「インタラクティブ性」です。たとえば、片方のヒストグラムで特定の範囲を選択すると、その範囲に該当するデータがもう一方のヒストグラムでも自動的に強調表示されます。",
    "これにより、複数の変数間の関連性や傾向を視覚的に把握できます。",
    "具体例：収入に関するヒストグラムで「年収10万ユーロ以上」を選択すると、別のヒストグラム（年齢など）でその収入層がどの年齢層に属しているかが視覚的に表現されます。",
    "この手法は、インタラクティブなダッシュボードやデータ分析ツールでよく用いられています。"
  ],
  "originalSlideText": "Gekoppelte Histogramme\n▶ Zwei Histogramme zeigen unterschiedliche Attribute derselben Daten\n▶ Selektion in einem Histogramm hebt zugehörige Werte im anderen hervor\n▶ Beispiel: Selektion im Attribut „Preis“ zeigt Verteilung im Attribut „Produkt“",
  "explanationImage": "lecture02/lecture05_ex19.png",
  "questionImage": ""
},
{
  "id": 51,
  "questionDe": "(s62) Warum betrachtet man auch bei einfachen Diagrammen oft implizit zwei Attribute und welche Begrenzungen ergeben sich daraus?",
  "questionJa": "単純な可視化でも実は2属性を見ていることがある？そしてその視覚的な制約とは？",
  "answerDe": [
    "Auch bei einfachen Balkendiagrammen wird meist ein zweites Attribut (Kategorie) implizit dargestellt",
    "Die visuelle Darstellung ist oft auf ein Attribut beschränkt (z. B. nur Höhe für Werte)",
    "Vergleich zwischen Werten eines Attributs erfolgt über deren Ausprägungen (z. B. Produkte)"
  ],
  "answerJa": [
    "単純な棒グラフでも、1つの数値属性だけでなく、カテゴリなどの2番目の属性を暗黙的に扱っている",
    "ただし、視覚的には数値（棒の高さなど）のみが明示され、カテゴリは補助的に扱われる",
    "このため、複雑な構造や関係性の可視化には限界がある"
  ],
  "explanationDe": [
    "Viele klassische Diagramme – wie das einfache Balkendiagramm – zeigen scheinbar nur ein Attribut, etwa den Umsatz.",
    "Tatsächlich wird aber immer auch ein zweites Attribut genutzt, das in der Regel kategorisch ist – zum Beispiel die Produktgruppe, Region oder Zeit.",
    "Dieses zweite Attribut ist meist implizit durch die Anordnung der Balken dargestellt und beeinflusst, wie die Werte wahrgenommen und verglichen werden.",
    "Das Problem: Die visuelle Kodierung bezieht sich nur auf das numerische Attribut (z. B. Höhe der Balken), das andere Attribut wird nur als Achsenbeschriftung wahrgenommen.",
    "Damit ist die visuelle Vergleichbarkeit von Beziehungen zwischen Attributen eingeschränkt, besonders bei komplexeren Daten."
  ],
  "explanationJa": [
    "一見すると単純な棒グラフ（Bar Chart）などは、1つの数値的属性（例：売上）を示しているように見えます。",
    "しかし実際には、「どの売上か？」を示すためのカテゴリ情報（例：製品、地域、時間など）という2つ目の属性も関わっています。",
    "このカテゴリ属性は、棒の位置や並び順で暗黙的に示されており、視覚的には「補助的な役割」を果たします。",
    "視覚的に明示されているのは数値属性（棒の高さなど）のみなので、2つの属性の関係性や構造を視覚的に比較するには限界があります。",
    "特に多次元の関係性やパターンを見たい場合、より高度な可視化手法が必要になります。"
  ],
  "originalSlideText": "▶ Auch einfache Diagramme zeigen oft zwei Attribute\n▶ Beispiel: Balkendiagramm → Attribut = Höhe, Ausprägung = Produkt\n▶ Aber: Nur ein Attribut ist visuell kodiert\n▶ Andere Informationen nur implizit als Achsenbeschriftung",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 52,
  "questionDe": "(s63) Was zeigt ein Scatterplot und wie ist er aufgebaut?",
  "questionJa": "Scatterplot（散布図）とは何を示し、どのように構成されているか？",
  "answerDe": [
    "Scatterplot zeigt Datenpunkte als Positionen in einem 2D-Koordinatensystem",
    "x-Achse: Attribut 1",
    "y-Achse: Attribut 2",
    "Zusätzliche Attribute können durch Farbe, Größe oder Form dargestellt werden"
  ],
  "answerJa": [
    "Scatterplot は、データ点を2次元の座標系上の位置で表す図",
    "x軸には第1の属性、y軸には第2の属性を対応させる",
    "さらに他の属性を色・大きさ・形で同時に表すこともできる"
  ],
  "explanationDe": [
    "Ein Scatterplot (Streudiagramm) ist eine Visualisierungstechnik zur Darstellung von bi-variaten (zwei Attributen) numerischen Daten.",
    "Jeder Punkt im Diagramm stellt ein Datenobjekt dar, wobei die x- und y-Koordinaten die Werte zweier Attribute anzeigen.",
    "Zusätzliche Informationen lassen sich durch Farbe (z. B. Gruppenzugehörigkeit), Größe (z. B. Gewicht), Form oder Transparenz kodieren.",
    "Scatterplots eignen sich besonders gut, um Zusammenhänge, Cluster oder Ausreißer zwischen zwei Attributen zu erkennen.",
    "Beispiel: Ein Scatterplot mit x = Einkommen und y = Alter kann zeigen, ob es eine Korrelation zwischen diesen beiden Größen gibt."
  ],
  "explanationJa": [
    "Scatterplot（散布図）は、2つの数値的な変数（属性）を持つデータを、2次元の座標上に点としてプロットする可視化手法です。",
    "各点は1つのデータオブジェクトを表し、その位置はx軸とy軸に割り当てられた2つの属性の値によって決まります。",
    "さらに、点の色を変えることでカテゴリを表したり、サイズで別の数値的属性を示したり、形や透明度で追加情報を付加することもできます。",
    "Scatterplotは、2変数間の関係性（相関）、グループの分布（クラスタ）、または外れ値（異常値）などを視覚的に把握するのに適しています。",
    "例えば、x軸に年収、y軸に年齢を取った散布図では、これら2つの間に関係があるかどうかが一目でわかります。"
  ],
  "originalSlideText": "Scatterplot\n▶ Punkte im 2D-Koordinatensystem\n▶ x- und y-Achse: zwei Attribute\n▶ Zusätzliche Attribute: Farbe, Größe, Form\n▶ Ziel: Muster, Korrelationen, Cluster erkennen",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 53,
  "questionDe": "(s64) Welche Herausforderungen gibt es beim Erstellen von Scatterplots und wie kann man sie adressieren?",
  "questionJa": "Scatterplot作成時に起こる問題と、その対処方法とは？",
  "answerDe": [
    "Überlagerung von Punkten (Overplotting) bei hoher Dichte",
    "Lösung: Transparenz, Jittering, Aggregation oder Hexbinning",
    "Skalierung erforderlich bei unterschiedlichen Wertebereichen",
    "Achsenwahl und Zoom beeinflussen Wahrnehmung"
  ],
  "answerJa": [
    "点が重なり合う（Overplotting）ことで見えづらくなる",
    "対処法：透明度を下げる、位置をランダムにずらす（Jittering）、集約表示（Binning）など",
    "属性値のスケールが異なる場合は軸の調整が必要",
    "軸の選び方やズームの仕方で見え方が大きく変わる"
  ],
  "explanationDe": [
    "Bei Scatterplots kann es bei großen Datenmengen schnell zu Overplotting kommen – viele Punkte überlappen sich und verdecken Informationen.",
    "Eine Lösung ist die Verwendung von Transparenz (Alpha-Kanal), sodass dichtere Regionen durch dunklere Farben sichtbar werden.",
    "Jittering (leichtes Zufallsrauschen) kann helfen, identische oder ähnliche Punkte sichtbar zu machen.",
    "Alternativ können Aggregationstechniken wie Hexbinning (sechseckige Cluster) verwendet werden, um dichte Regionen strukturierter darzustellen.",
    "Ein weiteres Problem: Unterschiede in den Wertebereichen der Achsen können Muster verzerren – daher ist eine geeignete Skalierung oder Normalisierung notwendig.",
    "Die Wahl der Achsen und der Zoomfaktor beeinflussen maßgeblich, ob Strukturen wie Korrelationen oder Cluster überhaupt sichtbar werden."
  ],
  "explanationJa": [
    "Scatterplotでは、データ点が多すぎると点同士が重なり合い（Overplotting）、本来の構造や傾向が見えなくなってしまうことがあります。",
    "このようなときは、透明度（Alpha値）を下げることで密集部分の濃さで分布を表したり、似た値を持つ点の位置を少しだけランダムにずらす（Jittering）などの対策が有効です。",
    "また、Hexbin（六角形でまとめる）などの集約表現を使えば、分布の密度をより構造的に可視化できます。",
    "加えて、x軸とy軸の値のスケール（単位や範囲）が大きく異なる場合、図が歪んでしまうため、適切な軸の調整やスケーリングが必要です。",
    "どの属性を軸に選ぶか、どのくらい拡大して見るか（ズーム）は、クラスタや傾向が見えるかどうかに大きく影響します。"
  ],
  "originalSlideText": "Scatterplot – Probleme\n▶ Overplotting: Punkte überdecken sich\n▶ Lösung: Transparenz, Jittering, Aggregation\n▶ Unterschiedliche Wertebereiche: Skalierung nötig\n▶ Wahl der Achsen/Zoom beeinflusst Darstellung",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 54,
  "questionDe": "(s65) (mit Bild) Was zeigt ein Scatterplot mit und ohne Regressionslinie?",
  "questionJa": "回帰直線あり／なしのScatterplotは何を示すか？",
  "answerDe": [
    "Scatterplot ohne Linie: zeigt nur die Punktverteilung zweier Attribute",
    "Scatterplot mit Regressionslinie: zeigt zusätzlich den geschätzten linearen Zusammenhang",
    "Hilfreich zur Einschätzung der Korrelation und Trendrichtung"
  ],
  "answerJa": [
    "回帰直線なしのScatterplotは、2つの属性間の点の分布だけを示す",
    "回帰直線ありのScatterplotは、2変数間の線形的な傾向（関係性）を推定した線を示す",
    "相関や傾向の方向を視覚的に把握するのに役立つ"
  ],
  "explanationDe": [
    "Ein Scatterplot ohne Regressionslinie zeigt nur die Verteilung der Datenpunkte in einem zweidimensionalen Raum.",
    "Das erlaubt visuell zu erkennen, ob eine Beziehung – z. B. linear oder nichtlinear – vorliegen könnte.",
    "Wird eine Regressionslinie eingezeichnet, so zeigt diese den 'besten linearen Fit' zu den Daten – also die Gerade, die den Zusammenhang am besten beschreibt.",
    "Je stärker die Punkte um diese Linie gruppiert sind, desto stärker ist die lineare Korrelation.",
    "In der Abbildung sieht man links ein reines Punktdiagramm und rechts zusätzlich eine eingezeichnete Regressionsgerade, die den Trend verdeutlicht.",
    "Diese Methode hilft besonders bei der Vorhersage und Modellbildung."
  ],
  "explanationJa": [
    "回帰直線がないScatterplotは、単に2つの属性間の散布（点の分布）を示すものです。",
    "この形式でも点の密度やクラスタなど、関係性の雰囲気を読み取ることは可能です。",
    "一方、回帰直線（regression line）を加えることで、データ全体の傾向（主に線形関係）を明確に可視化できます。",
    "回帰直線とは、点群のパターンに最もよく合う1本の直線であり、データの傾向の方向性（増加傾向／減少傾向）を直感的に示します。",
    "図では、左は点のみのScatterplot、右はそれに回帰直線が加えられており、右図のほうが全体の関係性をつかみやすくなっています。",
    "このような表現は、相関の強さを判断したり、将来値の予測に活用したりする際に非常に有用です。"
  ],
  "originalSlideText": "Scatterplot mit/ohne Regressionslinie\n▶ Links: Punkte ohne Linie – Verteilung sichtbar\n▶ Rechts: Regressionsgerade zeigt Trend\n▶ Aussagekraft erhöht sich durch Linie\n▶ Visuelle Unterstützung zur Erkennung von Zusammenhängen",
  "explanationImage": "lecture02/lecture05_ex20.png",
  "questionImage": ""
},
{
  "id": 55,
  "questionDe": "(s67) Was sind tri-variate Daten und welche Arten von Zusammenhängen können zwischen den drei Attributen bestehen?",
  "questionJa": "三変数データ（tri-variate Daten）とは何か？その中で見られる関係の種類とは？",
  "answerDe": [
    "Tri-variate Daten: Datensätze mit drei Attributen",
    "Mögliche Zusammenhänge: Korrelation, Anti-Korrelation, kein Zusammenhang"
  ],
  "answerJa": [
    "三変数データ：3つの属性を含むデータセット",
    "関係の種類：相関（Korrelation）、反相関（Anti-Korrelation）、無相関（kein Zusammenhang）"
  ],
  "explanationDe": [
    "Tri-variate Daten bestehen aus Datensätzen mit genau drei Attributen – z. B. Größe, Gewicht und Alter einer Person.",
    "Man untersucht, ob und wie diese drei Attribute miteinander zusammenhängen.",
    "Eine positive Korrelation bedeutet, dass ein Attribut mit einem anderen gemeinsam steigt – z. B. Gewicht steigt mit Größe.",
    "Eine Anti-Korrelation (negative Korrelation) bedeutet, dass ein Attribut fällt, wenn ein anderes steigt – z. B. Spritverbrauch sinkt mit Effizienz.",
    "Kein Zusammenhang bedeutet, dass Änderungen eines Attributs keinen Einfluss auf die anderen haben – z. B. Telefonnummer und Körpergewicht.",
    "Diese Unterscheidung ist wichtig, um relevante Muster und Strukturen in mehrdimensionalen Daten zu erkennen."
  ],
  "explanationJa": [
    "三変数データ（tri-variate Daten）とは、各データ点が3つの異なる属性（変数）を持っているデータのことです。例えば、「身長」「体重」「年齢」といった3つの項目を1人の人物ごとに記録したデータなどが該当します。",
    "このようなデータでは、3つの属性間にどのような関係があるかを分析することが目的となります。",
    "「相関（Korrelation）」とは、一方の属性が増えると他方も増えるような関係です（例：身長が高い人は体重も多い傾向がある）。",
    "「反相関（Anti-Korrelation）」はその逆で、一方が増えると他方が減る関係です（例：燃費が良くなると燃料消費量は減る）。",
    "「無相関（kein Zusammenhang）」とは、ある属性の変化が他の属性に全く影響しない場合です（例：電話番号と体重には関係がない）。",
    "このような関係性の分類は、データから意味のあるパターンや相関を見つけるための基本となります。"
  ],
  "originalSlideText": "Tri-Variate Daten (2D)\n▶ Gegeben\n▶ n Datenpunkte\n▶ 3 Attribute\n▶ Werte der Attribute\n\nX = {xij | 1 ≤ i ≤ n ∧ 1 ≤ j ≤ 3}\n\n▶ Typische Fragen:\n▶ Welchen Zusammenhang gibt es zwischen den Attributen?\n▶ Korrelation\n▶ Anti-Korrelation\n▶ Keinen Zusammenhang",
  "explanationImage": "lecture02/lecture05_ex21.png",
  "questionImage": ""
},
{
  "id": 56,
  "questionDe": "(s67) Welche Probleme treten bei der 2D-Darstellung von 3D-Scatterplots auf?",
  "questionJa": "三次元Scatterplotを2次元で表現するときにどんな問題が生じるか？",
  "answerDe": [
    "Reduktion auf 2D-Projektion: Verlust von Tiefe und räumlicher Information",
    "Verdeckungsproblem: Punkte überlagern sich",
    "Schwierigkeit, Werte der drei Attribute eindeutig zu bestimmen"
  ],
  "answerJa": [
    "2次元への射影によって、奥行きや空間的な情報が失われる",
    "隠れ（重なり）の問題が発生する（Verdeckungsproblem）",
    "3つの属性それぞれの値が正確に読み取れない場合がある"
  ],
  "explanationDe": [
    "Ein 3D-Scatterplot stellt drei Attribute eines Datensatzes als Punkte im dreidimensionalen Raum dar.",
    "Da Bildschirme nur zweidimensional sind, muss diese Darstellung auf eine 2D-Projektion reduziert werden – z. B. durch Perspektive oder Projektion auf eine Ebene.",
    "Dabei gehen wichtige räumliche Informationen verloren, wie z. B. die exakte Tiefe eines Punktes.",
    "Ein zentrales Problem ist das Verdeckungsproblem: Punkte, die im Raum hintereinander liegen, erscheinen in der Projektion übereinander und sind schwer zu unterscheiden.",
    "Zudem wird es schwierig, die exakten Werte der drei Attribute abzulesen, insbesondere wenn keine Hilfslinien oder Interaktionen vorhanden sind.",
    "Diese Einschränkungen machen es herausfordernd, Muster oder Korrelationen in 3D-Daten durch reine 2D-Darstellungen zu erkennen."
  ],
  "explanationJa": [
    "3次元Scatterplotは、本来3つの属性を空間的に位置づけて表示するグラフです。",
    "しかし通常の画面は2次元なので、それを表示するには2Dに投影（プロジェクション）する必要があります。",
    "この射影により、奥行きや立体的な構造といった重要な空間情報が失われてしまいます。",
    "特に問題になるのが「隠れ（Verdeckungsproblem）」です。3次元空間では離れていた点が、2次元上では重なって表示され、見分けがつきにくくなります。",
    "また、3つの属性それぞれの数値を正確に読み取るのが難しくなるため、データの解釈にも支障が出ます。",
    "このような理由から、3D Scatterplotの2D表現には限界があり、補助的な手法やインタラクションと併用することが重要です。"
  ],
  "originalSlideText": "Tri-Variate Daten (2D)\n3D-Scatterplot\n▶ Logische oder geometrische 2D-Projektion der 3D Darstellung\n▶ Probleme:\n▶ 2D-Darstellung eines 3D-Raumes\n▶ Wie bestimmt man die Werte der Attribute aus der Darstellung?\n▶ Verdeckungsproblem\n▶ Datensatz: “Cars” (Autos)",
  "explanationImage": "lecture02/lecture05_ex22.png",
  "questionImage": ""
},
{
  "id": 57,
  "questionDe": "(s68) (mit Bild) Wie helfen drei achsenparallele 2D-Scatterplots (Small Multiples), Zusammenhänge in tri-variaten Daten zu erkennen?",
  "questionJa": "3つの軸平行な2D-Scatterplot（Small Multiples）によって三変数データの関係性をどう可視化できるか？",
  "answerDe": [
    "Drei 2D-Scatterplots zeigen alle paarweisen Beziehungen zwischen Attributen",
    "Jede Projektion erlaubt Einsicht in eine 1:1-Beziehung (z. B. a1 vs a2)",
    "Durch Vergleich lassen sich Korrelationen zwischen Attributpaaren erkennen"
  ],
  "answerJa": [
    "3つの2D散布図で、3つの属性のすべての組み合わせ（a1とa2、a1とa3、a2とa3）の関係を視覚化できる",
    "それぞれのプロットは2つの属性間の1対1の関係を示している",
    "これにより、各属性ペア間の相関やパターンを比較・識別できる"
  ],
  "explanationDe": [
    "Bei tri-variaten Daten mit drei Attributen gibt es drei mögliche paarweise Kombinationen: (a1, a2), (a1, a3) und (a2, a3).",
    "Jeder dieser Scatterplots zeigt eine Projektion der Datenpunkte auf eine 2D-Ebene und erlaubt so die Analyse der Beziehung zwischen zwei Attributen.",
    "Indem man die drei Scatterplots nebeneinander anordnet (Small Multiples), lassen sich die Muster, Korrelationen oder Streuungen visuell vergleichen.",
    "Diese Methode ist leicht interpretierbar, da sie jeweils nur zwei Dimensionen auf einmal zeigt – was für Menschen einfacher wahrnehmbar ist als 3D-Darstellungen.",
    "Sie ist besonders hilfreich, um herauszufinden, ob zwei von drei Attributen eng miteinander verbunden sind, während das dritte weniger relevant ist."
  ],
  "explanationJa": [
    "3つの属性を持つ三変数データでは、属性同士の関係を把握するために、各2つの属性ペアごとに散布図（Scatterplot）を作成します。",
    "具体的には、(a1, a2)、(a1, a3)、(a2, a3)の3通りの2D Scatterplotが作成され、それぞれが異なるペアの関係性を示します。",
    "このような図を並べて表示する方法を「Small Multiples」と呼びます。",
    "この手法の利点は、一度に2次元の関係しか見ないため、3次元空間を無理に可視化するよりも直感的で理解しやすいことです。",
    "比較することで、どの属性同士に強い相関があるか、あるいは関係がないかを容易に見つけることができます。"
  ],
  "originalSlideText": "Tri-Variate Daten (2D)\nSmall Multiples: drei 2D-Scatterplots\n▶ Betrachtung aller achsenparallelen Projektionen (2D-Scatterplots)\n▶ Alle drei möglichen 1-1 Beziehungen können untersucht werden\nAbbildung: [Spence2001]",
  "explanationImage": "lecture02/lecture05_ex23.png",
  "questionImage": ""
},
{
  "id": 58,
  "questionDe": "(s69) (mit Bild) Was ist eine Scatterplot-Matrix und wie unterstützt Brushing die Analyse?",
  "questionJa": "Scatterplot-Matrixとは何か？Brushing（ブラッシング）はどう役立つか？",
  "answerDe": [
    "Scatterplot-Matrix: Matrix aus allen paarweisen Scatterplots zwischen Attributen",
    "Brushing: Hervorheben von Punkten in einem Plot zeigt diese gleichzeitig in allen anderen Plots",
    "Unterstützt Erkennung von Mustern, Korrelationen und Clustern"
  ],
  "answerJa": [
    "Scatterplot-Matrix：すべての属性ペアに対して散布図を並べたマトリクス形式の可視化手法",
    "Brushing（ブラッシング）：1つの図で選択されたデータ点が、他のすべての図でも同時に強調表示される",
    "これにより、相関やクラスタなどのパターンの発見が容易になる"
  ],
  "explanationDe": [
    "Eine Scatterplot-Matrix ist eine kompakte Visualisierung für Daten mit mehreren Attributen.",
    "Für jedes Attributpaar (z. B. a1 vs a2, a1 vs a3, a2 vs a3 usw.) wird ein eigener 2D-Scatterplot erzeugt und in eine Matrixanordnung eingefügt.",
    "So lassen sich alle Beziehungen zwischen Attributen gleichzeitig betrachten und vergleichen.",
    "Mit Brushing kann man interaktiv einen Bereich in einem der Scatterplots auswählen, z. B. einen Cluster oder Ausreißer.",
    "Diese Auswahl wird automatisch auf alle anderen Scatterplots übertragen – die entsprechenden Datenpunkte werden dort ebenfalls hervorgehoben.",
    "Dadurch lassen sich komplexe Zusammenhänge in hochdimensionalen Daten schneller und intuitiver erkennen."
  ],
  "explanationJa": [
    "Scatterplot-Matrix（散布図マトリクス）は、多変量データの全ての属性ペアに対して2次元の散布図を作成し、それらをマトリクス状に並べた可視化手法です。",
    "この方法により、どの属性間にどのような相関があるかを一目で把握することができます。",
    "Brushing（ブラッシング）は、ある1つの散布図で選択したデータ点が、他のすべての散布図でも同時に強調表示されるインタラクティブな操作です。",
    "これにより、特定のグループ（例：クラスタ）や異常値（アウトライヤー）が複数の属性にまたがってどのようなパターンを持っているかを簡単に確認できます。",
    "Scatterplot-MatrixとBrushingを組み合わせることで、多次元データの構造をより効率的に視覚的に理解できます。"
  ],
  "originalSlideText": "Scatterplot-Matrix\n▶ Matrix aller paarweisen Scatterplots\n▶ Brushing:\n▶ Selektion in einem Scatterplot\n▶ Markierung in allen anderen Scatterplots sichtbar\nAbbildung: [Martin et al. 2010]",
  "explanationImage": "lecture02/lecture05_ex24.png",
  "questionImage": ""
},
{
  "id": 59,
  "questionDe": "(s70) (mit Bild) Wie kann man drei Dimensionen durch Kombination von Position, Farbe und Größe darstellen und was sind die Nachteile?",
  "questionJa": "位置・色・サイズを使って3次元を可視化する方法とその欠点とは？",
  "answerDe": [
    "Darstellung: x- und y-Position für zwei Attribute, Farbe oder Größe für das dritte Attribut",
    "Nachteile: Farbe nicht ordinal interpretierbar, Größe schwer vergleichbar, Wahrnehmungsverzerrung",
    "Ungeeignet für sehr große Datenmengen"
  ],
  "answerJa": [
    "表現方法：x軸とy軸の位置で2つの属性を示し、3つ目の属性を色やサイズで表現する",
    "欠点：色は順序性が伝わりにくく、サイズは視覚的に正確に比較しにくい",
    "さらに、人間の視覚的認識に偏りがあり、大規模データには不向き"
  ],
  "explanationDe": [
    "Um drei Attribute gleichzeitig darzustellen, wird häufig ein 2D-Streudiagramm genutzt, bei dem zwei Attribute durch Position (x, y) und das dritte durch Farbe oder Größe kodiert werden.",
    "Zum Beispiel: x = Alter, y = Einkommen, Farbe = Geschlecht oder Größe = Konsumausgaben.",
    "Diese Methode ist intuitiv, aber visuell begrenzt.",
    "Farben sind schwer ordinal zu interpretieren – z. B. ist nicht immer klar, ob rot größer als blau ist.",
    "Auch Größenunterschiede werden schnell falsch eingeschätzt: ein doppelt so großer Kreis wirkt visuell viel dominanter.",
    "Die visuelle Überlagerung von Punkten bei hoher Dichte verschärft das Problem zusätzlich.",
    "Daher eignet sich diese Darstellung nur für überschaubare Datensätze und erfordert gezielte Gestaltung, um Missverständnisse zu vermeiden."
  ],
  "explanationJa": [
    "3つの属性を同時に視覚化する方法としてよく使われるのが、x軸・y軸の位置に2つの属性を割り当て、3つ目の属性を色やサイズで表現する方法です。",
    "たとえば、x＝年齢、y＝収入、色＝性別、サイズ＝消費額などのように使い分けます。",
    "この手法は直感的ではありますが、いくつかの限界があります。",
    "まず、色には順序性がなく、「赤が青より大きい」といった明確な意味づけが難しいため、数量を正確に伝えるには不向きです。",
    "また、円のサイズなどの面積による表現は、人間の視覚が非線形的に捉えるため、正しい比較が困難になります。",
    "データ点が多い場合は重なりが発生し、視認性が大きく低下するため、この方法は比較的少量のデータに適しています。",
    "より精密な比較や大量データの可視化には、別の手法との併用が望まれます。"
  ],
  "originalSlideText": "Tri-Variate Daten (2D)\n▶ Kombination aus Position, Farbe und/oder Größe\n▶ x- und y-Position: zwei Attribute\n▶ Farbe oder Größe: drittes Attribut\n▶ Nachteile:\n– Farbe nicht ordinal\n– Größe schwer vergleichbar\n– Überlagerung bei hoher Punktdichte\nAbbildung: Beispielbild",
  "explanationImage": "lecture02/lecture05_ex25.png",
  "questionImage": ""
}





















































  
  
  
  
  
]