[
  {
    "id": 1,
    "questionDe": "(s3) Was ist Semiotik und welche Rolle spielt sie in der Informationsvisualisierung?",
    "questionJa": "Semiotikとは何か？また、情報の視覚化においてどのような役割を果たすのか？",
    "answerDe": [
      "Untersuchung von Zeichen und deren Informationsvermittlung",
      "Visualisierung als Sprache",
      "Kommunikation über komplexe Zeichensysteme"
    ],
    "answerJa": [
      "記号（Zeichen）とそれがどのように情報を伝えるかを研究する学問",
      "視覚化（Visualisierung）を一種の言語とみなす",
      "複雑な記号体系を通じた内容の伝達"
    ],
    "explanationDe": [
      "Die Semiotik untersucht, wie Zeichen (z. B. Symbole, Bilder, Farben) Informationen transportieren und interpretiert werden können.",
      "In der Informationsvisualisierung betrachtet man Visualisierungen als eine Form der Sprache, mit der man Inhalte vermittelt – ähnlich wie mit gesprochenen oder geschriebenen Worten.",
      "Ein einfaches Beispiel: Ein rotes Dreieck mit Spitze nach oben könnte in einem Verkehrszeichen Gefahr symbolisieren. Ohne Worte wird hier also eine klare Botschaft vermittelt.",
      "Komplexe Zeichensysteme – wie Diagramme, Karten oder Visualisierungen – bestehen oft aus mehreren solchen Symbolen, deren Zusammenspiel wichtig für das Verständnis ist."
    ],
    "explanationJa": [
      "Semiotikとは、記号（たとえばシンボル、図、色など）がどのように情報を運び、どのように解釈されるかを研究する学問分野です。",
      "情報の視覚化（Informationsvisualisierung）では、視覚的な表現を言語のようなものとみなして、情報の伝達手段として利用します。",
      "たとえば、赤い三角形の頂点が上を向いている記号は、交通標識では「危険」を示します。これは言葉を使わなくても、見るだけで意味が伝わる例です。",
      "実際の可視化では、複数の記号（図形や色など）が組み合わされて使われるため、それらの関係性や構造を理解することが非常に重要です。"
    ],
    "originalSlideText": "Semiotik\n▶ Semiotik befasst sich mit der Untersuchung von Zeichen und wie diese Informationen vermitteln\n▶ Klassisches Buch: J. Bertin, The Semiology of Graphics\n▶ Visualisierung als Sprache\n▶ Kommunikation von Inhalten über komplexe Zeichensysteme\n▶ Zwei Arten graphischer Symbole, die unterschiedlich zu betrachten sind\n▶ Sensorische Symbole\n▶ Abstrakte Symbole",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 2,
    "questionDe": "(s3) Welche Arten von graphischen Symbolen unterscheidet die Semiotik?",
    "questionJa": "Semiotikではどのような種類の図的記号が区別されているか？",
    "answerDe": [
      "Sensorische Symbole (sensorische Symbole)",
      "Abstrakte Symbole (abstrakte Symbole)"
    ],
    "answerJa": [
      "感覚的シンボル（Sensorische Symbole）",
      "抽象的シンボル（Abstrakte Symbole）"
    ],
    "explanationDe": [
      "Die Semiotik unterscheidet zwei grundlegende Arten von Symbolen, die in der Informationsvisualisierung verwendet werden: sensorische Symbole und abstrakte Symbole.",
      "Sensorische Symbole basieren auf natürlichen Wahrnehmungsprozessen und können ohne vorheriges Lernen verstanden werden – zum Beispiel Rot als Warnfarbe.",
      "Abstrakte Symbole hingegen müssen kulturell oder schulisch gelernt werden – wie zum Beispiel Zahlen, mathematische Zeichen oder Diagrammformen.",
      "Ein Kreis mit rotem Rand ist ein sensorisches Symbol (z. B. ein Verbot), während ein Tortendiagramm ein abstraktes Symbol ist, dessen Bedeutung erst gelernt werden muss."
    ],
    "explanationJa": [
      "Semiotikでは、情報の視覚化に使われる記号を大きく2種類に分類します：感覚的シンボル（Sensorische Symbole）と抽象的シンボル（Abstrakte Symbole）です。",
      "感覚的シンボルは、人間の自然な知覚に基づいていて、特別な学習なしでも理解できます。たとえば、赤は警告の色として直感的に認識されやすいです。",
      "一方、抽象的シンボルは文化的・教育的に学ばないと理解できない記号です。例としては、数字や数学記号、グラフの形式などがあります。",
      "たとえば、赤い縁の丸（通行禁止など）は感覚的シンボルですが、円グラフは見方を学ばなければ意味がわかりません。"
    ],
    "originalSlideText": "▶ Zwei Arten graphischer Symbole, die unterschiedlich zu betrachten sind\n▶ Sensorische Symbole\n▶ Abstrakte Symbole",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 3,
    "questionDe": "(s4) Was sind sensorische Symbole und welche Eigenschaften haben sie?",
    "questionJa": "感覚的シンボル（Sensorische Symbole）とは何か？その特徴は？",
    "answerDe": [
      "Basieren auf biologisch vorgegebenen Wahrnehmungsprozessen",
      "Verständlich ohne Übung",
      "Leisten selbst dem Verstand Widerstand",
      "Unmittelbar erkennbar",
      "Haben in allen Kulturen Gültigkeit"
    ],
    "answerJa": [
      "生物学的に決まっている知覚プロセスに基づいている",
      "学習なしでも理解できる",
      "意識で制御できない場合がある",
      "直感的にすぐ認識できる",
      "すべての文化で通用する"
    ],
    "explanationDe": [
      "Sensorische Symbole beruhen auf universellen biologischen Wahrnehmungsmechanismen. Das bedeutet, dass sie von allen Menschen unabhängig von ihrer Kultur auf ähnliche Weise wahrgenommen werden.",
      "Man muss sie nicht üben oder lernen, um sie zu verstehen. Zum Beispiel wirkt eine grelle Farbe wie Rot automatisch als Warnsignal.",
      "Diese Symbole können sogar dem bewussten Denken 'Widerstand' leisten – also man erkennt sie, noch bevor man rational darüber nachdenkt.",
      "Ein Beispiel: Helle, blinkende Lichter ziehen sofort Aufmerksamkeit auf sich – das funktioniert bei Kindern genauso wie bei Erwachsenen überall auf der Welt.",
      "Daher sind sensorische Symbole besonders effektiv in der Informationsvisualisierung, wenn es um schnelle und intuitive Erkennung geht."
    ],
    "explanationJa": [
      "感覚的シンボル（Sensorische Symbole）は、人間に共通する生物学的な知覚のしくみに基づいており、文化に関係なく似たように認識されます。",
      "学習や訓練をしなくても理解できるのが特徴です。例えば、赤色は本能的に「危険」や「注意」を示すと感じることが多いです。",
      "また、これらのシンボルは意識していなくても脳が自動的に反応するため、理解するのに時間がかかりません。",
      "例：まぶしい点滅ライトは、誰が見てもすぐに目を引きます。これは世界中で共通の反応です。",
      "そのため、感覚的シンボルは素早く直感的に情報を伝えたいときに特に有効です。"
    ],
    "originalSlideText": "▶ Sensorische Symbole\n▶ basieren auf biologisch vorgegebenen Wahrnehmungsprozessen\n▶ sind ohne Übung zu verstehen\n▶ leisten selbst dem eigenen Verstand Widerstand\n▶ sind unmittelbar erkennbar\n▶ haben in allen Kulturen Gültigkeit",
    "explanationImage": "lecture02/lecture04_ex01.png",
    "questionImage": ""
  },
  {
    "id": 4,
    "questionDe": "(s7) Was sind abstrakte Symbole und welche Eigenschaften haben sie?",
    "questionJa": "抽象的シンボル（Abstrakte Symbole）とは何か？その特徴は？",
    "answerDe": [
      "Schwer zu erlernen",
      "Einfach zu vergessen",
      "Kulturabhängig",
      "Mächtige und flexible Werkzeuge (z. B. Mathematik)",
      "Schnell entwickelbar",
      "Standards sind sehr wichtig"
    ],
    "answerJa": [
      "習得が難しい",
      "忘れやすい",
      "文化に依存する",
      "強力で柔軟なツール（例：数学）",
      "短期間で新しいシンボルが生まれる",
      "標準化が非常に重要"
    ],
    "explanationDe": [
      "Abstrakte Symbole müssen gelernt werden, da sie nicht auf biologischen Wahrnehmungsmechanismen basieren. Sie sind meist kulturabhängig – was in einer Kultur verständlich ist, kann in einer anderen etwas völlig anderes bedeuten.",
      "Beispiel: Die Farbe Weiß steht in vielen westlichen Kulturen für Reinheit, in asiatischen Kulturen jedoch für Tod.",
      "Weil sie erlernt werden müssen, sind sie auch leicht zu vergessen, wenn man sie nicht regelmäßig verwendet. Zahlen, mathematische Formeln oder Verkehrsschilder sind typische Beispiele für abstrakte Symbole.",
      "Diese Symbole sind jedoch sehr mächtig und flexibel: Man kann mit ihnen komplexe Inhalte ausdrücken, z. B. durch mathematische Gleichungen.",
      "Neue abstrakte Symbole können sich schnell verbreiten – etwa durch digitale Technologien – was ihre schnelle Entwicklung fördert. Deshalb ist es wichtig, klare Standards für deren Verwendung zu haben."
    ],
    "explanationJa": [
      "抽象的シンボル（Abstrakte Symbole）は、生物学的な知覚に基づかないため、理解するには学習が必要です。また、文化ごとに意味が異なる場合が多いです。",
      "例として、白色は西洋文化では純粋さを意味しますが、アジアやアフリカでは死を意味することがあります。",
      "このような記号は、十分に学んでおかないと忘れやすく、継続的に使わないと理解が薄れてしまう特徴があります。数字や数学記号、交通標識などが例です。",
      "一方で、抽象的シンボルは非常に強力で柔軟なツールです。たとえば、数式で複雑な関係を正確に表現できます。",
      "また、テクノロジーの発展により、新しい抽象的記号は短期間で世界中に広まることがあります。そのため、使う際には明確な標準化（スタンダード）が不可欠です。"
    ],
    "originalSlideText": "▶ Abstrakte Symbole\n▶ schwer zu erlernen\n▶ einfach zu vergessen\n▶ sofern sie nicht hinreichend tief gelernt sind, wie etwa Zahlen\n▶ kulturabhängig\n▶ weiß steht in Asien und Afrika für Tod\n▶ mächtige, flexible Werkzeuge\n▶ z. B. Mathematik\n▶ schnell entwickelbar\n▶ neue Symbole können sich in wenigen Jahrzehnten weltweit durchsetzen\n▶ Standards sind sehr wichtig",
    "explanationImage": "lecture02/lecture04_ex02.png",
    "questionImage": ""
  },
  {
    "id": 5,
    "questionDe": "(s10) Warum ist die Frage nach der Art der Symbole in der Visualisierung zentral?",
    "questionJa": "視覚化において、使われる記号の種類を問うことがなぜ重要なのか？",
    "answerDe": [
      "Wenn beliebige abstrakte Symbole verwendet werden, sind alle Visualisierungen gleichwertig",
      "Dann kommt es nur auf das Erlernen der Symbole an",
      "Wenn nicht, stellt sich die Frage nach der Ähnlichkeit zwischen Symbol und Objekt"
    ],
    "answerJa": [
      "もし任意の抽象的シンボルを使えるなら、どんな視覚化も本質的には同じになる",
      "その場合、記号の学習だけが重要になる",
      "そうでなければ、記号と対象物との類似性をどう評価するかが問題になる"
    ],
    "explanationDe": [
      "In der Visualisierung ist entscheidend, ob die Symbole, die verwendet werden, beliebig gewählt sind oder nicht.",
      "Wenn man davon ausgeht, dass jedes abstrakte Symbol verwendet werden kann, dann wird die Qualität einer Visualisierung nur davon bestimmt, wie gut der Nutzer die Symbole gelernt hat.",
      "Das bedeutet: Ob ein Dreieck, eine Zahl oder ein Emoji – alles wäre gleichwertig, solange es verstanden wird.",
      "Wenn aber die Wahl der Symbole nicht beliebig ist, dann muss man untersuchen, wie ähnlich ein Symbol dem eigentlichen Objekt ist, das es repräsentiert.",
      "Zum Beispiel: Ein Symbol für ein Haus, das wie ein echtes Haus aussieht, ist intuitiver als ein abstraktes Zeichen wie ein Rechteck mit einem Dreieck oben."
    ],
    "explanationJa": [
      "視覚化において重要なのは、使われる記号が自由に選ばれているか、それとも制約があるかという点です。",
      "もし抽象的な記号を自由に選んでもよいなら、視覚化の質は「それらの記号をどれだけ学習しているか」で決まります。",
      "たとえば、三角形、数字、絵文字など、どれを使っても意味が理解できるなら、どれも等価な視覚化手段になります。",
      "しかし、そうでないなら、記号が表す対象との「類似性」が評価の軸になります。",
      "例として、家のマークを家のような形にすれば直感的に理解しやすく、単なる抽象的な記号よりも効果的になります。"
    ],
    "originalSlideText": "Zentrale Frage: Verwendet die Visualisierung beliebige abstrakte Symbole?\n▶ Wenn ja\n▶ dann sind letztlich alle Visualisierungen gleichwertig\n▶ sofern die benutzten Bilder/Symbole hinreichend gut gelernt sind\n▶ Wenn nein:\n▶ bleibt Frage nach einem Maß für die Ähnlichkeit von Symbol und Objekt",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 6,
    "questionDe": "(s11) Welche Annahmen gibt es zur Wahl der Symbole in der Visualisierung?",
    "questionJa": "視覚化における記号の選択にはどのような前提があるか？",
    "answerDe": [
      "Wahl der Symbole ist nicht beliebig",
      "Gründe: Biologisch vorgegebene Wahrnehmungsstrukturen im Gehirn",
      "Gesellschaftliche Konventionen"
    ],
    "answerJa": [
      "記号の選択は自由ではない",
      "根拠：脳に生得的に備わった知覚の仕組み",
      "社会的な慣習や文化的背景"
    ],
    "explanationDe": [
      "In der Informationsvisualisierung geht man davon aus, dass die Wahl der Symbole nicht rein willkürlich erfolgt.",
      "Es gibt zwei Hauptgründe für diese Annahme: Erstens, bestimmte Wahrnehmungsprozesse sind biologisch im menschlichen Gehirn verankert. Das bedeutet, dass alle Menschen z. B. Kanten oder Kontraste ähnlich verarbeiten.",
      "Zweitens spielen gesellschaftliche Konventionen eine Rolle: Ein bestimmtes Symbol (z. B. ein Pfeil für Bewegung oder Richtung) wird kulturell gelernt und wiedererkannt.",
      "Beispiel: Eine visuelle Kante in einem Foto und eine gezeichnete Linie in einer Skizze aktivieren ähnliche visuelle Verarbeitungsprozesse im Gehirn. Daher wird angenommen, dass manche Symbole intuitiver verstanden werden als andere."
    ],
    "explanationJa": [
      "情報の視覚化では、使う記号は単に自由に選ばれるわけではないと考えられています。",
      "その前提には2つの主要な理由があります。1つ目は、人間の脳には生まれつき備わった知覚処理の仕組みがあることです。たとえば、輪郭やコントラストなどは誰もが似たように知覚します。",
      "2つ目は、社会的な慣習や文化的ルールです。たとえば、矢印は動きや方向を示す記号として、多くの人に学習され受け入れられています。",
      "例として、写真に写る輪郭と図に描かれた線は、脳内で同じような処理が行われるとされます。このように、ある種の記号は他よりも直感的に理解されやすいと考えられています。"
    ],
    "originalSlideText": "Zentrale Frage: Verwendet die Visualisierung beliebige abstrakte Symbole?\n▶ Annahme in der Visualisierung (implizit oder explizit)\n▶ Wahl der Symbole nicht beliebig\n▶ Vermutete Gründe\n▶ Biologisch vorgegebene Wahrnehmungsstrukturen im Gehirn\n▶ Gesellschaftliche Konventionen\n▶ Vermutung: Bei Kantenextraktion bei einem Bild und bei einem Objekt in der realen Umgebung werden gleiche Mechanismen im Gehirn aktiviert\n▶ Aber: Bei abstrakten Bildern und Diagrammen große Unterschiede zwischen Bild und Objekt (gerade in der Visualisierung wichtig)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 7,
    "questionDe": "(s11) Welche Mechanismen im Gehirn spielen bei der Wahrnehmung von Symbolen eine Rolle?",
    "questionJa": "記号を知覚する際、脳内ではどのようなメカニズムが働くのか？",
    "answerDe": [
      "Bei Kantenextraktion in Bildern und realen Objekten werden ähnliche Gehirnmechanismen aktiviert",
      "Bei abstrakten Bildern und Diagrammen große Unterschiede zwischen Bild und Objekt"
    ],
    "answerJa": [
      "画像や実物の輪郭（Kanten）の抽出時に、脳内で似たような処理メカニズムが働く",
      "抽象的な画像や図では、シンボルと対象物の間に大きな違いがある"
    ],
    "explanationDe": [
      "Die menschliche Wahrnehmung erkennt in der Umgebung oft Kanten und Formen, um Objekte zu identifizieren. Diese Kantenextraktion findet auch bei Bildern statt – das Gehirn verwendet also ähnliche Prozesse für reale Objekte und visuelle Repräsentationen.",
      "Zum Beispiel wird eine gezeichnete Linie auf einem Bild ähnlich wie die Kante eines echten Gegenstandes erkannt.",
      "Allerdings gilt das nicht gleichermaßen für abstrakte Visualisierungen wie Diagramme: Hier besteht oft eine große symbolische Distanz zwischen dem Bild (dem Symbol) und dem tatsächlichen Objekt.",
      "Das bedeutet: Während unser Gehirn bei realitätsnahen Darstellungen auf natürliche Wahrnehmung zurückgreifen kann, braucht es bei abstrakten Darstellungen mehr Interpretation und Vorwissen."
    ],
    "explanationJa": [
      "人間の脳は、物体を認識する際に輪郭や形状（Kanten）を見つけ出す処理を行っています。この処理は、現実の物体を見るときと、画像を見たときの両方で似たように働きます。",
      "たとえば、手描きの線は実際の物体の輪郭と同じように脳に認識されることがあります。",
      "しかし、抽象的な図やチャートのような表現では、シンボルとそれが表す対象との間に大きなギャップがあるため、直感的には理解しにくくなります。",
      "つまり、現実に近い図の場合は自然な知覚メカニズムが使えますが、抽象的な視覚表現にはより多くの知識と解釈が必要になります。"
    ],
    "originalSlideText": "▶ Vermutung:\nBei Kantenextraktion bei einem Bild und bei einem Objekt in der realen Umgebung werden gleiche Mechanismen im Gehirn aktiviert\n▶ Aber:\nBei abstrakten Bildern und Diagrammen große Unterschiede zwischen Bild und Objekt (gerade in der Visualisierung wichtig)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 8,
    "questionDe": "(s12) Warum werden sensorische und abstrakte Symbole häufig gemeinsam verwendet?",
    "questionJa": "なぜ感覚的シンボル（Sensorische Symbole）と抽象的シンボル（Abstrakte Symbole）はよく一緒に使われるのか？",
    "answerDe": [
      "Weil abstrakte und sensorische Symbole unterschiedliche Stärken haben",
      "Kombination ermöglicht effektivere Informationsvermittlung"
    ],
    "answerJa": [
      "抽象的シンボルと感覚的シンボルにはそれぞれ異なる強みがあるため",
      "両者を組み合わせることで、より効果的に情報を伝えられる"
    ],
    "explanationDe": [
      "Sensorische Symbole sind intuitiv und schnell erkennbar, aber oft begrenzt in ihrer Ausdruckskraft.",
      "Abstrakte Symbole hingegen sind sehr präzise und flexibel, brauchen aber Vorkenntnisse oder kulturelles Wissen, um verstanden zu werden.",
      "Durch die Kombination beider Symbolarten lassen sich Informationen sowohl schnell als auch exakt kommunizieren.",
      "Ein Beispiel: In einer Wetterkarte zeigt ein einfaches Sonnenbild intuitiv gutes Wetter (sensorisches Symbol), während eine Zahl daneben die exakte Temperatur angibt (abstraktes Symbol)."
    ],
    "explanationJa": [
      "感覚的シンボルは直感的にすばやく理解できますが、表現できる情報の範囲が限られています。",
      "一方、抽象的シンボルは非常に柔軟で正確な情報を伝えられますが、それを理解するには知識や文化的背景が必要です。",
      "このため、両者を組み合わせることで、情報を素早くかつ正確に伝えることができます。",
      "例：天気図では、太陽のアイコンで晴れを直感的に示し（感覚的シンボル）、その横に気温の数値を表示することで正確な情報も伝えています（抽象的シンボル）。"
    ],
    "originalSlideText": "▶ Bemerkung:\nHäufig werden abstrakte und sensorische Symbole gleichzeitig verwendet",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 9,
    "questionDe": "(s14) Welche Ziele verfolgt die Untersuchung der optischen Wahrnehmung in der Informationsvisualisierung?",
    "questionJa": "情報の視覚化において「視覚的知覚（optische Wahrnehmung）」を調べる目的は何か？",
    "answerDe": [
      "Besseres Verständnis der Wahrnehmung",
      "Besseres Verständnis der visuellen Informationsverarbeitung",
      "Nutzung von Theorien und Modellen aus Physiologie und kognitiver Psychologie"
    ],
    "answerJa": [
      "知覚（Wahrnehmung）をより深く理解するため",
      "視覚的情報処理（visuelle Informationsverarbeitung）をよりよく理解するため",
      "生理学（Physiologie）と認知心理学（kognitive Psychologie）の理論やモデルを活用するため"
    ],
    "explanationDe": [
      "Das Ziel der Untersuchung der optischen Wahrnehmung in der Informationsvisualisierung besteht darin, zu verstehen, wie Menschen visuelle Informationen aufnehmen und verarbeiten.",
      "Dabei wird die Wahrnehmung sowohl aus physiologischer Sicht (also wie das Auge und das Gehirn funktionieren) als auch aus psychologischer Sicht (wie Aufmerksamkeit und Interpretation ablaufen) betrachtet.",
      "Diese Erkenntnisse helfen dabei, Visualisierungen so zu gestalten, dass sie schneller, klarer und effizienter verstanden werden.",
      "Beispiel: Wenn man weiß, dass Menschen Farben schneller unterscheiden als Formen, kann man wichtige Informationen farblich hervorheben."
    ],
    "explanationJa": [
      "情報の視覚化では、人間が視覚的な情報をどのように受け取り、処理するのかを理解することが目的です。",
      "この理解は、生理学的視点（目や脳の働き）と、心理学的視点（注意や意味の理解の仕方）の両方からアプローチされます。",
      "こうした知見を活かすことで、より素早く、明確に、効率的に理解される視覚表現をデザインできるようになります。",
      "例えば、人は形よりも色の違いに早く気づくとわかっていれば、重要な情報を色で強調することで認識を助けることができます。"
    ],
    "originalSlideText": "Optische Wahrnehmung\n▶ Ziel:\n▶ Wahrnehmung\n▶ visuelle Informationsverarbeitung besser zu verstehen\n▶ Es gibt mehrere Theorien und Modelle aus der\n▶ Physiologie\n▶ Kognitiven Psychologie",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 10,
    "questionDe": "(s14) Wie ist der zweistufige Wahrnehmungsprozess aufgebaut?",
    "questionJa": "二段階の知覚プロセスはどのように構成されているか？",
    "answerDe": [
      "1. Paralleler Prozess: Extraktion elementarer Eigenschaften (z. B. Farbe, Form, Textur, räumliche Attribute)",
      "2. Sequentieller, zielgerichteter Prozess: Objektidentifikation mit visueller Aufmerksamkeit"
    ],
    "answerJa": [
      "1. 並列的プロセス：色、形、テクスチャ、空間属性などの基本的特徴を抽出",
      "2. 逐次的・目的指向プロセス：視覚的注意を必要とする対象認識"
    ],
    "explanationDe": [
      "Der Wahrnehmungsprozess besteht aus zwei Stufen. In der ersten Stufe werden grundlegende visuelle Merkmale einer Szene schnell und parallel verarbeitet. Dazu gehören z. B. Farben, Formen oder Texturen.",
      "Diese erste Stufe läuft automatisch ab, ohne dass wir uns bewusst darauf konzentrieren müssen.",
      "In der zweiten Stufe wird unsere Aufmerksamkeit gezielt auf bestimmte Objekte gerichtet. Hier geht es darum, Dinge bewusst zu erkennen und zu identifizieren.",
      "Beispiel: Wenn man eine rote Kugel zwischen vielen grauen Kugeln sofort bemerkt, passiert das in der ersten Stufe. Das Erkennen, dass es sich bei der roten Kugel um eine Spielzeugkugel handelt, erfolgt in der zweiten Stufe."
    ],
    "explanationJa": [
      "知覚のプロセスは2つの段階に分かれています。第1段階では、視覚的なシーンの中から色や形、質感（テクスチャ）、空間的特徴などの基本的な情報が高速かつ並列に処理されます。",
      "この段階は無意識に進行し、注意を向ける必要はありません。",
      "第2段階では、特定の対象物に意識的な注意が向けられ、物体を識別し理解する段階になります。",
      "例：たくさんの灰色のボールの中に1つだけ赤いボールがあると、それをすぐに見つけられるのは第1段階の処理です。そして、それが『おもちゃのボール』であると判断するのが第2段階の処理です。"
    ],
    "originalSlideText": "Zweistufiger Wahrnehmungsprozess\n\n1. Paralleler Prozess\n▶ extrahiert elementare Eigenschaften der Szene\n▶ Farbe\n▶ Form\n▶ Textur\n▶ Räumliche Attribute\n\n2. Sequentiell zielgerichtete Objektidentifikation; erfordert\n▶ visuelle Aufmerksamkeit\n▶ aktive Rolle",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 11,
    "questionDe": "(s15) Was kennzeichnet die erste Stufe (Low-Level) der Wahrnehmung?",
    "questionJa": "第1段階（Low-Level）の知覚にはどのような特徴があるか？",
    "answerDe": [
      "Unbewusster, schneller, paralleler Prozess",
      "Fokusunabhängig",
      "Suche nach elementaren Merkmalen: Kanten, Orientierung, Farbe, Textur, Bewegung",
      "Informationen werden transitorisch im ikonischen Speicher gehalten",
      "Bottom-up Verarbeitung (datengetrieben)",
      "Oft als prä-attentive Verarbeitung bezeichnet"
    ],
    "answerJa": [
      "無意識的で高速かつ並列な処理",
      "注意の焦点に依存しない",
      "基本的特徴の検出（輪郭、方向、色、テクスチャ、動きなど）",
      "情報は一時的にアイコニックメモリ（視覚的短期記憶）に保持される",
      "ボトムアップ処理（データ駆動型）",
      "しばしば前注意的処理（prä-attentive Verarbeitung）と呼ばれる"
    ],
    "explanationDe": [
      "Die erste Stufe der Wahrnehmung wird als Low-Level-Verarbeitung bezeichnet. Sie erfolgt schnell, automatisch und unbewusst, ohne dass eine gezielte Aufmerksamkeit notwendig ist.",
      "Das visuelle System analysiert hier elementare Merkmale wie Kanten (z. B. Übergänge zwischen Farben), Orientierung (z. B. Neigungswinkel von Linien), Farbe, Textur und Bewegung.",
      "Diese Informationen werden für sehr kurze Zeit im ikonischen Speicher zwischengespeichert – vergleichbar mit einem visuellen Zwischenspeicher.",
      "Die Verarbeitung ist datengetrieben (Bottom-up), das heißt: sie beginnt bei den sensorischen Reizen und arbeitet sich dann nach oben.",
      "Beispiel: Wenn man in einem großen Muster sofort rote Punkte erkennt, obwohl man nicht gezielt danach gesucht hat – das ist prä-attentive Wahrnehmung auf Low-Level-Niveau."
    ],
    "explanationJa": [
      "第1段階の知覚は「Low-Level（低次レベル）処理」と呼ばれ、非常に高速かつ自動的、無意識に行われます。つまり、意識的に注意を向けなくても進行する処理です。",
      "この段階では、輪郭（たとえば色の境界）、方向（線の傾き）、色、テクスチャ（模様やざらつき）、動きなどの基本的特徴が検出されます。",
      "検出された情報は、アイコニックメモリ（視覚的短期記憶）にごく短時間だけ保持されます。これは一種の視覚的な「仮メモリ」です。",
      "この処理はボトムアップ型、つまり感覚情報（データ）からスタートして情報処理が進みます。",
      "例として、大きな模様の中から赤い点だけが自然と目に入ってくるのは、このLow-Level処理の結果であり、これが「前注意的処理（prä-attentive Verarbeitung）」です。"
    ],
    "originalSlideText": "Stufe 1 - Low Level\n▶ Unbewusster Vorgang\n▶ Schnell\n▶ Parallel (Felder von Neuronen)\n▶ Fokusunabhängig\n▶ Suche nach elementaren Merkmalen\n▶ Kanten\n▶ Orientierungen\n▶ Einheitliche Farbe\n▶ Textur\n▶ Bewegungsmuster\n▶ Informationen werden transitorisch (vorübergehend) im ikonischen Speicher gehalten\n▶ Verarbeitung\n▶ Bottom-up\n▶ Daten-gesteuertes Modell\n▶ Oft prä-attentive Verarbeitung genannt",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 12,
    "questionDe": "(s18) Welche Merkmale werden prä-attentiv wahrgenommen? Welche nicht?",
    "questionJa": "どのような特徴が前注意的（prä-attentiv）に知覚されるか？逆に知覚されないのは？",
    "answerDe": [
      "Prä-attentiv wahrnehmbar:",
      "– Orientierung (z. B. gekrümmt – gerade)",
      "– Form",
      "– Größe",
      "– Anzahl",
      "– Grauwert",
      "– Umschlossenheit",
      "– Konvex – Konkav",
      "– Hinzufügung",
      "– Farbe (Farbton, Intensität)",
      "– Bewegung (Flackern, Richtung)",
      "Nicht prä-attentiv:",
      "– Verbindung",
      "– Parallelität"
    ],
    "answerJa": [
      "前注意的に知覚できる特徴：",
      "– 向き（例：曲がっている／まっすぐ）",
      "– 形状",
      "– 大きさ",
      "– 数量",
      "– 明度（グレースケール）",
      "– 囲まれているかどうか",
      "– 凸か凹か",
      "– 要素の追加",
      "– 色（色相や強さ）",
      "– 動き（点滅、方向）",
      "前注意的に知覚できない特徴：",
      "– 接続されているかどうか",
      "– 平行性"
    ],
    "explanationDe": [
      "Prä-attentive Wahrnehmung beschreibt Merkmale, die unser visuelles System automatisch und sehr schnell erkennt – ohne bewusste Aufmerksamkeit.",
      "Dazu gehören visuelle Eigenschaften wie Farben, Formen, Größenunterschiede, Orientierung von Linien oder einfache Bewegungsmuster.",
      "Beispiel: Ein einziger großer Kreis unter vielen kleinen wird sofort erkannt, ohne dass man danach suchen muss.",
      "Andererseits gibt es Merkmale, die nicht prä-attentiv erkannt werden können – wie z. B. ob Linien verbunden oder parallel sind. Diese erfordern bewusste Aufmerksamkeit.",
      "Das Wissen über prä-attentive Merkmale ist wichtig für effektives Visualisierungsdesign: Man sollte gezielt Merkmale wählen, die schnell ins Auge fallen."
    ],
    "explanationJa": [
      "前注意的知覚とは、人が意識的な注意を向けることなく、ごく短時間で自動的に視覚的特徴を認識する能力のことです。",
      "この処理で認識される特徴には、色、形、大きさ、線の向き、単純な動きなどが含まれます。",
      "例えば、多くの小さな円の中に1つだけ大きな円があれば、それにすぐ気づくのは前注意的知覚の結果です。",
      "一方で、線がつながっているかどうかや、平行であるかどうかといった特徴は、前注意的には認識されず、意識的な注意を必要とします。",
      "このような知識は、視覚化デザインにおいて非常に重要です。素早く目に入る特徴を意図的に選ぶことで、効果的に情報を伝えることができます。"
    ],
    "originalSlideText": "Prä-attentive Wahrnehmung\n▶ Orientierung\n▶ Gekrümmt - Gerade\n▶ Form\n▶ Größe\n▶ Anzahl (von Elementen einer Gruppe)\n▶ Grauwert\n▶ Umschlossenheit\n▶ Konvex – Konkav\n▶ Hinzufügung\n▶ Farbe: Farbton, Intensität\n▶ Bewegung: Flackern, Bewegungsrichtung\n\nKeine prä-attentive Wahrnehmung\n▶ Verbindung ▶ Parallelität",
    "explanationImage": "lecture02/lecture04_ex03.png",
    "questionImage": ""
  },
  {
  "id": 13,
  "questionDe": "(s19) Welche Beispiele verdeutlichen prä-attentive Wahrnehmung?",
  "questionJa": "前注意的知覚（prä-attentive Wahrnehmung）の例にはどのようなものがあるか？",
  "answerDe": [
    "Schnelle Erkennung einzelner Zeichen (z. B. die Ziffer '3' in einer Zahlenmenge)",
    "Unmittelbare Farberkennung (z. B. roter Kreis unter vielen anderen Farben)",
    "Visuelle Segmentierung auf Basis einfacher Merkmale"
  ],
  "answerJa": [
    "大量の数字の中から特定の数字（例：3）を素早く見つける",
    "異なる色の中で赤い円などを直感的に見つけられる",
    "単純な視覚的特徴に基づいて図形群を即座に分割（セグメント化）できる"
  ],
  "explanationDe": [
    "Prä-attentive Wahrnehmung zeigt sich in Aufgaben, bei denen bestimmte visuelle Merkmale sehr schnell und ohne gezielte Suche erkannt werden können.",
    "Ein Beispiel ist die Zählung der Ziffer '3' in einem großen Zahlenblock – obwohl viele andere Zahlen vorhanden sind, stechen die '3' direkt hervor.",
    "Ein weiteres Beispiel ist die Erkennung eines roten Kreises in einer Menge andersfarbiger Kreise – die Farbe allein ermöglicht eine sofortige Identifikation.",
    "Auch visuelle Segmentierung – also das Gliedern eines visuellen Felds in unterschiedliche Gruppen – kann auf prä-attentiven Merkmalen beruhen.",
    "Diese Beispiele zeigen, dass visuelle Merkmale wie Farbe, Größe oder Form besonders effektiv für die schnelle Informationsaufnahme sind."
  ],
  "explanationJa": [
    "前注意的知覚は、視覚的な特徴を意識的に探さなくても素早く認識できる現象です。",
    "たとえば、大量の数字が羅列された中から「3」だけをすぐに見つけられるのは、前注意的処理によって数字の形を瞬時に捉えているからです。",
    "また、多くの色の中に1つだけ赤い円がある場合、それをすぐに認識できるのも、色という視覚的特徴が前注意的に処理されるためです。",
    "さらに、図形の集合を形や色などの単純な属性に基づいてすぐにグループに分けて認識できること（視覚的セグメント化）も前注意的処理の一例です。",
    "これらの例は、視覚化において色や形、大きさといった基本的な属性を使うことが、情報をすばやく伝える上で非常に有効であることを示しています。"
  ],
  "originalSlideText": "Beispiele prä-attentiver Verarbeitung\n▶ Wie oft ist die Ziffer ‘3’ vorhanden?\n▶ Farbe: In welchem der beiden Bilder ist ein roter Kreis (links oder rechts)?\n▶ Segmentierung ▶ Diese und weitere Beispiele sowie Selbsttest unter:\nhttp://www.csc.ncsu.edu/faculty/healey/PP/index.html",
  "explanationImage": "lecture02/lecture04_ex03.png",
  "questionImage": ""
},
{
  "id": 14,
  "questionDe": "(s24) Was kennzeichnet die zweite Stufe (High-Level) der Wahrnehmung?",
  "questionJa": "第2段階（High-Level）の知覚にはどのような特徴があるか？",
  "answerDe": [
    "Unterteilung in Objekterkennung (in Kooperation mit Sprachzentrum)",
    "Handlungsorientierte Wahrnehmung (Verbindung zum motorischen Zentrum)",
    "Langsame, serielle Verarbeitung",
    "Nutzung von Kurzzeit- und Langzeitgedächtnis",
    "Stärkere Betonung abstrakter Symbole",
    "Top-Down-Ansatz"
  ],
  "answerJa": [
    "物体認識（言語中枢との連携）と行動志向的知覚（運動中枢との連携）に分かれる",
    "処理は遅く、直列的に進行する",
    "短期記憶および長期記憶を活用する",
    "抽象的なシンボルの役割が大きくなる",
    "トップダウン型の処理方式である"
  ],
  "explanationDe": [
    "In der zweiten Stufe der visuellen Wahrnehmung findet eine bewusste, zielgerichtete Verarbeitung statt.",
    "Sie teilt sich in zwei Hauptkomponenten: Die Objekterkennung, die mit dem Sprachzentrum im Gehirn zusammenarbeitet (z. B. das Erkennen eines Symbols als 'Haus'),",
    "und die handlungsorientierte Wahrnehmung, bei der die visuelle Information für motorische Aktionen verwendet wird (z. B. Greifen eines Objekts).",
    "Diese Verarbeitung ist vergleichsweise langsam und läuft seriell ab – also Schritt für Schritt.",
    "Hierbei werden Informationen mit dem Kurzzeit- und Langzeitgedächtnis abgeglichen. Besonders wichtig sind abstrakte Symbole, deren Bedeutung gelernt sein muss.",
    "Der Top-Down-Ansatz bedeutet, dass vorhandenes Wissen und Erwartungen die Wahrnehmung beeinflussen – also nicht nur die Daten selbst, sondern auch, was wir erwarten, beeinflusst, was wir sehen."
  ],
  "explanationJa": [
    "視覚的知覚の第2段階では、意識的かつ目的指向的な処理が行われます。",
    "この段階は2つに分かれており、1つは物体認識で、言語中枢と連携して視覚的な対象に名前や意味を与える働きがあります（例：ある図形を「家」と認識する）。",
    "もう1つは行動志向的知覚で、視覚情報を使って動作に結びつける（例：物を手でつかむ）処理です。",
    "この段階の処理は第1段階に比べて遅く、直列的（1つずつ順番に）に行われます。",
    "記憶（短期・長期）の活用が重要になり、抽象的な記号（たとえば数字やグラフ記号など）の意味を理解するには学習が必要です。",
    "トップダウン処理とは、自分の知識や期待が見え方に影響を与えることを意味し、データそのものだけでなく、文脈も知覚に影響します。"
  ],
  "originalSlideText": "Stufe 2 – High Level\n▶ Unterteilung in\n▶ Objekterkennung (Kooperation mit Sprachzentrum)\n▶ Handlungsorientierte Wahrnehmung (Verbindung zum motorischen Zentrum)\n▶ Langsame, serielle Bearbeitung\n▶ Nutzung von Kurzzeit- und Langzeitgedächtnis\n▶ Stärkere Betonung abstrakter Symbole\n▶ Top-Down Ansatz",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 15,
  "questionDe": "(s25) Was bedeutet Sehschärfe und wie wird sie psychophysikalisch gemessen?",
  "questionJa": "視力（Sehschärfe）とは何か？それは心理物理的にどのように測定されるか？",
  "answerDe": [
    "Sehschärfe beschreibt die Genauigkeit des menschlichen Sehens",
    "Messung durch Winkelauflösung in psychophysikalischen Tests",
    "Beispiele:",
    "– Punkt (1′): zwei Punkte als getrennt erkennbar",
    "– Gitter (1–2′): Balkenmuster wird erkannt",
    "– Buchstaben (5′): Buchstabe wird identifiziert",
    "– Stereo (10″): räumliche Tiefe wird wahrgenommen",
    "– Vernier (10″): Ko-Linearität von Liniensegmenten wird erkannt"
  ],
  "answerJa": [
    "視力（Sehschärfe）は、人間の視覚の精度を示す指標",
    "心理物理学的テストで角度分解能によって測定される",
    "例：",
    "– 点（1分角）：2つの点を別々に認識できる",
    "– 格子（1〜2分角）：縞模様として認識できる",
    "– 文字（5分角）：文字が読める",
    "– 立体視（10秒角）：奥行きを知覚できる",
    "– ヴァーニエ精度（10秒角）：2本の線が同一直線上かどうかを判断できる"
  ],
  "explanationDe": [
    "Sehschärfe ist ein Maß dafür, wie genau das menschliche Auge Details erkennen kann. Sie wird häufig als Auflösungsvermögen in Winkelminuten (Bogenminuten) angegeben.",
    "Dabei werden in psychophysikalischen Tests verschieden kleine Reize gezeigt, um zu bestimmen, bis zu welchem Punkt der Mensch noch Unterschiede wahrnehmen kann.",
    "Ein typischer Wert ist z. B. 1′ (eine Bogenminute): Bei diesem Winkelabstand kann man zwei Punkte noch getrennt sehen.",
    "Weitere Beispiele: Ein Gittermuster wird ab etwa 1–2′ als solches erkannt, ein Buchstabe bei etwa 5′. Die Wahrnehmung von Tiefe (Stereosehen) oder präzise Ausrichtung (Vernier) erfordert noch feinere Auflösung von etwa 10″ (Bogensekunden)."
  ],
  "explanationJa": [
    "視力（Sehschärfe）とは、人間の目がどの程度細かい情報を識別できるかを示す指標であり、通常は視角（角度）で表されます。",
    "心理物理的テストでは、人がどの程度まで近い2つの物を別々に見分けられるかを、視角の最小単位（分角や秒角）で測定します。",
    "たとえば、1分角（1′）では、2つの点を別々に見分けられることが期待されます。",
    "また、1〜2分角では格子状の模様として知覚され、5分角で文字が識別可能になります。",
    "さらに繊細な知覚としては、10秒角（10″）での奥行き認識（立体視）や、線が同じ直線上にあるかどうか（ヴァーニエ判断）も含まれます。"
  ],
  "originalSlideText": "Sehschärfe\n▶ Genauigkeit des menschlichen Sehens wurde in zahlreichen psychophysikalischen Tests untersucht\n\nSchärfe Winkel Beschreibung\nPunkt 1′ Zwei benachbarte Punkte werden separat wahrgenommen\nGitter 1−2′ Ein Balkenmuster wird als solches wahrgenommen und nicht als graue Fläche\nBuchstaben 5′ Ein Buchstabe ist erkennbar\nStereo 10” Wahrnehmung von Objekten in räumlicher Tiefe\nVernier 10” Fähigkeit zu bestimmen, ob zwei Liniensegmente co-linear sind",
  "explanationImage": "lecture02/lecture04_ex04.png",
  "questionImage": ""
}



  
  
  
  
  
  
  
  
  
  
  
  
]