[
  {
    "id": 1,
    "questionDe": "(s4) Was ist der Unterschied zwischen paketvermittelten und leitungsvermittelten Netzen?",
    "questionJa": "パケット交換方式と回線交換方式の違いは何ですか？",
    "answerDe": [
      "Leitungsvermittelte Netze stellen vor der Übertragung eine feste Verbindung zwischen Sender und Empfänger her.",
      "Paketvermittelte Netze teilen Daten in kleine Pakete auf, die unabhängig voneinander geroutet werden.",
      "Leitungsvermittlung nutzt dedizierte virtuelle oder physikalische Leitungen.",
      "Paketvermittlung verwendet das Prinzip des Statistical Multiplexing.",
      "Bei leitungsvermittelten Netzen erfolgt ein expliziter Verbindungsaufbau und -abbau.",
      "Paketvermittelte Kommunikation ist asynchron und benötigt keinen Verbindungsaufbau."
    ],
    "answerJa": [
      "回線交換方式では送信者と受信者の間に事前に専用の接続が確立される。",
      "パケット交換方式ではデータが小さなパケットに分割され、それぞれが独立にルーティングされる。",
      "回線交換は物理的または仮想的な専用回線を使用する。",
      "パケット交換ではStatistical Multiplexing（統計的多重化）を用いる。",
      "回線交換では明示的な接続の確立と切断が行われる。",
      "パケット交換は非同期で、接続の確立を必要としない。"
    ],
    "explanationDe": [
      "Der zentrale Unterschied liegt in der Art und Weise, wie die Daten zwischen zwei Kommunikationsteilnehmern übertragen werden.",
      "Bei der Leitungsvermittlung wird vor Beginn der Kommunikation eine feste Verbindung aufgebaut, vergleichbar mit einem klassischen Telefonat. Diese Verbindung bleibt während der gesamten Kommunikation bestehen und garantiert eine konstante Übertragungsrate.",
      "Ein klassisches Beispiel ist die Telefonverbindung: Sobald man wählt, wird eine durchgehende Leitung bis zum Gesprächspartner geschaltet.",
      "Im Gegensatz dazu werden bei der Paketvermittlung, wie sie im Internet üblich ist, die Daten in kleine Pakete zerlegt. Jedes Paket enthält Informationen über Zieladresse und Reihenfolge und wird unabhängig über das Netzwerk weitergeleitet.",
      "Das bedeutet, dass Pakete auch über verschiedene Wege zum Ziel gelangen können. Dort setzt der Empfänger sie wieder korrekt zusammen.",
      "Ein weiterer wichtiger Aspekt ist die Ressourcennutzung: Leitungsvermittlung reserviert Ressourcen exklusiv für eine Verbindung, während Paketvermittlung diese dynamisch zwischen vielen Verbindungen teilt.",
      "Dadurch ist Paketvermittlung effizienter bei hoher Last, aber anfälliger für Verzögerungen und Schwankungen in der Übertragungsqualität (Jitter)."
    ],
    "explanationJa": [
      "この2つの方式の大きな違いは、データの転送方法にあります。",
      "回線交換方式では、通信を始める前に送信者と受信者の間に専用の回線（物理的または仮想的）が確立され、その回線が通信中は占有され続けます。これは固定電話の通話のような仕組みで、通信中は他の通信がその回線を使えません。",
      "例えば、昔のアナログ電話では、通話中は必ず固定された回線が2者間をつないでいました。",
      "一方、パケット交換方式では、データを小さな単位（パケット）に分割し、それぞれのパケットが宛先情報を持ってネットワーク上を独立して移動します。",
      "パケットは必ずしも同じ経路を通るわけではなく、目的地で再構築されます。",
      "回線交換方式では通信の前後に接続の確立と切断が必要ですが、パケット交換方式ではこれが不要で、非同期に通信を開始できます。",
      "リソースの使い方にも違いがあり、回線交換は専用回線を予約するのに対し、パケット交換は回線を共有し、必要に応じて柔軟に帯域を使用できるため、特にインターネットのような不特定多数が同時に使う環境に適しています。"
    ],
    "originalSlideText": "Paketvermittelte Netze\n❑ Basis des Internets: Daten werden in kleine Pakete aufgeteilt; Pakete werden im Netzwerk geroutet\n❑ Im Gegensatz zur Leitungsvermittlung konkurrieren die Datenflüsse miteinander um den physikalischen Kanal → Statistical Multiplexing\n\nLeitungsvermittelte Netze (1)\n❑ Erste Telekommunikationsverbindungen wurden als physikalische Leitungen aufgebaut → „Verbindung“ durch Umstecken von Kabeln in der Vermittlungsstelle\n❑ Heute: Virtuelle Leitungen\n Mehrere Leitungen über einen physikalischen Kanal multiplexed\n Geteiltes Medium → Resource Sharing\n\nLeitungsvermittelte Netze (2)\n❑ Eigenschaften der Leitungsvermittlung (Circuit Switching):\n Point-to-Point Kommunikation\n Verbindungsaufbau und Verbindungsabbau\n• Virtuelle Leitungen sind temporär\n Kein Performanceunterschied zu physikalischen Leitungen\n• Isolation verschiedener Virtueller Leitungen voneinander\n\nPaketvermittelte Netze (2)\n❑ Eigenschaften Packet Switching:\n Beliebige, asynchrone Kommunikation\n• Kommunikation mit beliebig vielen Kommunikationspartner ohne Zeitbeschränkungen\n Kein Verbindungsaufbau\n• Ad-hoc Paket-Weiterleitung zu jedem belieben Ziel \n Schwankende Performance durch Statistical Multiplexing",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 2,
    "questionDe": "(s5) Wie funktionierte ursprünglich die Leitungsvermittlung und wie funktioniert sie heute?",
    "questionJa": "回線交換方式はもともとどのように機能していて、現在はどのように機能しているのですか？",
    "answerDe": [
      "Ursprünglich wurde die Verbindung durch physikalische Kabel hergestellt, die manuell in der Vermittlungsstelle umgesteckt wurden.",
      "Heute erfolgt die Leitungsvermittlung virtuell über Multiplexing mehrerer Leitungen auf einem physikalischen Kanal.",
      "Dabei wird ein geteiltes Medium genutzt, das Ressourcen gemeinsam verwendet."
    ],
    "answerJa": [
      "当初は、通信接続は物理的なケーブルを手動で交換機で差し替えることで確立された。",
      "現在の回線交換は、1つの物理チャネル上に複数の仮想回線を多重化する形で行われる。",
      "この仮想的な接続では、通信媒体が共有されており、リソースを共同で利用する。"
    ],
    "explanationDe": [
      "Die Leitungsvermittlung begann mit einer sehr physischen Umsetzung: In frühen Telefonsystemen mussten Menschen in den Vermittlungsstellen tatsächlich Kabel von einem Anschluss zum anderen umstecken, um eine Verbindung zwischen zwei Gesprächspartnern herzustellen.",
      "Das war nicht nur aufwendig, sondern auch zeitintensiv und fehleranfällig.",
      "Mit dem technischen Fortschritt wurden diese manuellen Prozesse durch elektronische Schaltungen ersetzt, die Verbindungen automatisch herstellen konnten.",
      "Heute arbeitet man in der Regel mit virtuellen Leitungen, die über ein Verfahren namens Multiplexing realisiert werden.",
      "Dabei teilen sich mehrere logische Verbindungen ein physikalisches Medium – man spricht von einem geteilten Medium mit Resource Sharing.",
      "Das bedeutet: Mehrere Gespräche oder Datenverbindungen laufen scheinbar unabhängig über denselben Kanal, ohne sich gegenseitig zu stören.",
      "Ein Beispiel für dieses Prinzip ist ISDN, bei dem Sprachkanäle digitalisiert und gebündelt über eine Leitung übertragen werden."
    ],
    "explanationJa": [
      "回線交換方式は、通信の歴史の初期においては非常に物理的な方法で行われていました。",
      "古い電話システムでは、オペレーターが中継局でケーブルを差し替えて、発信者と受信者を物理的な線で接続していました。",
      "これは人手と時間を多く要し、接続ミスも発生しやすい方法でした。",
      "やがて技術の進歩により、物理的な配線の代わりに電子的に仮想的な回線（バーチャルサーキット）を構成できるようになりました。",
      "現代の回線交換では、多重化（Multiplexing）技術によって、1つの物理的な通信チャネル上に複数の論理的な通信路を通すことができます。",
      "これにより、複数の通信が同時に行われているように見えながら、互いに干渉せずに通信を成立させることが可能です。",
      "例えばISDNでは、音声やデータがデジタル化され、複数のチャネルとして1本の回線にまとめて送られています。"
    ],
    "originalSlideText": "Leitungsvermittelte Netze (1)\n❑ Erste Telekommunikationsverbindungen wurden als physikalische Leitungen aufgebaut → „Verbindung“ durch Umstecken von Kabeln in der Vermittlungsstelle\n❑ Heute: Virtuelle Leitungen\n Mehrere Leitungen über einen physikalischen Kanal multiplexed\n Geteiltes Medium → Resource Sharing",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 3,
    "questionDe": "(s6) Welche Eigenschaften hat die Leitungsvermittlung?",
    "questionJa": "回線交換方式にはどのような特徴がありますか？",
    "answerDe": [
      "Point-to-Point-Kommunikation zwischen zwei Endpunkten.",
      "Verbindungsaufbau und -abbau notwendig.",
      "Virtuelle Leitungen sind temporär.",
      "Keine Performanceunterschiede zu physikalischen Leitungen.",
      "Isolation der virtuellen Leitungen voneinander."
    ],
    "answerJa": [
      "2つの端末間でのポイント・ツー・ポイント通信。",
      "通信の前後に接続の確立と切断が必要。",
      "仮想回線は一時的な接続である。",
      "物理的な専用回線と性能上の差はない。",
      "各仮想回線は互いに独立しており、干渉しない。"
    ],
    "explanationDe": [
      "Leitungsvermittlung ist ein Kommunikationsprinzip, bei dem zwischen zwei Endpunkten eine direkte, exklusive Verbindung für die Dauer der Kommunikation aufgebaut wird.",
      "Diese Verbindung kann physikalisch sein – wie bei alten Telefonsystemen – oder virtuell, wie es heute durch Multiplexing realisiert wird.",
      "Die Kommunikation erfolgt dabei als Point-to-Point, d.h., genau zwei Teilnehmer sind miteinander verbunden, was eine konstante Bandbreite und geringe Latenz ermöglicht.",
      "Vor Beginn der Datenübertragung wird die Verbindung aufgebaut und nach dem Ende der Übertragung wieder abgebaut.",
      "Diese Verbindungen sind temporär, bestehen also nur so lange wie die Übertragung aktiv ist.",
      "Wichtig ist, dass es keinen Geschwindigkeits- oder Qualitätsunterschied zwischen einer physischen und einer virtuellen Verbindung gibt – die Datenübertragung erfolgt in beiden Fällen zuverlässig.",
      "Durch die Isolation der Verbindungen wird sichergestellt, dass parallele virtuelle Leitungen sich gegenseitig nicht beeinflussen – ein großer Vorteil für Echtzeitanwendungen wie Sprache oder Video."
    ],
    "explanationJa": [
      "回線交換方式は、通信する2者間に専用の通信路を確立し、その通信中は他の通信と共有しないという方式です。",
      "この接続は物理的なものである場合もあれば、現代では多くが仮想的な回線（バーチャルサーキット）として実現されています。",
      "この方式では、2者間で明確に決められた接続経路を使って、他の通信と干渉しない形でデータがやり取りされます。",
      "通信を始める前に接続を確立し、終了後には接続を切断する必要があります。",
      "仮想回線は一時的なものであり、通信のたびにその都度新たに確立されます。",
      "物理的な専用線を使用した場合と仮想的な回線を使った場合とで、通信品質（帯域幅、遅延など）には実質的な違いがありません。",
      "また、各回線は他の回線と独立しているため、同時に複数の通信が行われていても干渉しないという特徴があり、特に通話やビデオ会議のようなリアルタイム性の高いアプリケーションに向いています。"
    ],
    "originalSlideText": "Leitungsvermittelte Netze (2)\n❑ Eigenschaften der Leitungsvermittlung (Circuit Switching):\n Point-to-Point Kommunikation\n Verbindungsaufbau und Verbindungsabbau\n• Virtuelle Leitungen sind temporär\n Kein Performanceunterschied zu physikalischen Leitungen\n• Isolation verschiedener Virtueller Leitungen voneinander",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 4,
    "questionDe": "(s7) Was ist die Grundlage des Internets in Bezug auf Datenübertragung?",
    "questionJa": "インターネットにおけるデータ転送の基本的な仕組みは何ですか？",
    "answerDe": [
      "Die Daten werden in kleine Pakete aufgeteilt.",
      "Diese Pakete werden einzeln im Netzwerk geroutet.",
      "Die Datenflüsse konkurrieren um den physikalischen Kanal.",
      "Es wird Statistical Multiplexing verwendet."
    ],
    "answerJa": [
      "データは小さなパケットに分割される。",
      "それぞれのパケットはネットワーク内で個別にルーティングされる。",
      "複数のデータフローが物理チャネルを取り合う形で通信する。",
      "Statistical Multiplexing（統計的多重化）が利用されている。"
    ],
    "explanationDe": [
      "Die Internetkommunikation basiert auf dem Prinzip der Paketvermittlung. Das bedeutet, dass große Datenmengen zunächst in kleinere Einheiten, sogenannte Pakete, zerlegt werden.",
      "Jedes dieser Pakete wird mit Metadaten wie Zieladresse und Sequenznummer versehen und dann unabhängig über das Netzwerk weitergeleitet.",
      "Dadurch können Pakete unterschiedliche Routen nehmen und müssen nicht gemeinsam am Ziel ankommen. Erst dort werden sie wieder korrekt zusammengesetzt.",
      "Diese Methode erlaubt eine flexible Nutzung der Netzwerkinfrastruktur, da keine festen Verbindungen reserviert werden müssen.",
      "Stattdessen teilen sich viele Datenströme dieselben physischen Ressourcen im Netzwerk – dies nennt man Statistical Multiplexing.",
      "Dabei werden Ressourcen dynamisch je nach Bedarf verteilt, was insbesondere bei vielen gleichzeitigen Nutzern effizient ist.",
      "Ein Nachteil kann jedoch sein, dass es zu Verzögerungen und Schwankungen (Jitter) kommen kann, weil keine garantierte Bandbreite reserviert ist."
    ],
    "explanationJa": [
      "インターネットのデータ転送は、パケット交換方式という仕組みに基づいています。",
      "これは、大きなデータをまず小さな単位（パケット）に分割し、それぞれのパケットに宛先や順番などの情報をつけて、独立してネットワーク上を送信する方法です。",
      "パケットはそれぞれ別々の経路を通って目的地に向かう可能性があり、到着後に正しい順番に再構築されます。",
      "この方法により、通信のたびに専用の回線を確保する必要がなくなり、ネットワークリソースを効率的に利用できます。",
      "複数の通信が1つの物理的な回線を同時に共有する仕組みは「Statistical Multiplexing（統計的多重化）」と呼ばれます。",
      "これは、ネットワークの使用状況に応じて動的に帯域を分配する仕組みで、多くのユーザーが同時に利用する状況に適しています。",
      "ただし、通信が集中する場合には、遅延やばらつき（ジッター）が発生しやすくなるという欠点もあります。"
    ],
    "originalSlideText": "Paketvermittelte Netze (1)\n❑ Basis des Internets: Daten werden in kleine Pakete aufgeteilt; Pakete werden im Netzwerk geroutet\n❑ Im Gegensatz zur Leitungsvermittlung konkurrieren die Datenflüsse miteinander um den physikalischen Kanal → Statistical Multiplexing",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 5,
    "questionDe": "(s8) Welche Merkmale kennzeichnen paketvermittelte Netze?",
    "questionJa": "パケット交換ネットワークにはどのような特徴がありますか？",
    "answerDe": [
      "Beliebige, asynchrone Kommunikation mit vielen Kommunikationspartnern möglich.",
      "Kein Verbindungsaufbau notwendig.",
      "Ad-hoc Weiterleitung von Paketen zu jedem Ziel.",
      "Schwankende Performance durch Statistical Multiplexing."
    ],
    "answerJa": [
      "多くの通信相手と自由かつ非同期に通信ができる。",
      "通信開始前に接続を確立する必要がない。",
      "任意の宛先に対してパケットをその場で転送できる。",
      "統計的多重化により、通信性能にばらつきがある。"
    ],
    "explanationDe": [
      "Paketvermittelte Netze ermöglichen es, Daten flexibel und ohne vorherige Absprache zu übertragen.",
      "Ein Kommunikationspartner kann zu jedem beliebigen Zeitpunkt mit einem anderen kommunizieren – ohne Verbindungsaufbau oder feste Leitung.",
      "Diese Art der Kommunikation ist asynchron, was bedeutet, dass Sender und Empfänger nicht gleichzeitig aktiv sein müssen.",
      "Ein Beispiel dafür ist die E-Mail: Der Absender sendet Nachrichten unabhängig davon, ob der Empfänger gerade online ist.",
      "Pakete werden im Netz spontan (ad-hoc) weitergeleitet, je nach Routingtabellen und Netzwerkauslastung.",
      "Dies bringt eine hohe Flexibilität, aber auch eine gewisse Unsicherheit bei der Übertragungsqualität mit sich.",
      "Weil alle Datenströme sich denselben Kanal teilen (Statistical Multiplexing), kann es bei hoher Netzlast zu Verzögerungen und unvorhersehbarer Performance kommen – im Gegensatz zur konstanten Qualität bei Leitungsvermittlung."
    ],
    "explanationJa": [
      "パケット交換ネットワークは、事前に接続を確立することなくデータを柔軟に送受信できる仕組みです。",
      "通信を始めるための準備が不要で、どの相手とも任意のタイミングで通信が可能です。",
      "この非同期通信により、送信側と受信側が同時にオンラインである必要はありません。",
      "たとえば、メールは相手がオフラインでも送信でき、後から受信者が受け取ることができます。",
      "ネットワーク内では、パケットは状況に応じて即座にルーティングされ、特定の経路を予約していない点が特徴です。",
      "この柔軟性の反面、通信の品質（速度や遅延）が一定しないという側面があります。",
      "複数の通信が同じ物理的な回線を共有することで、ネットワークが混雑している場合には遅延が発生しやすくなり、回線交換方式と比べて品質が不安定になる可能性があります。"
    ],
    "originalSlideText": "Paketvermittelte Netze (2)\n❑ Eigenschaften Packet Switching:\n Beliebige, asynchrone Kommunikation\n• Kommunikation mit beliebig vielen Kommunikationspartner ohne Zeitbeschränkungen\n Kein Verbindungsaufbau\n• Ad-hoc Paket-Weiterleitung zu jedem belieben Ziel \n Schwankende Performance durch Statistical Multiplexing",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 6,
    "questionDe": "(s9) Wie werden Netzwerke nach Distanz klassifiziert?",
    "questionJa": "ネットワークは距離によってどのように分類されますか？",
    "answerDe": [
      "Local Area Networks (LAN): Netzwerk innerhalb eines Gebäudes.",
      "Metropolitan Area Networks (MAN): Netzwerk innerhalb einer Stadt.",
      "Wide Area Networks (WAN): Netzwerk verbindet Städte.",
      "MANs haben in der Praxis kaum Relevanz."
    ],
    "answerJa": [
      "LAN（ローカルエリアネットワーク）：建物内のネットワーク。",
      "MAN（メトロポリタンエリアネットワーク）：都市内のネットワーク。",
      "WAN（ワイドエリアネットワーク）：都市間を接続するネットワーク。",
      "実際にはMANはほとんど利用されていない。"
    ],
    "explanationDe": [
      "Netzwerke lassen sich grob nach der räumlichen Ausdehnung klassifizieren, also wie weit die verbundenen Geräte voneinander entfernt sind.",
      "Ein Local Area Network (LAN) deckt typischerweise ein einzelnes Gebäude oder ein eng begrenztes Gelände ab, wie etwa ein Büro, eine Schule oder ein Heimnetzwerk.",
      "Metropolitan Area Networks (MAN) sind für den Einsatz innerhalb einer Stadt gedacht, also etwa zur Verbindung von Gebäuden, Behörden oder Universitäten über städtische Infrastrukturen.",
      "In der Praxis sind MANs jedoch selten geworden, da moderne WAN-Technologien wie Glasfaser-Internet oder VPN viele Funktionen von MANs übernehmen.",
      "Wide Area Networks (WAN) sind großräumige Netzwerke, die Städte oder sogar Länder verbinden. Das bekannteste Beispiel ist das Internet selbst.",
      "WANs basieren oft auf öffentlichen Telekommunikationsdiensten und benötigen spezielle Protokolle und Infrastruktur, um über lange Distanzen hinweg zuverlässig zu arbeiten.",
      "Die Einteilung in LAN, MAN und WAN hilft dabei, unterschiedliche Anforderungen an Netzwerktechnologien, Protokolle und Sicherheitsmaßnahmen zu verstehen."
    ],
    "explanationJa": [
      "ネットワークは、接続される機器の物理的な距離によって大まかに分類することができます。",
      "LAN（ローカルエリアネットワーク）は、通常、1つの建物やキャンパスのような限定された範囲で利用されるネットワークであり、家庭、学校、オフィスなどで一般的に使われています。",
      "MAN（メトロポリタンエリアネットワーク）は、都市レベルでのネットワークで、複数の建物や組織を都市インフラ経由で接続するために設計されています。",
      "しかし、実際にはMANの利用は限られており、多くのケースでWAN技術が代替しています。",
      "WAN（ワイドエリアネットワーク）は、都市間や国をまたいで通信する大規模ネットワークで、インターネットがその代表例です。",
      "WANでは、長距離通信に耐えうる技術やプロトコルが必要であり、信頼性やルーティング技術が重要な要素になります。",
      "この分類（LAN、MAN、WAN）を理解することで、ネットワークの構築や運用において適切な技術や設計が選択できるようになります。"
    ],
    "originalSlideText": "Netzwerk Klassifikation\n❑ Packet Switching Technologien werden nach Übertragungsdistanz in drei Klassen eingeteilt\n Local Area Networks (LAN)\n• Netzwerk eines Gebäudes\n Metropolitan Area Networks (MAN)\n• Netzwerk innerhalb einer Stadt\n• Praktisch keine Relevanz\n Wide Area Networks (WAN)\n• Netzwerk verbindet Städte",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 7,
    "questionDe": "(s10) Warum sind Standards in Netzwerken notwendig?",
    "questionJa": "ネットワークにおいて標準（スタンダード）が必要とされるのはなぜですか？",
    "answerDe": [
      "Alle Netzteilnehmer müssen Pakete gleich interpretieren können.",
      "Nur so kann der Empfänger eines Pakets eindeutig identifiziert werden.",
      "Das IEEE erarbeitet LAN-Protokolle im Rahmen des Projekts 802.",
      "Andere Organisationen kümmern sich um Standards auf höheren Schichten."
    ],
    "answerJa": [
      "全てのネットワーク参加者が、パケットを同じように解釈できる必要がある。",
      "それにより、パケットの宛先（受信者）を正確に識別できる。",
      "IEEEはLAN用のプロトコルをプロジェクト802で策定している。",
      "その他の標準化団体は、インターネット層やアプリケーション層の標準化を担っている。"
    ],
    "explanationDe": [
      "Standards sind notwendig, damit verschiedene Geräte und Systeme in einem Netzwerk zuverlässig miteinander kommunizieren können.",
      "Wenn ein Computer ein Paket sendet, muss der Empfänger es korrekt interpretieren können – unabhängig vom Hersteller oder Betriebssystem.",
      "Dies erfordert eine einheitliche Struktur und Bedeutung der Daten, wie z. B. die Definition von Adressformaten, Protokollstrukturen und Kontrollmechanismen.",
      "Ein praktisches Beispiel: Wenn zwei Computer miteinander kommunizieren, muss beide wissen, welches Bitfeld die Zieladresse enthält und wie groß diese ist.",
      "Fehlende oder uneinheitliche Standards würden dazu führen, dass Geräte sich gegenseitig nicht verstehen – selbst wenn sie physikalisch verbunden sind.",
      "Das IEEE (Institute of Electrical and Electronics Engineers) entwickelt daher verbindliche Standards für lokale Netzwerke (LAN) unter dem Projekt 802.",
      "Gleichzeitig konzentrieren sich andere Organisationen wie die IETF (Internet Engineering Task Force) auf die höheren Schichten des OSI-Modells, wie die Internet- und Anwendungsschicht."
    ],
    "explanationJa": [
      "ネットワークにおける標準の存在は、異なる機器やシステム同士が問題なく通信するために不可欠です。",
      "たとえば、あるコンピュータから送信されたデータパケットが、別の機器でも正しく理解されるには、共通の形式や意味が定義されている必要があります。",
      "これは、アドレスの書き方、フレームの構造、エラーチェックの方法など、様々な要素において共通ルールが必要であることを意味します。",
      "たとえば、宛先アドレスが何ビットで構成されているか、パケットのどの部分に含まれているか、ということを送受信側が共有していなければ通信は成り立ちません。",
      "もし標準がなければ、異なるメーカーやOSの機器間で通信ができなくなってしまいます。",
      "このため、IEEE（米国電気電子学会）は、LANのようなネットワーク層以下の技術について、802プロジェクトを通じて標準化を行っています。",
      "一方で、インターネット層やアプリケーション層については、IETF（インターネット技術タスクフォース）など他の団体が標準を策定しています。"
    ],
    "originalSlideText": "Standards\n❑ Alle Netzteilnehmer müssen übertragende Pakete gleich interpretieren um z.B. den Empfänger des Paketes eindeutig identifizieren zu können\n❑ Institute for Electrical und Electronics Engineers (IEEE) erarbeitet LAN Protokolle im Projekt 802\n❑ Andere Standardisierungsorganisationen fokussieren  auf die Internet- und Anwendungsschicht",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 8,
    "questionDe": "(s11) Wie ist die IEEE-802-Schichtstruktur aufgebaut?",
    "questionJa": "IEEE 802の階層構造はどのようになっていますか？",
    "answerDe": [
      "Die Network Interface Schicht (Layer 2) ist in zwei Unterschichten aufgeteilt:",
      "Logical Link Control (LLC): zuständig für Adressierung und Demultiplexing.",
      "Media Access Control (MAC): zuständig für den Zugriff auf das geteilte Medium."
    ],
    "answerJa": [
      "ネットワークインターフェース層（第2層）は2つのサブ層に分かれている：",
      "Logical Link Control（LLC）：アドレス指定とデマルチプレクス（多重化の解除）を担当。",
      "Media Access Control（MAC）：共有メディアへのアクセス制御を担当。"
    ],
    "explanationDe": [
      "IEEE 802 ist ein Standardrahmenwerk für lokale Netzwerke und beschreibt die Funktionsweise der Schicht 2 im OSI-Modell, also der Sicherungsschicht (Data Link Layer).",
      "Diese Schicht ist weiter unterteilt in zwei separate Unterschichten: die Logical Link Control (LLC) und die Media Access Control (MAC).",
      "Die LLC-Schicht ist für die logische Adressierung verantwortlich, das heißt sie stellt sicher, dass Daten den richtigen Protokollen und Prozessen im Empfängerrechner zugeordnet werden.",
      "Außerdem sorgt LLC für die Demultiplexierung, also das richtige Aufteilen empfangener Datenpakete an die verschiedenen höheren Protokolle.",
      "Die MAC-Schicht hingegen regelt, wann und wie Geräte auf das gemeinsame Übertragungsmedium zugreifen dürfen.",
      "Dies ist besonders wichtig in Netzwerken mit mehreren Teilnehmern wie Ethernet oder WLAN, wo Kollisionen auf dem Medium vermieden oder behandelt werden müssen.",
      "Diese Trennung ermöglicht eine modulare Entwicklung von Netzwerktechnologien und erleichtert die Integration verschiedener Medienzugriffsverfahren unter einem gemeinsamen Adressierungs- und Steuerungssystem."
    ],
    "explanationJa": [
      "IEEE 802は、LAN（ローカルエリアネットワーク）の通信プロトコルを標準化した枠組みであり、OSI参照モデルにおける第2層（データリンク層）の構造を定義しています。",
      "このデータリンク層はさらに2つのサブ層に分かれており、それがLogical Link Control（LLC）とMedia Access Control（MAC）です。",
      "LLCは論理的なアドレス指定を担当し、データがどの上位プロトコルに渡されるべきかを識別・制御します。",
      "また、複数の通信を適切に振り分けるデマルチプレクス（多重化解除）機能も持っています。",
      "一方、MACは、複数の端末が共有する通信路（メディア）に対して、いつどの端末がデータを送信できるかを制御します。",
      "これは、衝突が起きやすいEthernetや無線LAN（WLAN）といった環境で特に重要な機能です。",
      "このようにLLCとMACを分けることで、それぞれの機能に特化した設計が可能となり、柔軟で効率的なネットワーク構築が実現できます。"
    ],
    "originalSlideText": "IEEE 802\n❑ Aufteilung des Network Interface Layers (Layer 2) in zwei Unterschichten\n Logical Link Control (LLC)\n• Adressierung und Demultiplexing\n Media Access Control (MAC)\n• Zugriff auf das geteilte Medium",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 9,
    "questionDe": "(s12) Welche Teilprojekte umfasst IEEE 802?",
    "questionJa": "IEEE 802にはどのようなサブプロジェクトがありますか？",
    "answerDe": [
      "IEEE 802 umfasst verschiedene Teilprojekte, die unterschiedliche Netzwerktechnologien standardisieren.",
      "Beispiele sind:",
      "802.3 – Ethernet",
      "802.11 – WLAN (Wireless LAN)",
      "802.15 – Wireless Personal Area Networks (z. B. Bluetooth)",
      "802.16 – Broadband Wireless Access (z. B. WiMAX)"
    ],
    "answerJa": [
      "IEEE 802には、様々なネットワーク技術を標準化するサブプロジェクトが含まれている。",
      "代表的なものは以下の通り：",
      "802.3 – イーサネット",
      "802.11 – 無線LAN（WLAN）",
      "802.15 – 無線PAN（Bluetoothなど）",
      "802.16 – 広帯域無線アクセス（WiMAXなど）"
    ],
    "explanationDe": [
      "Das IEEE 802-Projekt ist eine umfangreiche Sammlung von Standardisierungsprojekten, die sich mit der Datenübertragung in lokalen und metropolitanen Netzwerken befassen.",
      "Jedes Teilprojekt in IEEE 802 ist für eine bestimmte Technologie zuständig.",
      "Zum Beispiel beschreibt IEEE 802.3 die Standards für Ethernet, die weltweit am häufigsten eingesetzte kabelgebundene Netzwerktechnologie.",
      "IEEE 802.11 befasst sich mit drahtlosen Netzwerken, besser bekannt unter dem Namen WLAN oder Wi-Fi.",
      "Weitere Projekte wie 802.15 regeln die Kommunikation in kleinen, kabellosen Netzwerken – z. B. Bluetooth.",
      "802.16 standardisiert breitbandige, kabellose Zugänge für größere Entfernungen, ein Beispiel ist WiMAX.",
      "Diese Unterteilung erlaubt es, technologische Entwicklungen gezielt zu adressieren und dennoch unter einem gemeinsamen Rahmenwerk kompatibel zu bleiben."
    ],
    "explanationJa": [
      "IEEE 802プロジェクトは、LANやMANといった近距離～中距離ネットワークの標準を策定するための包括的な標準化プロジェクトです。",
      "このプロジェクトの中には、用途ごとに分かれたサブプロジェクト（部分標準）があり、それぞれが特定の技術を担当しています。",
      "たとえば、IEEE 802.3はイーサネットの標準を定めており、有線LANとして最も広く使われています。",
      "IEEE 802.11は無線LAN（Wi-Fi）に関する標準で、家庭やオフィスなどで普及しています。",
      "IEEE 802.15は、Bluetoothなどの短距離無線通信（パーソナルエリアネットワーク）を対象としています。",
      "IEEE 802.16は、WiMAXなどの広帯域無線アクセスに関する技術を扱います。",
      "このように分野ごとに標準を定めることで、専門性を高めつつも相互運用性を保ったネットワーク技術の発展が可能になります。"
    ],
    "originalSlideText": "Übersicht 802 Teilprojekte",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 10,
    "questionDe": "(s13) Welche Topologien gibt es in LANs und was haben sie gemeinsam?",
    "questionJa": "LANにはどのようなトポロジーがありますか？それらの共通点は何ですか？",
    "answerDe": [
      "LANs nutzen verschiedene Topologien wie Bus, Ring, Mesh und Stern.",
      "Alle LANs sind Multi-Access-Netzwerke.",
      "Das Medium wird von allen Geräten gemeinsam genutzt.",
      "Jeder Computer kann mit jedem anderen kommunizieren."
    ],
    "answerJa": [
      "LANにはバス型、リング型、メッシュ型、スター型などのトポロジーがある。",
      "すべてのLANはマルチアクセスネットワークである。",
      "すべての端末が1つの通信媒体を共有して使用している。",
      "どの端末からも他の全ての端末と通信が可能である。"
    ],
    "explanationDe": [
      "In einem LAN (Local Area Network) gibt es verschiedene physikalische Topologien, die beschreiben, wie die Geräte untereinander verbunden sind.",
      "Typische LAN-Topologien sind Bus, Ring, Mesh und Stern.",
      "Obwohl sich die physikalischen Verbindungen unterscheiden, haben alle LANs ein gemeinsames Merkmal: Sie sind sogenannte Multi-Access-Netzwerke.",
      "Das bedeutet, dass alle Geräte über ein gemeinsames Medium kommunizieren und theoretisch jede Station mit jeder anderen direkt Daten austauschen kann.",
      "Im Gegensatz dazu sind z. B. WANs oft Punkt-zu-Punkt-Verbindungen, bei denen Daten über mehrere Zwischenstationen weitergeleitet werden.",
      "LAN-Topologien unterscheiden sich in Aspekten wie Kosten, Ausfallsicherheit, Erweiterbarkeit und Zugriffsmechanismen auf das geteilte Medium.",
      "Ein gutes Verständnis dieser Topologien ist entscheidend für die Planung effizienter Netzwerke, insbesondere im Hinblick auf Skalierbarkeit und Fehlerbehandlung."
    ],
    "explanationJa": [
      "LAN（ローカルエリアネットワーク）では、複数の端末同士がどのように接続されているかを示す構成（トポロジー）にいくつかの種類があります。",
      "代表的なものとして、バス型、リング型、メッシュ型、スター型があります。",
      "これらの形はそれぞれ異なる接続方法を持っていますが、共通しているのは、すべてマルチアクセスネットワークであるという点です。",
      "マルチアクセスネットワークとは、すべての端末が1つの通信媒体（たとえばケーブル）を共有して使用し、理論上すべての端末が互いに直接通信できる構造のことです。",
      "これは、長距離通信で使われるWAN（広域ネットワーク）などのポイント・ツー・ポイント接続とは対照的です。",
      "各トポロジーは、コスト、故障時の影響、拡張性、メディアアクセス方式（誰がいつ送信できるかの制御）などに違いがあります。",
      "そのため、トポロジーの選択は、ネットワークの効率性や安定性、将来的な拡張性を大きく左右します。"
    ],
    "originalSlideText": "LAN Topologien\n❑ LANs sind Multi Access Networks (und nicht Point-to-Point)\n Geteiltes Medium\n Jeder angeschlossene Computer kann mit jedem anderen kommunizieren\n❑ Verschiedenste LAN Technologien wurden dafür entwickelt, die sich zuallererst in ihrer Topologie unterscheiden",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 11,
    "questionDe": "(s14) Was kennzeichnet die Bus-Topologie? (Bild vorhanden)",
    "questionJa": "バス型トポロジーの特徴は何ですか？（図あり）",
    "answerDe": [
      "Alle Computer sind an ein langes gemeinsames Kabel angeschlossen.",
      "Signale erreichen alle Computer am Kabel.",
      "Zugriff auf das Kabel muss koordiniert werden."
    ],
    "answerJa": [
      "全てのコンピュータが1本の長い共有ケーブルに接続されている。",
      "送信された信号はケーブル上の全ての端末に届く。",
      "ケーブルの使用権を調整する仕組みが必要である。"
    ],
    "explanationDe": [
      "Die Bus-Topologie ist eine der ältesten Netzwerktopologien und wurde in der ersten Version von Ethernet verwendet.",
      "Dabei sind alle Geräte mit einem einzigen, durchgehenden Kabel verbunden – dem sogenannten Bus.",
      "Wenn ein Gerät ein Signal auf das Kabel sendet, verbreitet sich dieses Signal entlang des Kabels und erreicht alle anderen angeschlossenen Geräte.",
      "Das bedeutet, dass theoretisch alle Teilnehmer jedes Signal empfangen, auch wenn es nur für einen bestimmt ist.",
      "Daher muss es ein Protokoll geben, das den Zugriff auf das Kabel regelt, um Kollisionen zu vermeiden – z. B. CSMA/CD.",
      "Ein Vorteil der Bus-Topologie ist der geringe Materialaufwand, da nur ein Kabel benötigt wird.",
      "Nachteilig ist jedoch die begrenzte Skalierbarkeit und die Anfälligkeit gegenüber Kabelunterbrechungen: Ein Fehler im Bus kann das gesamte Netzwerk lahmlegen."
    ],
    "explanationJa": [
      "バス型トポロジーは、ネットワーク構成の中でも最も古い形式の1つで、初期のイーサネットでも使用されていました。",
      "この構成では、全ての端末（コンピュータなど）が1本の長い直線的なケーブル（バス）に接続されます。",
      "ある端末がデータを送信すると、その信号はバス全体を伝わって、接続されているすべての端末に届きます。",
      "そのため、他の端末は自分宛てのデータかどうかを確認する必要があり、同時に複数の送信があると衝突（コリジョン）が起きる可能性があります。",
      "このような衝突を避けるためには、メディアアクセス制御の仕組み（例：CSMA/CD）が必要です。",
      "バス型の利点は、構成がシンプルでケーブルの量も少なくて済む点ですが、",
      "逆に1ヶ所でもケーブルが切れたり障害が起きたりすると、全体の通信が停止するという大きな欠点があります。"
    ],
    "originalSlideText": "Bus Topologie\n❑ Wurde von der ersten Ethernet Version implementiert\n❑ Alle Rechner sind an ein langes Kabel angeschlossen\n Offensichtlich erreichen alle ausgesendeten Signale alle Computer am Kabel\n Koordinierung des Zugriffs auf das Kabel notwendig",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 12,
    "questionDe": "(s15) Was unterscheidet die Ring-Topologie von der Bus-Topologie? (Bild vorhanden)",
    "questionJa": "リング型トポロジーはバス型トポロジーとどう違いますか？（図あり）",
    "answerDe": [
      "Wie beim Bus wird ein gemeinsames Kabel verwendet.",
      "Jedoch sind die Geräte in einem Ring verbunden.",
      "Ring-Topologie ist fehlertoleranter als Bus.",
      "Kommunikation mit allen Teilnehmern bleibt auch bei Ausfall eines Verbindungsstücks möglich."
    ],
    "answerJa": [
      "バス型と同様に、共有されたケーブルを用いる。",
      "ただし、端末同士が環状（リング状）に接続されている。",
      "バス型よりも耐障害性が高い。",
      "接続の一部が故障しても、全端末との通信が可能な場合がある。"
    ],
    "explanationDe": [
      "Die Ring-Topologie ähnelt auf den ersten Blick der Bus-Topologie, da auch hier ein gemeinsames Übertragungsmedium verwendet wird.",
      "Allerdings sind die Geräte bei der Ring-Topologie nicht linear, sondern kreisförmig miteinander verbunden – das Signal wird von Gerät zu Gerät im Ring weitergeleitet.",
      "Ein Vorteil der Ringstruktur ist die höhere Fehlertoleranz: Wenn ein Abschnitt des Rings ausfällt, kann das Netzwerk unter bestimmten Voraussetzungen weiter funktionieren – etwa durch einen sogenannten „Dual Ring“ oder eine automatische Umleitung.",
      "Bei der Bus-Topologie hingegen führt ein Kabelfehler in der Regel zum kompletten Ausfall des Netzwerks.",
      "In Ring-Topologien wird häufig ein Token-Passing-Verfahren eingesetzt, bei dem ein spezielles Datenpaket (Token) herumgereicht wird, um den Zugriff auf das Medium zu steuern.",
      "Dies verhindert Kollisionen und ermöglicht eine koordinierte Kommunikation zwischen den Knoten.",
      "Trotz dieser Vorteile wird die Ring-Topologie heutzutage seltener eingesetzt, da sie im Aufbau und der Wartung komplexer als moderne Sternstrukturen ist."
    ],
    "explanationJa": [
      "リング型トポロジーは、表面的にはバス型トポロジーと似ており、どちらも複数の端末が1つのケーブル（または伝送経路）を共有する構造です。",
      "ただし、リング型では端末が直線ではなく円環状に接続されており、信号は時計回りまたは反時計回りに隣の端末へと順に送られます。",
      "この構造の大きな利点は耐障害性の高さで、例えば接続の一部が切れても、もう一方のルートから信号を送ることで通信が継続できることがあります。",
      "バス型ではケーブルに障害が起きると全体が機能停止する可能性がありますが、リング型ではそうした影響を抑えられる構造が可能です。",
      "リング型ではしばしば「トークンパッシング方式」が採用され、通信の順番を制御する仕組みが組み込まれています。",
      "このトークン（制御パケット）を持っている端末だけが送信できるため、通信の衝突（コリジョン）を防ぐことができます。",
      "ただし、配線や機器の構成が複雑になりがちなため、現在ではスター型などより簡便な構造に置き換えられることが多くなっています。"
    ],
    "originalSlideText": "Ring Topologie\n❑ Ähnlich Bus → Geteiltes Kabel\n❑ Fehlertoleranter als der Bus: Kommunikation mit allen angeschlossenen Rechnern trotz Ausfall eines Verbindungsstückes",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 13,
    "questionDe": "(s16) Warum ist die Mesh-Topologie teuer? (Bild vorhanden)",
    "questionJa": "なぜメッシュ型トポロジーはコストが高いのですか？（図あり）",
    "answerDe": [
      "Für jedes Paar an Kommunikationspartnern wird eine eigene physikalische Leitung benötigt.",
      "Die Anzahl der Verbindungen steigt exponentiell mit der Zahl der Geräte.",
      "Dies führt zu hohem Material- und Installationsaufwand."
    ],
    "answerJa": [
      "通信する端末のペアごとに専用の物理的な接続が必要になる。",
      "接続台数が増えるほど、必要な配線数が急増する。",
      "その結果、設備費用や設置作業が非常に高くなる。"
    ],
    "explanationDe": [
      "Die Mesh-Topologie bietet für jedes mögliche Paar von Geräten im Netzwerk eine eigene, direkte physikalische Verbindung.",
      "Das bedeutet, dass bei n Geräten insgesamt n(n-1)/2 Verbindungen erforderlich sind – also wächst die Anzahl der Kabel exponentiell.",
      "Diese Formel entspricht dem Binomialkoeffizienten für mögliche Verbindungen ohne Wiederholung.",
      "Der Vorteil dieses Ansatzes ist, dass jede Verbindung exklusiv und störungsfrei ist, was maximale Geschwindigkeit und Ausfallsicherheit bietet.",
      "Ein Gerät kann direkt mit jedem anderen kommunizieren, ohne Vermittlungsstationen – Latenzzeiten und Kollisionen sind damit minimiert.",
      "Allerdings ist der enorme Bedarf an physikalischen Leitungen sehr teuer in Anschaffung, Verlegung und Wartung.",
      "Deshalb ist die Mesh-Topologie wirtschaftlich nur in kleinen Netzwerken (z. B. militärischen oder kritischen Systemen) sinnvoll, bei denen Zuverlässigkeit höchste Priorität hat."
    ],
    "explanationJa": [
      "メッシュ型トポロジーでは、ネットワーク内のすべての端末が他のすべての端末と直接接続される構成になっています。",
      "このため、接続台数を n とすると、必要な物理的な接続数は n(n-1)/2 本と急増していきます。",
      "この数式は、重複なしの全てのペアの組み合わせ数を意味しており、規模が少し大きくなるだけで接続数が膨大になります。",
      "この構成の利点は、すべての通信が専用回線で行われるため、他の通信の影響を受けず、最大のスループットと信頼性が得られる点です。",
      "また、直接通信なのでルーティングによる遅延がなく、衝突（コリジョン）も発生しません。",
      "しかしその反面、膨大な数のケーブルとポートが必要となり、機器・配線コスト、設置工事、保守費用などが非常に高額になります。",
      "そのため、メッシュ型は経済性よりも信頼性を重視する小規模・高要求なシステム（軍事用・重要インフラ等）に限定して使われるのが一般的です。"
    ],
    "originalSlideText": "Mesh Topologie\n❑ Eigene physikalische Leitung für jedes Paar an Kommunikationspartnern\n❑ Teuer, da viele Leitungen: \nn! / (n−2)! 2! = n²−n / 2",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 14,
    "questionDe": "(s17) Warum ist die Stern-Topologie heute der Standard? (Bild vorhanden)",
    "questionJa": "なぜスター型トポロジーが現在の標準とされているのですか？（図あり）",
    "answerDe": [
      "Alle Geräte sind mit einem zentralen Punkt (Hub) verbunden.",
      "Der Hub leitet Daten gezielt vom Sender zum Empfänger weiter.",
      "Ermöglicht einfache Fehlersuche und -behebung.",
      "Hohe Skalierbarkeit und einfache Erweiterbarkeit.",
      "Bessere Fehlerisolierung als bei Bus- oder Ring-Topologie."
    ],
    "answerJa": [
      "すべての端末が中央のハブに接続されている。",
      "ハブが送信元から受信先へデータを的確に中継する。",
      "障害の特定と対処が容易である。",
      "拡張が簡単でスケーラビリティが高い。",
      "バス型やリング型よりも障害の影響範囲が限定される。"
    ],
    "explanationDe": [
      "Bei der Stern-Topologie sind alle Geräte über separate Kabel mit einem zentralen Gerät – dem sogenannten Hub oder Switch – verbunden.",
      "Dieses zentrale Gerät übernimmt die Vermittlung der Kommunikation: Es empfängt Daten vom Sender und leitet sie gezielt an den richtigen Empfänger weiter.",
      "Ein großer Vorteil dieser Struktur ist die einfache Fehlersuche: Wenn ein Gerät oder eine Verbindung ausfällt, sind nur die betroffenen Komponenten betroffen – das restliche Netzwerk funktioniert weiter.",
      "Zudem lassen sich neue Geräte leicht hinzufügen, indem sie einfach an den Hub angeschlossen werden – das macht die Topologie sehr skalierbar.",
      "Im Vergleich zur Bus- oder Ring-Topologie, bei der ein Fehler das gesamte Netz beeinträchtigen kann, bietet die Sternstruktur eine bessere Fehlerisolierung.",
      "Auch moderne Ethernet-Netzwerke basieren meist auf dieser Topologie, oft unter Einsatz intelligenter Switches statt einfacher Hubs.",
      "Die Stern-Topologie hat sich somit als robuster, wartungsfreundlicher und kosteneffizienter Standard für heutige Netzwerke etabliert."
    ],
    "explanationJa": [
      "スター型トポロジーでは、各端末が個別に中央のハブ（またはスイッチ）に接続されています。",
      "この中央装置が通信の中継役を担い、送信されたデータを適切な受信端末へと振り分けます。",
      "この構成の利点は、1つの端末やケーブルに障害が発生しても、他の部分には影響を与えないという高い障害耐性にあります。",
      "また、新たに端末を追加する際も、ハブに接続するだけでよいため、拡張性が非常に高いのも特徴です。",
      "バス型やリング型では、障害がネットワーク全体に波及する可能性がありますが、スター型ではそれが局所に留まります。",
      "現代のイーサネットネットワークでは、単純なハブではなく、より高度な制御機能をもつスイッチが使われることが一般的です。",
      "これらの理由から、スター型は現在のネットワーク構築において、信頼性、保守性、コスト効率の面で標準的な構成となっています。"
    ],
    "originalSlideText": "Star Topologie\n❑ Alle Rechner sind zu einem zentralen Punkt verbunden: der HUB\n❑ Heutiger Standard\n❑ Hub leitet Daten vom Sender zum spezifischen Empfänger weiter",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 15,
    "questionDe": "(s18) Was ist eine MAC-Adresse und wofür wird sie verwendet?",
    "questionJa": "MACアドレスとは何で、何のために使われますか？",
    "answerDe": [
      "Eine MAC-Adresse ist ein eindeutiger Identifier für jeden Rechner im Netzwerk.",
      "Sie besteht aus 48 Bit im Binärformat.",
      "Sie wird im Rahmen von IEEE 802 definiert.",
      "Jede Netzwerkkarte hat eine weltweit eindeutige MAC-Adresse.",
      "Die MAC-Adresse wird verwendet, um Pakete an das richtige Zielgerät zu senden."
    ],
    "answerJa": [
      "MACアドレスは、ネットワーク内の各端末に割り当てられた一意の識別子。",
      "48ビットのバイナリ形式で構成されている。",
      "IEEE 802によって定義されている。",
      "すべてのネットワークカードに対して世界的に唯一のMACアドレスが割り当てられる。",
      "パケットを正しい宛先デバイスへ届けるために使用される。"
    ],
    "explanationDe": [
      "Eine MAC-Adresse (Media Access Control Address) ist ein hardwaregebundener Identifikator, der einem Netzwerkgerät – z. B. einer Netzwerkkarte – zugewiesen wird.",
      "Sie dient dazu, Geräte auf der Datenverbindungsschicht (Layer 2) eindeutig zu identifizieren und ist notwendig, damit Netzwerkpakete korrekt zugestellt werden können.",
      "Die MAC-Adresse besteht aus 48 Bits und wird üblicherweise als zwölfstellige hexadezimale Zahl dargestellt – z. B. 00:1A:2B:3C:4D:5E.",
      "Im Rahmen des IEEE-802-Standards ist sie ein zentrales Element der Ethernet-Kommunikation.",
      "Wenn ein Gerät ein Datenpaket versendet, wird die MAC-Adresse des Zielgeräts im Frame-Header angegeben, sodass nur das richtige Gerät das Paket verarbeitet.",
      "MAC-Adressen sind weltweit eindeutig, weil sie zentral von der IEEE vergeben werden – kein Hersteller darf die gleiche Adresse mehrfach vergeben.",
      "Durch die Eindeutigkeit kann man Netzwerkteilnehmer verlässlich identifizieren – z. B. in einem Firmen-LAN oder beim Zugangskontrollmanagement im WLAN."
    ],
    "explanationJa": [
      "MACアドレス（Media Access Control Address）は、ネットワーク機器に固有に割り当てられる識別子です。",
      "これはデータリンク層（OSIモデルの第2層）で使用され、パケットを正しいデバイスに届けるために必要不可欠な情報です。",
      "MACアドレスは48ビットで構成され、通常は16進数で12桁（例：00:1A:2B:3C:4D:5E）として表示されます。",
      "IEEE 802の規格に基づいて設計されており、特にEthernet通信では基本的な構成要素となっています。",
      "送信側がパケットを送る際には、宛先デバイスのMACアドレスをフレームのヘッダーに含めることで、適切な受信機に届けられます。",
      "このアドレスはIEEEによって管理されており、各ネットワーク機器に一意のMACアドレスが世界的に割り当てられるため、同じアドレスが2つ存在することはありません。",
      "そのため、企業ネットワーク内での端末管理や、Wi-Fi接続の認証管理などにも利用されています。"
    ],
    "originalSlideText": "Adressierung (1)\n❑ In Packet Switched Networks benötigen die Pakete einen Identifier für das Ziel des Paketes: die Zieladresse\n Jeder Rechner besitzt eine eindeutige Adresse\n❑ IEEE 802 definiert Adressen in einem 48-bit Binärformat\n Auch als Ethernet- bzw. MAC-Adresse bekannt\n IEEE ist zentrale Vergabestelle für diese Adressen\n Weltweit eine eindeutige MAC-Adresse pro Netzwerkkarte",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 16,
    "questionDe": "(s19) Wie wird eine MAC-Adresse vergeben?",
    "questionJa": "MACアドレスはどのように割り当てられますか？",
    "answerDe": [
      "Die zentrale Vergabe jeder einzelnen MAC-Adresse wäre zu aufwendig.",
      "Deshalb weist die IEEE jedem Hersteller einen 24-Bit-Block zu – den OUI.",
      "Der Hersteller vergibt die restlichen 24 Bit selbst.",
      "So entsteht eine weltweit eindeutige MAC-Adresse."
    ],
    "answerJa": [
      "すべてのMACアドレスを中央で管理するのは非効率である。",
      "そのためIEEEは各メーカーに24ビットのOUI（組織固有識別子）を割り当てる。",
      "メーカーは残りの24ビットを自社で設定する。",
      "これにより、世界中で一意なMACアドレスが構成される。"
    ],
    "explanationDe": [
      "Die MAC-Adressvergabe folgt einem hierarchischen System, um die weltweite Eindeutigkeit effizient zu gewährleisten.",
      "Es wäre zu aufwendig, wenn jede einzelne Netzwerkkarte direkt von der IEEE eine Adresse bekommen müsste.",
      "Stattdessen weist die IEEE jedem Hersteller einen sogenannten Organizationally Unique Identifier (OUI) zu, der 24 Bit umfasst.",
      "Dieser OUI identifiziert eindeutig das Unternehmen, das die Netzwerkkarte produziert hat.",
      "Die restlichen 24 Bit der 48-Bit-MAC-Adresse werden vom Hersteller selbst vergeben – typischerweise sequentiell.",
      "So kann jeder Hersteller Millionen eindeutiger MAC-Adressen erzeugen, ohne Kollisionen mit anderen Herstellern zu riskieren.",
      "Beispielsweise könnte eine Firma wie Intel den OUI 00:1A:2B erhalten haben, und eine vollständige MAC-Adresse wäre dann z. B. 00:1A:2B:3C:4D:5E."
    ],
    "explanationJa": [
      "MACアドレスは、世界中で一意である必要があるため、その割り当てには工夫された仕組みが用いられています。",
      "もし全てのMACアドレスをIEEEが一つひとつ発行していたら、管理が非常に複雑で非効率です。",
      "そこでIEEEは、各ハードウェアメーカーに「OUI（組織固有識別子）」と呼ばれる24ビットのブロックを割り当てます。",
      "このOUIはメーカー固有の識別子で、どのメーカーが製造したかを示すものです。",
      "残りの24ビットは、そのメーカーが自由に設定できる部分で、主にシリアル番号のように順番に付与されます。",
      "これにより、各メーカーが数百万以上のMACアドレスを独自に割り当てることが可能になります。",
      "例えば、Intelが00:1A:2BというOUIを持っている場合、完全なMACアドレスは 00:1A:2B:3C:4D:5E のように構成されます。"
    ],
    "originalSlideText": "Adressierung (2)\n❑ Zentrale Vergabe für jede einzelne Netzwerkkarte (Network Controler Interface, NIC) wäre zu aufwendig\n❑ IEEE weist jedem Hersteller einen 3 Byte Block (24 Bit) zu → Organizationally Unique Identifier (OUI)\n❑ Hersteller für die letzten 3 Byte zuständig",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 17,
    "questionDe": "(s20) Was bedeuten die besonderen Bits in einer MAC-Adresse?",
    "questionJa": "MACアドレスに含まれる特別なビットにはどのような意味がありますか？",
    "answerDe": [
      "Ein Bit unterscheidet zwischen Unicast- und Multicast-Adressen.",
      "Ein weiteres Bit zeigt an, ob die Adresse global (von IEEE) oder lokal vergeben wurde.",
      "Multicast-Adressen ermöglichen 1:N-Kommunikation.",
      "Lokale Adressen können frei für Tests vergeben werden."
    ],
    "answerJa": [
      "1つのビットはユニキャストアドレスかマルチキャストアドレスかを示す。",
      "もう1つのビットは、そのアドレスがグローバル（IEEE発行）かローカル（任意設定）かを示す。",
      "マルチキャストアドレスは1対多通信を可能にする。",
      "ローカルアドレスは実験や限定的な環境で自由に設定可能である。"
    ],
    "explanationDe": [
      "MAC-Adressen enthalten neben den 48 Bit zur Adressierung auch zwei besondere Bits, die Zusatzinformationen über die Art der Adresse liefern.",
      "Das erste relevante Bit ist das sogenannte I/G-Bit (Individual/Group).",
      "Wenn dieses Bit 0 ist, handelt es sich um eine Unicast-Adresse, d. h. das Paket ist für genau ein Gerät bestimmt.",
      "Ist es hingegen 1, dann ist es eine Multicast-Adresse – das bedeutet, mehrere Geräte können das gleiche Paket empfangen (z. B. in Streaming-Anwendungen).",
      "Das zweite besondere Bit ist das U/L-Bit (Universally/Locally administered).",
      "Ist dieses Bit 0, wurde die Adresse von der IEEE zentral vergeben (global).",
      "Ist es 1, handelt es sich um eine lokal gesetzte Adresse – z. B. für Test- oder Simulationszwecke im lokalen Netzwerk, wo keine weltweite Eindeutigkeit erforderlich ist."
    ],
    "explanationJa": [
      "MACアドレスには48ビットの構成の中に、特別な意味を持つ2つのビットが含まれています。",
      "1つ目はI/Gビット（Individual/Group）と呼ばれ、ユニキャストかマルチキャストかを識別します。",
      "このビットが0の場合はユニキャスト（1対1通信）を表し、1の場合はマルチキャスト（1対多通信）を意味します。",
      "マルチキャストは例えば、動画ストリーミングなどで複数の受信者に同時配信するような用途で使用されます。",
      "2つ目はU/Lビット（Universally/Locally administered）で、アドレスがIEEEによって発行されたものか、それともローカルで任意に設定されたものかを示します。",
      "このビットが0ならグローバルアドレス（IEEEによる一意な割り当て）、1ならローカルアドレス（例えばテストや実験環境用）を示します。",
      "これらのビットにより、アドレスの種類や運用範囲を判別し、ネットワーク内の適切な運用が可能になります。"
    ],
    "originalSlideText": "Adressierung (3)\n❑ Zwei besondere Bits:\n Unicast oder Multicast: Multicast-Adressen ermöglichen 1:N Übertragungen\n Global oder Local: Globale Adressen werden von der IEEE vergeben, lokale können für Experimente selbst gesetzt werden",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 18,
    "questionDe": "(s21) Welche Adresstypen gibt es in LANs?",
    "questionJa": "LANにおけるアドレスの種類には何がありますか？",
    "answerDe": [
      "Unicast: Eindeutige Zuordnung zu einer Netzwerkkarte (NIC).",
      "Broadcast: Adresse für alle Geräte im LAN.",
      "Multicast: Adresse für eine Gruppe von NICs.",
      "Broadcast-Adresse bei IEEE: FF:FF:FF:FF:FF:FF.",
      "Broadcast ist ein Sonderfall von Multicast.",
      "Multicast und Broadcast sind effizient für Gruppentransfers."
    ],
    "answerJa": [
      "ユニキャスト：特定の1つのネットワークカード（NIC）に対応するアドレス。",
      "ブロードキャスト：LAN内すべての機器を宛先とするアドレス。",
      "マルチキャスト：特定のグループに属する複数のNICに対するアドレス。",
      "IEEEにおけるブロードキャストアドレスは FF:FF:FF:FF:FF:FF。",
      "ブロードキャストはマルチキャストの特殊な形とみなされる。",
      "マルチキャストとブロードキャストは、グループ通信において効率が良い。"
    ],
    "explanationDe": [
      "In LANs gibt es drei grundlegende Typen von Adressen: Unicast, Broadcast und Multicast.",
      "Unicast-Adressen sind eindeutig einer einzigen Netzwerkkarte (NIC) zugeordnet – sie ermöglichen gezielte 1:1-Kommunikation.",
      "Broadcast-Adressen richten sich an alle Teilnehmer im Netzwerk. Ein Gerät sendet ein Paket, das alle anderen Geräte empfangen und verarbeiten können.",
      "Die standardisierte Broadcast-Adresse im IEEE-Standard ist FF:FF:FF:FF:FF:FF – sie besteht vollständig aus Einsen.",
      "Multicast-Adressen sind an eine bestimmte Gruppe von Empfängern gerichtet. Nur Geräte, die zu dieser Gruppe gehören, verarbeiten die Pakete.",
      "Technisch betrachtet ist Broadcast ein Spezialfall von Multicast, bei dem alle Geräte zur Gruppe gehören.",
      "Sowohl Broadcast als auch Multicast ermöglichen eine effiziente Übertragung von Daten an mehrere Empfänger gleichzeitig – etwa bei Softwareverteilung oder Videostreaming."
    ],
    "explanationJa": [
      "LANにおいては、アドレスには主にユニキャスト、ブロードキャスト、マルチキャストの3種類があります。",
      "ユニキャストは、1つのネットワークカード（NIC）に対して一意に割り当てられ、1対1の通信に使用されます。",
      "ブロードキャストは、LAN内に存在するすべての機器にパケットを送信する方法で、誰に対しても届く通信です。",
      "IEEEにおけるブロードキャストアドレスは FF:FF:FF:FF:FF:FF で、全ビットが1になっています。",
      "マルチキャストは、特定のグループに属する複数の端末にのみ届くように設計されており、必要な端末だけがパケットを受信・処理します。",
      "技術的には、ブロードキャストはすべての端末が1つのグループに属しているという意味で、マルチキャストの特殊なケースと捉えられます。",
      "マルチキャストやブロードキャストは、ソフトウェア配布やビデオ配信など、同一データを多数に効率的に送信する際に特に有効です。"
    ],
    "originalSlideText": "Adresstypen\n❑ Unicast: Die Adresse wird eindeutig einer NIC zugeordnet\n❑ Broadcast: Spezielle Adresse, mit der Pakete an alle NICs im LAN geschickt werden können\n❑ Multicast: Adresse, die mehreren NICs zugeordnet ist → ein Paket kann an mehrere Rechner geschickt werden\n❑ IEEE verwendet als Broadcast Adresse FF:FF:FF:FF:FF:FF → alles 1, und somit auch das Multicast-Bit gesetzt → Broadcast ist ein Sonderfall vom Multicast\n❑ Multicast und Broadcast sind sehr effizient",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 19,
    "questionDe": "(s22) Was bedeutet „Framing“ in paketvermittelten Netzen?",
    "questionJa": "パケット交換ネットワークにおける「フレーミング」とは何を意味しますか？",
    "answerDe": [
      "Framing ergänzt die zu übertragenden Daten mit Metadaten wie Zieladresse oder Optionen.",
      "Es beschreibt die Struktur dieser Metadaten und deren Einbettung in die Nutzdaten.",
      "Sender und Empfänger verwenden dasselbe Framing-Protokoll.",
      "Jedes Frame entspricht einem Paket im Netzwerk."
    ],
    "answerJa": [
      "フレーミングでは、送信するデータに宛先アドレスやオプションなどのメタデータを付加する。",
      "そのメタデータの構成と、データへの付け方を定義するのがフレーミングである。",
      "送信側と受信側は同じフレーミングプロトコルを使用する。",
      "ネットワーク内では1つのフレームが1つのパケットに対応する。"
    ],
    "explanationDe": [
      "Framing ist ein grundlegendes Konzept in der Datenübertragung über paketvermittelte Netzwerke.",
      "Es beschreibt die Methode, wie zusätzliche Steuerinformationen – sogenannte Metadaten – zusammen mit den eigentlichen Nutzdaten übertragen werden.",
      "Diese Metadaten beinhalten z. B. die Zieladresse, Protokollinformationen oder Prüfsummen zur Fehlererkennung.",
      "Framing definiert dabei nicht nur den Inhalt, sondern auch die genaue Struktur dieser Daten sowie deren Position im Datenpaket.",
      "Ein Frame besteht üblicherweise aus einem Header mit den Metadaten und dem Payload mit den eigentlichen Nutzdaten.",
      "Sender und Empfänger müssen dasselbe Framing-Protokoll verwenden, damit sie die Daten korrekt kodieren bzw. dekodieren können.",
      "In einem paketvermittelten Netz entspricht jedes dieser Frames einem einzelnen Datenpaket, das unabhängig durch das Netzwerk transportiert wird."
    ],
    "explanationJa": [
      "フレーミングとは、パケット交換ネットワークにおいて、送信するデータに対して制御情報（メタデータ）を付加する手法を指します。",
      "メタデータには、宛先アドレス、プロトコルの種別、エラーチェック用の情報（チェックサム）などが含まれます。",
      "フレーミングでは、それらの情報がどのような構造で、どの順番で、どこに挿入されるかを明確に定めています。",
      "一般的にフレームは、ヘッダー（制御情報）とペイロード（実際のデータ）の2つの部分に分かれています。",
      "送信側と受信側の両者が同じフレーミングプロトコルを使用することで、データの正確な送受信が可能になります。",
      "このプロトコルが異なると、正しいデータの復元や解析ができなくなります。",
      "パケット交換ネットワークでは、各フレームが1つの独立したパケットとしてネットワーク上を流れる構造になっており、それぞれが個別に処理されます。"
    ],
    "originalSlideText": "Framing (1)\n❑ Zu übertragende Daten werden durch Meta-Daten ergänzt → Zieladresse, Optionen, …\n❑ Framing bezeichnet die Struktur dieser Metadaten und wie diese Metadaten den zu übertragenden Daten beigefügt werden\n❑ Sendern und Empfänger verwenden das gleiche Framing-Protokoll und können die Daten interpretieren\n❑ In Packet Switched Networks entspricht jedes Frame einem Paket",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 20,
    "questionDe": "(s23) Welche Struktur hat ein Frame?",
    "questionJa": "フレームの構造はどのようになっていますか？",
    "answerDe": [
      "Ein Frame besteht aus zwei Teilen: dem Header und dem Payload.",
      "Der Header enthält Metadaten wie Zieladresse und Protokollinformationen.",
      "Der Payload enthält die eigentlich zu übertragenden Daten.",
      "Meist beginnt das Frame mit dem Header, um Meta-Informationen früh zu verarbeiten.",
      "Oft werden feste Bitfolgen (Preludes) verwendet, um Anfang und Ende zu markieren."
    ],
    "answerJa": [
      "フレームはヘッダーとペイロードの2つの部分で構成されている。",
      "ヘッダーには宛先アドレスやプロトコル情報などのメタデータが含まれる。",
      "ペイロードは実際に送信されるデータ本体である。",
      "通常、フレームはヘッダーから始まり、メタ情報を先に処理できるようになっている。",
      "開始と終了を示すために固定のビット列（プレリュード）が使われることもある。"
    ],
    "explanationDe": [
      "Ein Daten-Frame ist die grundlegende Transportstruktur in paketvermittelten Netzwerken und besteht aus zwei Hauptkomponenten: dem Header und dem Payload.",
      "Der Header enthält notwendige Steuerinformationen, wie die MAC-Zieladresse, die Quelladresse, das Protokollfeld oder Prüfsummen zur Fehlererkennung.",
      "Diese Informationen ermöglichen dem Empfänger, das Paket korrekt zu interpretieren und weiterzuleiten oder zu verarbeiten.",
      "Der Payload enthält die eigentlichen Nutzdaten, also z. B. einen Teil einer Datei, E-Mail oder eines Videostreams.",
      "Üblicherweise beginnt das Frame mit dem Header, damit Netzwerkgeräte bereits während des Empfangs mit der Analyse der Steuerinformationen beginnen können.",
      "In vielen Protokollen wird zur Erkennung von Frame-Grenzen eine feste Bitfolge – sogenanntes Prelude – verwendet, um klar zu markieren, wann ein Frame beginnt.",
      "Dieses Verfahren erleichtert die Synchronisation zwischen Sender und Empfänger und erhöht die Übertragungssicherheit."
    ],
    "explanationJa": [
      "データリンク層で使われるフレームは、ネットワーク上でデータを送信するための基本単位であり、主にヘッダーとペイロードの2つの構成要素から成り立っています。",
      "ヘッダーには、宛先・送信元のMACアドレス、使用するプロトコルの情報、エラーチェック用の情報（チェックサムなど）が含まれており、通信の制御や識別に使われます。",
      "これにより受信側は、そのフレームが自分宛かどうかを判断し、どのように処理すべきかを決めることができます。",
      "ペイロードには実際の送信データ（文書の一部、音声、画像データなど）が格納されます。",
      "フレームは通常、ヘッダーから始まり、ネットワーク機器が受信途中でもヘッダー情報の解析を始められるようになっています。",
      "また、フレームの開始や終了を明確にするために、特定のビット列（プレリュード）を先頭や末尾に挿入することがあります。",
      "これにより、通信中にデータが乱れた場合でも、フレームの境界を正しく検出することが可能になります。"
    ],
    "originalSlideText": "Framing (2)\n❑ Jedes Frame besteht aus zwei Teilen\n Header mit den Metadaten\n Payload, die eigentlich zu übertragenden Daten\n• Beliebige Daten\n• Vom Netzwerk nicht interpretiert\n❑ Frame beginnt meist mit Header: Verarbeitung der Meta-Informationen bevor das ganze Frame empfangen wurde\n❑ Teilweise werden zur Erkennung von Beginn und Ende besondere Preludes eingesetzt → feste Bit-Folgen",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 21,
    "questionDe": "(s24) Was ist die Funktion von SOH und EOT?",
    "questionJa": "SOH（Start of Header）とEOT（End of Transmission）の役割は何ですか？",
    "answerDe": [
      "SOH und EOT sind spezielle Bytes zur Markierung von Frame-Grenzen.",
      "Sie helfen, den Beginn und das Ende eines Frames zuverlässig zu erkennen.",
      "Wird ein neues SOH vor dem EOT des vorherigen Frames empfangen, gilt dieses als fehlerhaft.",
      "Fehlerhafte Frames werden verworfen, um Übertragungsfehler zu vermeiden."
    ],
    "answerJa": [
      "SOHとEOTはフレームの境界を示すための特別なバイトである。",
      "これにより、フレームの開始と終了を正確に判別できる。",
      "前のフレームのEOTを受信する前に新たなSOHが現れた場合、そのフレームは破損していると見なされる。",
      "このような破損フレームは破棄され、誤ったデータ処理を防ぐ。"
    ],
    "explanationDe": [
      "In der Datenübertragung müssen Sender und Empfänger eindeutig erkennen können, wann ein Datenrahmen (Frame) beginnt und endet.",
      "Dazu verwendet man spezielle Steuerzeichen wie SOH (Start of Header) und EOT (End of Transmission).",
      "SOH markiert den Beginn eines neuen Frames, während EOT das Ende signalisiert.",
      "Diese Markierungen sind besonders wichtig bei fehleranfälligen Leitungen oder asynchronen Übertragungen, bei denen keine festen Zeitfenster existieren.",
      "Wenn ein Empfänger ein SOH empfängt, bevor das EOT des vorherigen Frames eingegangen ist, deutet dies auf einen Übertragungsfehler hin.",
      "Solche fehlerhaften Frames werden verworfen, um zu verhindern, dass inkonsistente oder beschädigte Daten weiterverarbeitet werden.",
      "Dieses Verfahren erhöht die Zuverlässigkeit und Integrität der Datenübertragung in paketvermittelten Netzen."
    ],
    "explanationJa": [
      "ネットワークにおけるデータの送受信では、送信されたフレームがどこから始まり、どこで終わるのかを明確に識別する必要があります。",
      "このために使われるのが、SOH（Start of Header：ヘッダー開始）とEOT（End of Transmission：伝送終了）という制御用の特別なバイトです。",
      "SOHはフレームの先頭を示し、EOTはその終端を示します。",
      "特に、通信エラーが発生しやすい環境や、タイミングがずれる可能性のある非同期通信においては、これらの記号がフレームの区切りを明示する重要な手がかりになります。",
      "たとえば、あるフレームのEOTを受信する前に次のSOHが届いた場合、それは前のフレームが途中で壊れてしまった可能性を示しています。",
      "このような場合、受信側はそのフレーム全体を破棄し、誤ったデータ処理が行われないようにします。",
      "このようなフレーム境界の検出機構によって、データ通信の信頼性と整合性が確保されます。"
    ],
    "originalSlideText": "Framing (3)\n❑ Start of Header (SOH) und End of Transmission (EOT) sind spezielle Bytes, die als Preludes eingesetzt werden\n❑ Verhindern Probleme bei Verbindungsfehlern:\n Wird ein SOH empfangen bevor das EOT des vorherigen Frames gelesen wurde, so ist das vorherige Frame fehlerhaft und muss verworfen werden",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 22,
    "questionDe": "(s25) Warum ist Byte Stuffing notwendig?",
    "questionJa": "なぜバイトスタッフィングが必要なのですか？",
    "answerDe": [
      "Reservierte Steuerzeichen wie SOH und EOT können im Payload vorkommen.",
      "Wenn diese unmaskiert übertragen werden, zerstören sie das Framing.",
      "Byte Stuffing maskiert solche Zeichen durch Escape-Sequenzen.",
      "Der Empfänger stellt die Originaldaten durch Rückumwandlung wieder her."
    ],
    "answerJa": [
      "SOHやEOTのような制御文字がペイロード内に現れる可能性があるため。",
      "それらがそのまま送信されるとフレーミングが崩れてしまう。",
      "バイトスタッフィングは、そうした特殊文字をエスケープシーケンスに変換して送る手法。",
      "受信側はエスケープシーケンスを元に戻すことで元のデータを復元する。"
    ],
    "explanationDe": [
      "In paketvermittelten Netzwerken wird die Struktur eines Frames oft durch spezielle Steuerzeichen wie SOH (Start of Header) und EOT (End of Transmission) definiert.",
      "Diese Zeichen dürfen eigentlich nur zur Markierung von Anfang und Ende verwendet werden – nicht jedoch als normale Nutzdaten.",
      "Da der Payload aber beliebige Daten enthalten kann, kann es vorkommen, dass zufällig ein SOH- oder EOT-Byte im Nutzdatenbereich auftaucht.",
      "Würde dieses Byte unverändert übertragen, würde der Empfänger fälschlicherweise annehmen, dass ein neues Frame beginnt oder endet – das Framing würde zusammenbrechen.",
      "Byte Stuffing löst dieses Problem, indem es solche reservierten Bytes maskiert, bevor sie über das Netzwerk gesendet werden.",
      "Dazu verwendet der Sender Escape-Sequenzen: z. B. wird ein SOH durch eine alternative Byte-Kombination ersetzt, die eindeutig erkennbar ist.",
      "Der Empfänger erkennt diese Escape-Sequenzen und ersetzt sie wieder durch das ursprüngliche Byte – so bleibt die Integrität des Datenstroms erhalten."
    ],
    "explanationJa": [
      "パケット交換ネットワークでは、フレームの構造を明示するためにSOH（ヘッダー開始）やEOT（伝送終了）といった特別な制御バイトが使われます。",
      "これらのバイトは、通常はフレームの開始や終了を示す目的で使用されるもので、データ本体（ペイロード）には現れないことが前提です。",
      "しかし、ペイロードには任意のバイナリデータが含まれるため、偶然にもSOHやEOTと同じバイト列が含まれてしまうことがあります。",
      "そのまま送信すると、受信側が誤ってフレームの開始や終了と誤認してしまい、データ全体の構造が崩れてしまいます。",
      "これを防ぐために用いられるのが「バイトスタッフィング」という手法です。",
      "送信側は、問題となるバイトを事前にエスケープシーケンスに置き換えて送信します（例：SOH → ESC + 特定コード）。",
      "受信側はそれを認識して元のデータに戻すことで、フレーム構造を崩すことなく正しくペイロードを復元できるようになります。"
    ],
    "originalSlideText": "Byte Stuffing (1)\n❑ SOH und EOT können natürlich auch im Payload enthalten sein\n Erinnerung: Payload darf beliebige Daten enthalten\n Würden das Framing zerstören, falls diese Fälle nicht gesondert behandelt werden\n❑ Solche reservierten Bytes im Payload werden bei der Übertragung maskiert → Byte Stuffing\n Sender manipuliert den Payload und ersetzt reservierte Bytes eineindeutig mit Escape Sequenzen\n Empfänger wandelt die Escape Sequenzen wieder in die ursprünglichen Bytes um",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 23,
    "questionDe": "(s26) Wie funktioniert Byte Stuffing? (Bild vorhanden)",
    "questionJa": "バイトスタッフィングはどのように機能しますか？（図あり）",
    "answerDe": [
      "Byte Stuffing ersetzt bestimmte Steuerzeichen im Payload durch Escape-Sequenzen.",
      "Dazu wird z. B. SOH in ESC + SOH umgewandelt.",
      "EOT wird in ESC + EOT umgewandelt.",
      "Das ESC-Zeichen selbst wird zu ESC + ESC.",
      "Der Empfänger erkennt und entfernt die Escape-Sequenzen, um die Originaldaten wiederherzustellen."
    ],
    "answerJa": [
      "バイトスタッフィングでは、ペイロード内の特定の制御文字をエスケープシーケンスに置き換える。",
      "例えば、SOHは ESC + SOH に変換される。",
      "EOT は ESC + EOT に変換される。",
      "ESC 文字そのものは ESC + ESC に変換される。",
      "受信側はエスケープシーケンスを識別し、元のデータに戻して処理する。"
    ],
    "explanationDe": [
      "Byte Stuffing ist eine Technik, mit der reservierte Steuerzeichen wie SOH, EOT oder ESC im Nutzdatenbereich ersetzt werden, um Framing-Verstöße zu vermeiden.",
      "Dazu verwendet der Sender sogenannte Escape-Sequenzen: Er fügt vor jedem reservierten Byte ein spezielles Escape-Zeichen (ESC) ein.",
      "So wird z. B. ein SOH im Payload zu ESC + SOH, ein EOT zu ESC + EOT, und ein ESC zu ESC + ESC.",
      "Der Empfänger liest die Bytes beim Empfang aus und erkennt anhand des ESC-Zeichens, dass das nächste Byte Teil einer Escape-Sequenz ist.",
      "Daraufhin ersetzt er die Kombination wieder durch das ursprüngliche Zeichen, sodass die ursprünglichen Nutzdaten rekonstruiert werden können.",
      "Diese Methode ist einfach und effektiv, da sie auf beliebige Bitfolgen im Payload reagieren kann, ohne das Framing zu gefährden.",
      "Das im Bild gezeigte Beispiel zeigt eine Byte-Folge vor und nach dem Stuffing – dabei ist deutlich erkennbar, wie spezielle Bytes systematisch ersetzt werden."
    ],
    "explanationJa": [
      "バイトスタッフィングは、SOH（開始）やEOT（終了）、ESC（エスケープ）などの特殊な制御文字がペイロード内に含まれることによって、フレーミングが誤って処理されるのを防ぐための技術です。",
      "送信側は、問題のあるバイトが出現した際、それを特別な「エスケープシーケンス」に置き換えます。",
      "具体的には、SOH → ESC + SOH、EOT → ESC + EOT、ESC → ESC + ESC というように変換されます。",
      "受信側は、ESCというバイトを検出した時に、次のバイトを組み合わせて判断し、元の制御文字に戻す処理を行います。",
      "これにより、ペイロードの内容がどれだけ複雑でも、フレーミングと干渉せずに安全に伝送できます。",
      "変換は可逆的であるため、データの整合性も損なわれません。",
      "スライドの図には、バイトスタッフィング前後のバイト列が例として示されており、どのように制御バイトが置き換わっているかが視覚的に理解できます。"
    ],
    "originalSlideText": "Byte Stuffing (2)\n❑ Beispiel für Byte Stuffing\n❑ Ersetzungstablelle:\n❑ Ergebnis:",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 24,
    "questionDe": "(s28) Welche drei Protokollklassen für Medienzugriff gibt es?",
    "questionJa": "メディアアクセス制御のプロトコルにはどの3種類がありますか？",
    "answerDe": [
      "Controlled Access Protokolle: Der Zugriff erfolgt über ein zentrales Steuerverfahren, z. B. Token-Passing.",
      "Random Access Protokolle: Jeder Teilnehmer darf jederzeit senden, z. B. Ethernet, WLAN.",
      "Channelization Protokolle: Der Kanal wird in Zeit-, Frequenz- oder Codebereiche aufgeteilt, z. B. TDMA, FDMA."
    ],
    "answerJa": [
      "コントロールドアクセスプロトコル：中央制御方式で、例えばトークンパッシングがある。",
      "ランダムアクセスプロトコル：各端末が任意のタイミングで送信する方式（例：Ethernet、WLAN）。",
      "チャネライズプロトコル：時間、周波数、コードでチャネルを分割する方式（例：TDMA、FDMA）。"
    ],
    "explanationDe": [
      "Wenn mehrere Geräte sich ein gemeinsames Übertragungsmedium teilen, muss geregelt werden, wer wann senden darf – dies ist Aufgabe des Medienzugriffsprotokolls.",
      "Controlled Access Protokolle verwenden ein zentrales Steuerungssystem: Zum Beispiel wird ein Token weitergereicht, das dem Besitzer exklusiven Zugriff auf das Medium erlaubt.",
      "Dieses Verfahren verhindert Kollisionen und garantiert eine gewisse Ordnung – häufig eingesetzt in Ring-Topologien.",
      "Random Access Protokolle erlauben es jedem Gerät, jederzeit zu senden – Kollisionen sind möglich, aber Mechanismen wie CSMA/CD (bei Ethernet) oder CSMA/CA (bei WLAN) helfen, diese zu erkennen oder zu vermeiden.",
      "Diese Protokolle sind flexibel und effizient bei geringer Netzauslastung, zeigen aber Schwächen bei hoher Last.",
      "Channelization Protokolle teilen das Medium in unabhängige Kanäle auf – entweder zeitlich (TDMA), frequenzmäßig (FDMA) oder per Codierung (CDMA).",
      "Diese Methode bietet strukturierte Zugriffsmöglichkeiten, wird aber meist in Mobilfunknetzen oder speziellen Umgebungen eingesetzt."
    ],
    "explanationJa": [
      "複数の端末が1つの通信路（メディア）を共有する場合、どの端末がいつ送信できるかを制御する必要があります。これを行うのがメディアアクセス制御プロトコルです。",
      "コントロールドアクセス方式は、中央で制御を行い、例えば「トークンパッシング」のように、送信権を順番に回す仕組みがあります。衝突が起きず、予測可能な通信が可能です。",
      "ランダムアクセス方式では、各端末が自由なタイミングで送信を試みます。衝突（コリジョン）は発生しますが、イーサネットで使われるCSMA/CDや、無線LANでのCSMA/CAによって制御されます。",
      "この方式は柔軟で、小規模ネットワークや低負荷時には効率的ですが、通信が混雑すると性能が低下します。",
      "チャネライズ方式は、通信路をあらかじめ時間（TDMA）、周波数（FDMA）、またはコード（CDMA）で分割しておき、各端末がそれぞれのチャネルを使うことで衝突を避けます。",
      "この方式は構造化されていて、モバイルネットワークやリアルタイム性が求められる通信に適しています。",
      "それぞれの方式は、用途やネットワーク環境に応じて使い分けられています。"
    ],
    "originalSlideText": "Medienzugriff (1)\n❑ Protokoll-Klassen zur Steuerung des Zugriffs auf das geteilte Medium (z.B. Kupferkabel)\n Controlled Access Protokolle\n• Global gesteuerter Zugriff z.B. über ein Token, dass herumgereicht wird, und die Zugriff auf das Medium gestattet\n Random Access Protokolle\n• Jeder Netzteilnehmer kann zu jedem Zeitpunkt senden\n• Um Kollisionen zu vermeiden wird auf dem Kanal gelauscht und nach laufenden Übertragungen gesucht\n• Ethernet, WLAN\n Channelization Protokolle\n• Aufteilung des Kanals z.B. nach Zeit (TDMA) oder Frequenz (FDMA)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 25,
    "questionDe": "(s29) Was sind die Herausforderungen beim Medienzugriff?",
    "questionJa": "メディアアクセス制御における主な課題は何ですか？",
    "answerDe": [
      "Kollisionen zwischen gleichzeitig sendenden Geräten.",
      "Gleichzeitiger Zugriff auf das gemeinsame Medium muss koordiniert werden.",
      "Effizienzverlust bei hoher Netzauslastung.",
      "Notwendigkeit, faire Zugriffsmechanismen zu entwickeln."
    ],
    "answerJa": [
      "複数の端末が同時に送信することで衝突（コリジョン）が発生する。",
      "共有メディアへの同時アクセスを適切に調整する必要がある。",
      "ネットワークが混雑すると効率が低下する。",
      "公平に通信機会を分配する制御方式が求められる。"
    ],
    "explanationDe": [
      "Beim Medienzugriff in geteilten Netzwerken steht man vor der Herausforderung, dass mehrere Geräte gleichzeitig senden möchten.",
      "Wenn zwei oder mehr Stationen zur gleichen Zeit senden, kommt es zu sogenannten Kollisionen – die übertragenen Datenpakete stören sich gegenseitig und gehen verloren.",
      "Um dies zu verhindern, müssen Protokolle implementiert werden, die den Zugriff koordinieren – entweder durch zentrale Steuerung, Zeitplanung oder dezentrale Absprachen.",
      "Eine weitere Schwierigkeit ist die Skalierbarkeit: Ein Protokoll, das in einem kleinen Netzwerk funktioniert, kann bei hoher Last ineffizient werden.",
      "Dazu kommt die Anforderung, den Zugriff fair zu gestalten – also zu vermeiden, dass manche Geräte ständig bevorzugt behandelt werden, während andere warten müssen.",
      "Gerade bei drahtlosen Netzwerken verschärfen sich diese Probleme, da Signale nicht immer vollständig wahrgenommen werden (z. B. Hidden Terminal).",
      "Somit ist der Medienzugriff ein zentrales und komplexes Thema bei der Netzwerkkonstruktion und -optimierung."
    ],
    "explanationJa": [
      "メディアアクセス制御では、複数の端末が同時に共有された通信路を使おうとするため、いくつかの重要な課題が発生します。",
      "最も代表的な問題は、複数の端末が同時にデータを送信した場合に発生する「衝突（コリジョン）」です。これによりデータが破損し、再送が必要になります。",
      "このような衝突を防ぐために、送信タイミングや順番を調整する仕組みが必要です。これには、中央集権的な制御、時刻の割り当て、または分散型の合意メカニズムなどが使われます。",
      "また、ネットワークに接続する端末数が増えると、アクセスの調整が難しくなり、プロトコルの効率が低下してしまうことがあります。",
      "公平性も重要な課題で、特定の端末が優先され続けたり、他の端末が長時間通信できない状態になるのは避けるべきです。",
      "特に無線ネットワークでは、互いの信号が届きにくい「隠れ端末問題」など、さらに複雑な制御が求められます。",
      "このように、メディアアクセス制御はネットワーク設計の根幹をなす重要な要素であり、環境に応じた工夫が必要となります。"
    ],
    "originalSlideText": "Medienzugriff (2)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 26,
    "questionDe": "(s30) Wie funktioniert Channelization?",
    "questionJa": "チャネライズ（Channelization）はどのように機能しますか？",
    "answerDe": [
      "Channelization reserviert bestimmte Teile des Mediums für einzelne Verbindungen.",
      "Es gibt zwei Hauptformen: statische und dynamische Kanalzuweisung.",
      "Statische Zuweisung nutzt feste Frequenzen, Codes oder Zeitblöcke.",
      "Dynamische Zuweisung passt sich veränderten Bedingungen an, z. B. wenn Geräte das Netz betreten oder verlassen."
    ],
    "answerJa": [
      "チャネライズでは、通信メディアの一部を特定の通信に予約する。",
      "主に静的割当と動的割当の2種類がある。",
      "静的割当では、周波数・コード・時間枠が固定されている。",
      "動的割当では、端末の出入りに応じてチャネルが柔軟に割り当てられる。"
    ],
    "explanationDe": [
      "Channelization bezeichnet Verfahren, mit denen ein gemeinsames Übertragungsmedium in mehrere unabhängige Kanäle unterteilt wird.",
      "Jeder dieser Kanäle kann dann einer Verbindung oder einem Teilnehmer exklusiv zugewiesen werden.",
      "Die Unterteilung kann auf verschiedene Arten erfolgen: nach Zeit (TDMA), Frequenz (FDMA) oder Code (CDMA).",
      "Bei statischer Kanalzuweisung werden die Ressourcen (z. B. eine bestimmte Frequenz) fest einem Teilnehmer zugeordnet – unabhängig davon, ob er sie nutzt.",
      "Das ist einfach, aber ineffizient, wenn wenige Teilnehmer aktiv sind.",
      "Dynamische Kanalzuweisung ist flexibler: Sie erkennt, welche Teilnehmer aktiv sind, und verteilt Kanäle nach Bedarf.",
      "Ein typisches Beispiel ist das Mobilfunknetz, wo Geräte jederzeit ein- oder austreten können – Channelization sorgt dafür, dass alle Teilnehmer effizient bedient werden können."
    ],
    "explanationJa": [
      "チャネライズ（Channelization）とは、1つの通信メディア（回線や周波数帯）を複数の独立したチャネルに分割して使用する方法です。",
      "各チャネルは、個別の通信または端末に割り当てられ、干渉なく通信が可能になります。",
      "チャネルの分割には、時間（TDMA）、周波数（FDMA）、コード（CDMA）などの手法があります。",
      "静的チャネル割当では、あらかじめ決められた周波数や時間枠などが特定の端末に割り当てられ、利用状況に関係なくその枠が保持されます。",
      "これは実装が簡単な反面、未使用のリソースが発生しやすく非効率です。",
      "一方、動的チャネル割当では、ネットワークの状態や端末の出入りに応じてチャネルを柔軟に再割当てすることができます。",
      "例えば、携帯電話ネットワークでは、利用者が基地局に入ったり出たりするたびにチャネルが自動的に調整され、通信効率が最大化されます。"
    ],
    "originalSlideText": "Channelization (1)\n❑ Multiplexing Techniken: Welcher Teil des geteilten Mediums wird für eine spezielle Verbindung reserviert\n❑ Static Channel Allocation: Feste Zuordnung von Frequenzen, Codes, Zeitabschnitten\n❑ Dynamic Channel Allocation: On Demand Zuweisung von Ressourcen zu einer Verbindung\n Rechner betreten und verlassen das Netz\n Z.B. Mobilfunk",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 27,
    "questionDe": "(s31) Wie unterscheiden sich FDMA, TDMA und CDMA? (Bild vorhanden)",
    "questionJa": "FDMA、TDMA、CDMAはどのように異なりますか？（図あり）",
    "answerDe": [
      "FDMA: Jeder Teilnehmer erhält eine eigene Frequenz.",
      "TDMA: Der Kanal wird in Zeitblöcke aufgeteilt, jeder Teilnehmer sendet in einem festen Zeitfenster.",
      "CDMA: Daten werden mit einem eindeutigen Code umkodiert, alle Teilnehmer senden gleichzeitig auf demselben Kanal.",
      "FDMA und TDMA sind meist zentral gesteuert.",
      "CDMA erlaubt gleichzeitige Übertragungen ohne Interferenz dank Code-Trennung."
    ],
    "answerJa": [
      "FDMA：各端末に固有の周波数を割り当てる。",
      "TDMA：通信チャネルを時間ごとのスロットに分け、各端末が決められた時間枠に送信する。",
      "CDMA：各端末のデータに固有のコードを割り当てて同時送信する方式。",
      "FDMAとTDMAは通常中央制御型である。",
      "CDMAはコード分離によって干渉を避けつつ同時送信が可能。"
    ],
    "explanationDe": [
      "Die drei Channelization-Methoden unterscheiden sich darin, wie das Übertragungsmedium unter mehreren Teilnehmern aufgeteilt wird.",
      "FDMA (Frequency Division Multiple Access) weist jedem Gerät eine eigene Frequenz zu. Die Trennung erfolgt über verschiedene Frequenzbereiche. Ein zentraler Kanal koordiniert die Zuweisung.",
      "TDMA (Time Division Multiple Access) teilt die Übertragungszeit in Zeitblöcke ein. Jeder Teilnehmer bekommt ein Zeitfenster und darf nur in diesem Block senden. Der Ablauf erfolgt z. B. in zyklischer Reihenfolge: 1, 2, 3, 4, 1, 2, 3, 4 …",
      "Wenn ein Teilnehmer nichts sendet, bleibt sein Zeitfenster ungenutzt – das kann zu Ineffizienz führen.",
      "CDMA (Code Division Multiple Access) ist ein fortschrittliches Verfahren, bei dem alle Teilnehmer gleichzeitig auf demselben Frequenzbereich senden, aber ihre Daten mit unterschiedlichen, eindeutigen Chipping-Codes verschlüsseln.",
      "Der Empfänger kennt den Code des Senders und kann das Signal trotz gleichzeitiger Übertragungen korrekt extrahieren.",
      "CDMA wird u. a. in Mobilfunknetzen wie UMTS verwendet, da es robust gegen Störungen ist und eine hohe Auslastung des Mediums ermöglicht."
    ],
    "explanationJa": [
      "FDMA、TDMA、CDMAは、複数の端末が1つの通信媒体を効率的に共有するための異なる方式です。",
      "FDMA（周波数分割多重アクセス）は、各端末に個別の周波数を割り当てる方式で、帯域を物理的に分けて同時通信を実現します。制御は通常、中央の装置によって行われます。",
      "TDMA（時間分割多重アクセス）は、通信を時間単位に分割し、各端末が決められた時間枠にのみ送信できるようにする方式です。例えば4つの端末が順番に「1→2→3→4→1…」という順で通信します。",
      "TDMAでは、ある端末が送信しない場合、その時間枠は無駄になるため、効率が下がることがあります。",
      "CDMA（符号分割多重アクセス）は、すべての端末が同じ時間・周波数帯を使用して同時に送信しますが、それぞれに固有のコード（チッピングコード）を付けてデータを変換することで、識別と分離が可能になります。",
      "受信側は対応するコードを用いることで、自分宛のデータを抽出できます。複数の送信が重なっても干渉しにくいという利点があります。",
      "CDMAは携帯電話ネットワーク（例：UMTS）でも使われ、同時接続数が多くても安定した通信を提供できます。"
    ],
    "originalSlideText": "Channelization (2)\n❑ Frequency Division Multiple Access (FDMA)\n Üblicherweise zentral gesteuert\n Jede Netzteilnehmer erhält seine eigene Frequenz\n Reservierter Kontrollkanal zur Aushandlung der Frequenz\n❑ Time Division Multiple Access (TDMA)\n Aufteilung des Kanals in Zeitblöcke fester Größe\n Jeder Teilnehmer darf nur in seinem Block senden\n Z.B. 4 Teilnehmer senden in der Reihenfolge 1 2 3 4 1 2 3 4 …\n Überträgt ein Teilnehmer nichts bleibt der Zeitblock leer\n❑ Code Division Multiple Access (CDMA)\n Umcodierung der Nutzdaten mittels Chipping Codes\n Ein Code pro Teilnehmer\n Gleichzeitige Übertragung ohne Interferenz möglich",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 28,
    "questionDe": "(s32) Was sind Beispiele für Controlled Access Protokolle?",
    "questionJa": "コントロールドアクセス方式にはどのような例がありますか？",
    "answerDe": [
      "Polling: Zentrale Einheit fragt Teilnehmer nacheinander ab (z. B. Round Robin oder Priorität).",
      "Reservation: Teilnehmer reservieren ein Übertragungsfenster bei der Zentraleinheit.",
      "Token Passing: Nur der Teilnehmer mit dem Token darf senden.",
      "Token wird im Netz herumgereicht, typischerweise bei Ring-Topologie."
    ],
    "answerJa": [
      "ポーリング方式：中央装置が端末を順に呼び出して送信を許可する（例：ラウンドロビンや優先順位制）。",
      "リザベーション方式：端末が送信枠を事前に中央に予約する。",
      "トークンパッシング方式：トークンを持つ端末だけが送信できる。",
      "トークンはネットワーク内を循環し、特にリング型トポロジーでよく用いられる。"
    ],
    "explanationDe": [
      "Controlled Access Protokolle regeln den Zugriff auf das gemeinsame Übertragungsmedium über ein zentrales oder koordiniertes Verfahren, wodurch Kollisionen vermieden werden.",
      "Beim Polling fragt eine zentrale Steuerungseinheit zyklisch oder nach Priorität jeden Netzteilnehmer, ob er senden möchte. Dadurch ist der Zugriff geordnet, aber es entsteht Verwaltungsaufwand.",
      "Beim Reservation-Verfahren senden Teilnehmer zunächst eine Anfrage (Request) an die Zentrale. Diese weist dann per Broadcast eine Sendezeit zu – effizient bei hoher Last.",
      "Token Passing basiert auf einem virtuellen 'Token', das von Station zu Station weitergegeben wird. Nur der Besitzer des Tokens darf Daten senden.",
      "Dieses Verfahren funktioniert besonders gut in Netzwerken mit Ring-Topologie, da dort die Reihenfolge klar definiert ist.",
      "Ein Vorteil aller Controlled Access Verfahren ist, dass sie Kollisionen nahezu vollständig ausschließen – im Gegensatz zu Random Access.",
      "Nachteilig ist der Verwaltungsaufwand und die Komplexität der Implementierung, besonders bei dynamisch wachsenden Netzwerken."
    ],
    "explanationJa": [
      "コントロールドアクセス方式は、複数の端末が同時に通信することによる衝突（コリジョン）を防ぐために、中央制御や分散制御によって通信権を管理する方式です。",
      "ポーリング方式では、中央の制御装置が各端末に順番または優先順位に従って「今、送信しますか？」と問い合わせ、送信を許可します。確実な順序制御が可能ですが、制御オーバーヘッドがかかります。",
      "リザベーション方式では、端末が事前に「送信したい」と申請し、中央装置が全体に向けて送信時間を割り当てます。混雑時に効率がよい方式です。",
      "トークンパッシング方式では、ネットワーク内を循環する「トークン（伝票）」を持つ端末だけが送信できます。送信後はトークンを次の端末に渡します。",
      "この方式はリング型トポロジーと非常に相性がよく、順序が自然に保たれるという特性があります。",
      "これらの方式の最大の利点は、衝突をほぼ完全に防げることです。一方で、制御機構の実装が複雑で、ネットワークの動的な変化に対応しづらいという欠点もあります。",
      "そのため、小規模ネットワークや特定のトポロジーにおいて採用されることが多いです。"
    ],
    "originalSlideText": "Controlled Access\n❑ Polling\n Zentrale Einheit kontaktiert immer wieder Netzteilnehmer und bieten ihnen ein Übertragungsfenster an um Daten zu übertragen\n Reihenfolge nach Round Robin oder Priorität\n❑ Reservation\n Netzteilnehmer senden einen Request zur zentralen Einheit und reservieren damit Übertragungsfensters\n Zentrale Einheit teilt per Broadcast die Sendereihenfolge mit\n❑ Token Passing\n Wer den Token besitzt darf senden\n Ein Token im Netz (rein virtuell, über Nachrichten geregelt)\n Token wird herum gereicht (daher häufig bei Ring Topologie)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 29,
    "questionDe": "(s33) Was kennzeichnet Random Access?",
    "questionJa": "ランダムアクセス方式にはどのような特徴がありますか？",
    "answerDe": [
      "Keine zentrale Einheit zur Steuerung des Zugriffs.",
      "Zugriff erfolgt scheinbar unkoordiniert.",
      "Kanal wird nur bei tatsächlichem Bedarf genutzt.",
      "Zufällige Wartezeiten helfen, Kollisionen zu vermeiden.",
      "LANs verwenden meist Random Access."
    ],
    "answerJa": [
      "アクセス制御のための中央装置が存在しない。",
      "アクセスは一見すると無秩序である。",
      "通信は必要なときだけ行われ、チャネルは共有されている。",
      "衝突を避けるために、端末はランダムな待機時間を取る。",
      "LANではこの方式が一般的に使われている。"
    ],
    "explanationDe": [
      "Random Access Protokolle erlauben es allen Teilnehmern, das Übertragungsmedium jederzeit zu nutzen – es gibt keine zentrale Steuerinstanz.",
      "Der Zugriff erscheint dadurch unkoordiniert, was bei hoher Auslastung zu Kollisionen führen kann.",
      "Tatsächlich wird das Medium nur genutzt, wenn ein Gerät Daten zu senden hat – das macht Random Access besonders effizient bei geringer Netzauslastung.",
      "Um Kollisionen zu minimieren, werden Mechanismen wie zufällige Wartezeiten eingeführt: Geräte warten nach einer Kollision eine zufällig gewählte Zeit, bevor sie erneut senden.",
      "Diese Zufälligkeit reduziert die Wahrscheinlichkeit, dass zwei Geräte zur selben Zeit erneut senden.",
      "Ein bekanntes Beispiel für ein Random-Access-Verfahren ist CSMA/CD, wie es in klassischen Ethernet-Netzen verwendet wird.",
      "Auch WLAN basiert auf einem verwandten Konzept, wobei dort andere Techniken zur Kollisionserkennung und -vermeidung eingesetzt werden (z. B. CSMA/CA)."
    ],
    "explanationJa": [
      "ランダムアクセス方式では、全ての端末が任意のタイミングで通信メディアにアクセスできる仕組みになっており、中央での制御装置は存在しません。",
      "そのため、アクセスの順番が事前に調整されていないため、一見すると無秩序に見えますが、柔軟性と即時性に優れています。",
      "端末は、送信したいときにだけ通信を試みるため、ネットワークの使用効率が良く、特に利用頻度が低いネットワーク環境に適しています。",
      "ただし、複数の端末が同時に送信すると、データが衝突して破損するリスクがあります。",
      "このため、衝突後には一定のランダムな待機時間を置いて再送信を試みる仕組みが導入されており、これにより再度の衝突確率が低下します。",
      "代表的な例としては、イーサネットで使われるCSMA/CD（搬送波感知多重アクセス／衝突検出）があります。",
      "また、無線LANではCSMA/CA（衝突回避）が採用されており、無線特有の課題にも対応しています。"
    ],
    "originalSlideText": "Random Access\n❑ Keine zentrale Einheit zur Steuerung des Zugriffs\n Scheinbar unkoordiniert\n❑ LANs verwenden meist Random Access\n❑ Der Kanal wird nur dann genutzt, wenn ein Netzteilnehmer tatsächlich ein Paket übertragen möchte → Random\n❑ Zufällige Wartezeiten lösen Kollisionen auf (keine garantierte Auflösung, aber praktisch sehr effektiv)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 30,
    "questionDe": "(s34) Wie war das ursprüngliche ALOHA-Netz aufgebaut?",
    "questionJa": "初期のALOHAネットワークはどのように構成されていましたか？",
    "answerDe": [
      "ALOHA war ein frühes Netz in Hawaii.",
      "Es war ein Vorreiter für Random Access Protokolle.",
      "Ein zentraler, leistungsstarker Transceiver kommunizierte mit allen Teilnehmern.",
      "Teilnehmer hatten schwächere Transceiver, konnten aber die zentrale Einheit erreichen.",
      "Verwendete zwei unterschiedliche Frequenzen für Inbound und Outbound."
    ],
    "answerJa": [
      "ALOHAはハワイで開発された初期のネットワークである。",
      "ランダムアクセス方式の先駆けとなったプロトコルである。",
      "強力な中央送受信機が全参加者と通信していた。",
      "参加端末は弱い送受信機を持っていたが、中央装置には通信できた。",
      "送信と受信で異なる2つの周波数が使われていた。"
    ],
    "explanationDe": [
      "ALOHA war eines der ersten Computernetzwerke, das in den 1970er Jahren an der Universität von Hawaii entwickelt wurde.",
      "Es diente dazu, Computer auf verschiedenen Inseln miteinander zu verbinden – eine besondere Herausforderung in einer geografisch verstreuten Umgebung.",
      "Im Zentrum stand ein starker Transceiver (Sender/Empfänger), der Nachrichten an alle Teilnehmer aussenden konnte.",
      "Jede Teilnehmerstation verfügte über einen einfacheren Transceiver, konnte aber Daten zur zentralen Einheit senden.",
      "Das Netz nutzte zwei unterschiedliche Frequenzen: Eine für eingehende Nachrichten (Inbound: 407,305 MHz) und eine für ausgehende Nachrichten (Outbound: 413,475 MHz).",
      "Diese Aufteilung erlaubte eine einfache Duplex-Kommunikation, da Senden und Empfangen gleichzeitig möglich war.",
      "Das ALOHA-Netz war die Grundlage für spätere Random-Access-Techniken wie Ethernet, und viele heutige Protokolle greifen auf Prinzipien dieses Systems zurück."
    ],
    "explanationJa": [
      "ALOHAは1970年代にハワイ大学で開発された、世界初の無線パケット通信ネットワークの1つです。",
      "島々に分散する複数のコンピュータを接続する目的で設計され、地理的に隔たった環境における通信の可能性を探るものでした。",
      "ネットワークの中心には、全参加者に向けてメッセージを送信できる高出力の中央送受信機が設置されていました。",
      "各参加端末は比較的弱い送受信機を持っていましたが、中央装置に向けての送信は可能でした。",
      "ALOHAは、双方向通信を可能にするために、送信用（アウトバウンド）と受信用（インバウンド）で異なる周波数帯（413.475 MHz と 407.305 MHz）を使用していました。",
      "このシンプルな構成により、基本的な無線通信の仕組みが実証され、後のイーサネットや無線LANのプロトコル開発に大きな影響を与えました。",
      "ALOHAはランダムアクセス通信の原型であり、今日のネットワーク理論においても重要な概念を提供しています。"
    ],
    "originalSlideText": "ALOHA (1)\n❑ Sehr frühes Netz in Hawaii\n Vorreiter für Random Access Protokolle\n❑ Zentraler, leistungsstarker Transceiver erreicht alle Teilnehmer\n❑ Netzteilnehmer besitzen schwächere Transceiver, können aber alle die zentrale Einheit erreichen\n❑ Outbound Nachrichten auf Frequenz 413,475 MHz, Inbound auf 407,305 MHz",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 31,
    "questionDe": "(s35) Wie funktioniert ALOHA mit implizitem Acknowledgement?",
    "questionJa": "ALOHA方式では、どのように暗黙的な確認応答（ACK）が行われますか？",
    "answerDe": [
      "Nachrichten werden vom zentralen Transceiver an alle weitergeleitet.",
      "Wenn ein Teilnehmer seine eigene Nachricht auf dem Outbound-Kanal empfängt, gilt dies als Bestätigung.",
      "Dies wird als implizites Acknowledgement bezeichnet.",
      "Fehlt diese Rückmeldung, geht der Sender von einem Fehler aus."
    ],
    "answerJa": [
      "送信されたメッセージは中央装置によってすべての端末に中継される。",
      "送信者が自分のメッセージをアウトバウンドチャネルで再受信すると、それが確認応答と見なされる。",
      "この仕組みは暗黙的ACK（確認応答）と呼ばれる。",
      "この応答が得られない場合、送信失敗と判断される。"
    ],
    "explanationDe": [
      "Im ALOHA-Netz sendet ein Teilnehmer seine Nachricht zunächst an den zentralen Transceiver.",
      "Der Transceiver leitet diese Nachricht auf dem Outbound-Kanal weiter und strahlt sie erneut an alle Teilnehmer aus.",
      "Der ursprüngliche Sender hört auf dem Outbound-Kanal mit und prüft, ob seine eigene Nachricht zurückgesendet wurde.",
      "Wenn er sie korrekt empfängt, nimmt er an, dass die Nachricht erfolgreich übertragen wurde – dies ist das sogenannte implizite Acknowledgement.",
      "Es wird also keine separate Bestätigung versendet, sondern die Rückmeldung erfolgt durch die Repräsentation der eigenen Nachricht im Downlink.",
      "Falls der Sender keine Kopie seiner Nachricht empfängt, geht er davon aus, dass eine Kollision oder ein anderer Übertragungsfehler aufgetreten ist.",
      "Dieses Verfahren ist einfach, spart Protokollaufwand, kann aber bei hoher Netzlast zu Unsicherheiten führen, z. B. wenn eine Nachricht gar nicht ausgestrahlt wird."
    ],
    "explanationJa": [
      "ALOHAネットワークでは、端末がメッセージを送信すると、それは中央の送受信装置（トランシーバ）に届きます。",
      "中央装置はそのメッセージを全ての端末に向けて再送信します（アウトバウンドチャネル）。",
      "送信元の端末はアウトバウンドチャネルを受信し、自分が送ったメッセージが再送信されていれば、それを確認応答（ACK）と見なします。",
      "これは、明示的な「ACK」メッセージを返さずに確認を行う「暗黙的ACK（implicit Acknowledgement）」の仕組みです。",
      "つまり、メッセージ自体が正しく送られ、再び受信できたことで成功を確認する方式です。",
      "もし自分のメッセージが再送信されない場合、送信失敗（例：コリジョンによるデータ消失）と判断され、再送が必要となります。",
      "この仕組みはシンプルで制御負荷が少ない反面、通信が混雑している場合には信頼性がやや低くなる可能性があります。"
    ],
    "originalSlideText": "ALOHA (2)\n❑ Nachrichten von einem Teilnehmer zum nächsten werden von der zentralen Einheit relayed\n❑ Implizites Acknowledgement (Paket Bestätigung): \nEmpfängt der Sender des ursprünglichen Paketes die Kopie auf dem Outbound Channel, geht er vom Erfolg der Übertragung aus",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 32,
    "questionDe": "(s36) Was passiert bei einer Kollision im ALOHA-System?",
    "questionJa": "ALOHA方式では衝突が発生するとどうなりますか？",
    "answerDe": [
      "Wenn zwei Teilnehmer gleichzeitig senden, kollidieren die Pakete.",
      "Alle betroffenen Pakete gehen verloren.",
      "Keiner der Teilnehmer erhält ein Acknowledgement.",
      "Beide senden ihre Nachricht nach einem Timeout erneut.",
      "Der Zeitpunkt der Wiederholung wird zufällig gewählt, um erneute Kollisionen zu minimieren."
    ],
    "answerJa": [
      "2つの端末が同時に送信するとパケットが衝突する。",
      "衝突したすべてのパケットは失われる。",
      "いずれの端末も確認応答を受け取れない。",
      "一定時間後に両者は再送信を試みる。",
      "再送信のタイミングはランダムに選ばれ、再度の衝突を避けるための工夫がされている。"
    ],
    "explanationDe": [
      "Im ALOHA-System ist es möglich, dass mehrere Teilnehmer gleichzeitig auf dem Inbound-Kanal senden.",
      "Wenn das geschieht, überlagern sich die Signale – eine sogenannte Kollision tritt ein.",
      "Da keine spezielle Kollisionserkennung implementiert ist, merkt das System den Fehler erst daran, dass kein Acknowledgement (in Form der Rückübertragung) empfangen wird.",
      "Die betroffenen Teilnehmer gehen dann davon aus, dass ihre Nachrichten nicht angekommen sind.",
      "Nach einem sogenannten Timeout – einer kurzen Wartezeit – versuchen sie erneut zu senden.",
      "Damit nicht erneut eine Kollision eintritt, wählen die Geräte den nächsten Sendezeitpunkt zufällig (Random Backoff).",
      "Diese Technik reduziert die Wahrscheinlichkeit weiterer Kollisionen, garantiert aber nicht, dass sie vollständig vermieden werden können."
    ],
    "explanationJa": [
      "ALOHA方式では、複数の端末が同時にデータを送信することがあり得ます。",
      "その場合、送信信号が重なって干渉し、いわゆる「コリジョン（衝突）」が発生します。",
      "ALOHAには明確な衝突検出の仕組みがないため、端末は自分のデータが中央から戻ってこない（ACKがない）ことで初めて通信失敗に気付きます。",
      "つまり、送信成功を確認できない場合は、データが失われたと判断します。",
      "端末は一定の時間（タイムアウト）を待ってから、もう一度同じデータを送信します。",
      "ただし、再度同時に送信するとまた衝突が起きるため、再送信のタイミングは各端末がランダムに選ぶ仕組みになっています（ランダムバックオフ）。",
      "これにより、再び衝突する確率を下げることができるものの、完全に防ぐことはできません。"
    ],
    "originalSlideText": "ALOHA (3)\n❑ Kollisionen: Zwei Teilnehmer senden gleichzeitig auf dem Inbound Channel\n Alle gleichzeitig gesendeten Pakete gehen verloren\n Keiner der Teilnehmer erhält damit ein Acknowledgement → Erneute Übertragung nach einem Timeout\n Zufällige Wahl des erneuten Übertragungszeitpunkt minimiert erneute Kollision",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 33,
    "questionDe": "(s37) Warum war ALOHA ineffizient?",
    "questionJa": "なぜALOHAは非効率だったのですか？",
    "answerDe": [
      "Bei hoher Auslastung traten viele Kollisionen auf.",
      "Nur ein kleiner Teil der Kanal-Kapazität konnte effektiv genutzt werden.",
      "Maximal 18 % der theoretischen Kapazität wurde erreicht."
    ],
    "answerJa": [
      "ネットワークの使用率が高くなると衝突が頻発したため。",
      "通信チャネルの容量のうち、ごく一部しか有効活用できなかった。",
      "理論上の最大使用率はわずか18％にとどまった。"
    ],
    "explanationDe": [
      "Das ursprüngliche ALOHA-Protokoll erlaubte es allen Teilnehmern, jederzeit zu senden – ohne vorherige Koordination.",
      "Diese Freiheit führte bei zunehmender Teilnehmerzahl zu häufigen Kollisionen, da mehrere Geräte gleichzeitig versuchten, Nachrichten zu senden.",
      "Nach jeder Kollision mussten alle betroffenen Stationen zufällige Wartezeiten abwarten, bevor sie erneut senden durften – was zusätzliche Verzögerungen verursachte.",
      "Da es keine Möglichkeit gab, bevorstehende Kollisionen zu erkennen oder zu vermeiden, stieg der Anteil verlorener Pakete mit steigender Last stark an.",
      "In der Praxis zeigte sich, dass im Mittel nur etwa 18 % der theoretisch möglichen Kanalbandbreite tatsächlich zur erfolgreichen Datenübertragung genutzt wurden.",
      "Das bedeutet, dass über 80 % der verfügbaren Zeit durch Kollisionen, Wiederholungen oder ungenutzte Intervalle verloren gingen.",
      "Daher war ALOHA zwar einfach und pionierhaft, aber für dichte Netzwerke mit vielen Nutzern ineffizient – spätere Protokolle wie CSMA/CD boten hier deutlich bessere Auslastung."
    ],
    "explanationJa": [
      "初期のALOHAプロトコルでは、端末がいつでも自由に送信を開始できるため、同時送信による衝突が多発しました。",
      "特にネットワーク利用者が増えると、送信の重なりが頻繁になり、衝突の確率が大幅に上昇します。",
      "衝突後は、各端末がランダムな時間を待ってから再送信する仕組みですが、この待機時間自体がネットワークの非効率を生む要因になります。",
      "ALOHAには、そもそも衝突を事前に検出・回避する機構が存在しないため、パケットの再送が頻繁に発生します。",
      "その結果、送信に成功するパケットはごくわずかに限られ、利用可能な通信チャネルの大半が無駄になってしまいます。",
      "実際、ALOHA方式では理論的にも最大で18％程度のチャネル利用率しか達成できないことが分かっています。",
      "このようにALOHAはシンプルで革新的な方式ではありましたが、多くの端末が同時に通信するような現代的なネットワークには適しておらず、より効率的なCSMA/CDなどの方式に発展していきました。"
    ],
    "originalSlideText": "ALOHA (4)\n❑ Protokoll erwies sich als nicht effizient genug\n Bei hoher Auslastung viele Kollisionen\n Nur 18% der Kapazität konnte wirklich genutzt werden",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 34,
    "questionDe": "(s38) Was ist CSMA/CD und wofür wurde es entwickelt?",
    "questionJa": "CSMA/CDとは何で、どのような目的で開発されたのですか？",
    "answerDe": [
      "CSMA/CD steht für Carrier Sense Multiple Access with Collision Detection.",
      "Es wurde 1973 im Xerox PARC entwickelt.",
      "1978 wurde es im DIX-Standard formalisiert (Digital, Intel, Xerox).",
      "CSMA/CD wurde für Ethernet-Netzwerke mit gemeinsam genutztem Kabel entwickelt.",
      "Ziel war ein effizienter Medienzugriff ohne zentrale Steuerung."
    ],
    "answerJa": [
      "CSMA/CDは「搬送波感知多重アクセス／衝突検出」を意味するプロトコルである。",
      "1973年にXerox PARCで開発された。",
      "1978年にDigital・Intel・XeroxによってDIX標準として策定された。",
      "共有ケーブルを用いるイーサネットのために設計された技術である。",
      "目的は、中央制御なしで効率よく通信メディアにアクセスすることだった。"
    ],
    "explanationDe": [
      "CSMA/CD ist ein dezentrales Zugriffsverfahren für Netzwerke mit gemeinsamem Übertragungsmedium, insbesondere das klassische Ethernet.",
      "Die Abkürzung steht für 'Carrier Sense Multiple Access with Collision Detection'.",
      "Es wurde 1973 im Xerox PARC entwickelt – einer Innovationsschmiede für Netzwerktechnologien.",
      "1978 wurde es durch Digital Equipment Corporation, Intel und Xerox standardisiert – als Teil des sogenannten DIX-Ethernet-Standards.",
      "Ziel war es, ein einfaches und effizientes Verfahren zu schaffen, mit dem mehrere Teilnehmer ein gemeinsames Kabel ohne zentrale Koordination nutzen können.",
      "Statt zentraler Kontrolle 'lauscht' jeder Teilnehmer zunächst auf dem Kabel (Carrier Sense), ob bereits gesendet wird.",
      "Im Fall gleichzeitiger Sendebereitschaft wird ein Mechanismus zur Kollisionserkennung und später zur Wiederholung des Versuchs verwendet – diese Logik wird in den Folge-Slides (s39–s41) näher erläutert."
    ],
    "explanationJa": [
      "CSMA/CDは、複数の端末が1本の共有ケーブルを使って通信を行うイーサネット（Ethernet）のために開発されたメディアアクセス制御方式です。",
      "名称は「Carrier Sense Multiple Access / Collision Detection（搬送波感知多重アクセス／衝突検出）」の略です。",
      "この方式は1973年にXerox PARCで開発され、1978年にDigital、Intel、Xeroxの3社によってDIX標準として正式に策定されました。",
      "目的は、中央制御装置を用いずに、複数の端末が同じ物理的メディアに効率よくアクセスできるようにすることでした。",
      "各端末はまずケーブル上に他の通信が流れていないかを「感知（Carrier Sense）」し、空いていれば送信を試みます。",
      "同時送信による衝突（コリジョン）を検出し、その後再送する仕組みも組み込まれています。",
      "このようにCSMA/CDは、シンプルながら共有メディアでの通信制御を可能にする画期的な技術でした。"
    ],
    "originalSlideText": "CSMA/CD (1)\n❑ 1973 am Xerox PARC entwickelt\n❑ 1978 von Digital Equipment Corporation, Intel und Xerox standardisiert (DIX Standard)\n❑ Bekannterer Name: Ethernet\n❑ Kabel dienen als geteiltes Medium: Alle Netzteilnehmer an ein Kabel angeschlossen\n❑ Problem: Medienzugriff auf das Kabel",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 35,
    "questionDe": "(s40) Wie funktioniert die Collision Detection bei CSMA/CD?",
    "questionJa": "CSMA/CDにおける衝突検出（Collision Detection）はどのように機能しますか？",
    "answerDe": [
      "Carrier Sense: Das Medium wird vor dem Senden abgehört.",
      "Nur bei freiem Kanal wird gesendet.",
      "Trotzdem können zwei Stationen fast gleichzeitig senden.",
      "Während des Sendens wird weiter abgehört.",
      "Wenn das gesendete Signal nicht dem empfangenen entspricht, liegt eine Kollision vor."
    ],
    "answerJa": [
      "キャリアセンス：送信前に通信路が空いているかを確認する。",
      "通信路が空いていれば送信を開始する。",
      "それでも複数の端末がほぼ同時に送信を開始すると衝突が起きうる。",
      "送信中もケーブルを監視し続ける。",
      "自分が送った信号と実際の信号が一致しない場合、衝突が発生したと判断する。"
    ],
    "explanationDe": [
      "CSMA/CD basiert auf dem Prinzip, dass ein Gerät zunächst überprüft, ob das Übertragungsmedium frei ist – das ist das Carrier Sense.",
      "Wenn kein anderes Signal erkannt wird, beginnt das Gerät mit dem Senden.",
      "Da Signale jedoch eine gewisse Zeit benötigen, um sich im Kabel auszubreiten, können zwei Geräte gleichzeitig den Kanal als 'frei' interpretieren und gleichzeitig senden.",
      "Dies führt zu einer Kollision, bei der sich die Signale überlagern und unbrauchbar werden.",
      "Während der Übertragung überwacht jedes Gerät das Medium weiter – dies ist der Collision Detection-Teil.",
      "Wenn das Signal, das ein Gerät während des Sendens empfängt, nicht dem entspricht, was es selbst sendet, erkennt es eine Kollision.",
      "Das Gerät bricht dann die Übertragung sofort ab und leitet eine sogenannte Jam Sequence ein, um andere Geräte ebenfalls zu warnen."
    ],
    "explanationJa": [
      "CSMA/CDでは、まず端末が通信メディア（ケーブル）上に他の信号が存在していないかを確認します。これが「Carrier Sense（キャリアセンス）」です。",
      "他の信号が検出されなければ、端末は送信を開始します。",
      "ただし、信号はケーブル内を伝播するのに時間がかかるため、複数の端末が同時に「空いている」と判断して送信を開始する場合があります。",
      "このような場合、信号がぶつかってコリジョン（衝突）が発生します。",
      "送信中も端末は通信メディアを監視し続けており、これが「Collision Detection（衝突検出）」の部分です。",
      "もし自分が送っている信号と実際に観測される信号が一致しなければ、それは衝突が起きた証拠となります。",
      "衝突を検出した端末はすぐに送信を中止し、他の端末にも衝突が起きたことを知らせるジャム信号（Jam Sequence）を送信します。"
    ],
    "originalSlideText": "CSMA/CD (2)\n❑ Bedeutendste Eigenschaften von CSMA/CD:\n Carrier Sense\n• Übertragungen auf dem Kabel werden überwacht\n• Es wird nur übertragen, wenn nicht bereits eine Übertragung läuft\n Collision Detection:\n• Trotz Carrier Sense sind Kollisionen möglich, wenn zwei Teilnehmer nahezu gleichzeitig beginnen zu senden bei freiem Kanal\n• Während des Sendens wird gleichzeitig auf dem Kabel gelauscht → Kollision, wenn das Signal auf dem Kabel nicht dem gesendeten entspricht",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 36,
    "questionDe": "(s41) Was ist der Binary Exponential Backoff? (Bild vorhanden)",
    "questionJa": "バイナリエクスポネンシャルバックオフとは何ですか？（図あり）",
    "answerDe": [
      "Nach einer Kollision warten die Teilnehmer, bis der Kanal frei ist.",
      "Dann wählen sie zufällig eine Wartezeit aus einem Intervall [0, d].",
      "Nach jeder weiteren Kollision wird das Intervall verdoppelt: [0, 2d], [0, 4d] usw.",
      "Dadurch sinkt die Wahrscheinlichkeit erneuter Kollisionen.",
      "Der Wert d ist im Standard definiert."
    ],
    "answerJa": [
      "衝突後、端末はチャネルが空くのを待つ。",
      "その後、[0, d] の範囲からランダムに待機時間を選ぶ。",
      "再び衝突が起こるたびにこの範囲は2倍に広がる（[0, 2d]、[0, 4d] など）。",
      "これにより再衝突の可能性が低くなる。",
      "パラメータdの値は標準で定義されている。"
    ],
    "explanationDe": [
      "Binary Exponential Backoff ist ein Verfahren zur Kollisionserholung im CSMA/CD-Protokoll.",
      "Wenn zwei Stationen gleichzeitig senden und eine Kollision erkennen, stoppen sie sofort die Übertragung.",
      "Danach wartet jede Station, bis der Kanal wieder frei ist.",
      "Anschließend wartet jede Station eine zufällig gewählte Zeit aus einem Intervall [0, d], bevor sie erneut versucht zu senden.",
      "Falls es erneut zu einer Kollision kommt, wird das Intervall verdoppelt: beim zweiten Versuch [0, 2d], beim dritten [0, 4d] usw.",
      "Diese exponentielle Vergrößerung des Backoff-Intervalls reduziert die Wahrscheinlichkeit, dass dieselben Stationen erneut gleichzeitig senden.",
      "Das Verfahren balanciert zwischen Schnelligkeit bei geringer Last und Vorsicht bei hoher Last und ist somit zentral für die Effizienz von Ethernet-Netzen."
    ],
    "explanationJa": [
      "バイナリエクスポネンシャルバックオフは、CSMA/CD方式で衝突が発生した際の再送制御手法です。",
      "2つ以上の端末が同時に送信して衝突が発生した場合、それぞれの端末はすぐに送信を中止します。",
      "その後、チャネルが空になるのを待ち、次に送信するまでの待機時間をランダムに決定します。",
      "この待機時間は [0, d] の範囲から選ばれ、再び衝突が発生するごとにこの範囲が [0, 2d]、[0, 4d] のように指数的に拡大していきます。",
      "これにより、同じ端末が再び同時に送信する確率が下がり、衝突の再発を抑制できます。",
      "この手法は、ネットワークが空いているときには素早く、混雑しているときには慎重に動作するように設計されており、イーサネットの効率性と安定性を支える重要な要素です。",
      "なお、このとき使用される初期値dや最大試行回数などのパラメータは標準規格に基づいて設定されています。"
    ],
    "originalSlideText": "CSMA/CD (3)\n❑ Bedeutendste Eigenschaften CSMA/CD:\n Binary Exponential Backoff:\n• Nach Kollision wird auf freien Kanal gewartet\n• Zusätzlich wird eine Wartezeit zufällig aus dem Intervall [0,d] gewählt\n• Ist der Kanal frei, warten alle Beteiligten der Kollision darauf, dass ihre Wartezeit abläuft → anschließend erneute Übertragung\n• Wiederholte Kollisionen möglich → Intervall wird pro wiederholter Kollision verdoppelt: 1. [0,d] 2. [0,2d] 3. [0,4d] …\n• Vergrößertes Intervall verringert die Wahrscheinlichkeit von erneuten Kollisionen\n• d ist im Standard definiert",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 37,
    "questionDe": "(s42) Warum funktioniert CSMA/CD nicht bei WLAN?",
    "questionJa": "なぜCSMA/CDは無線LAN（WLAN）で機能しないのですか？",
    "answerDe": [
      "In WLANs ist das empfangene Signal oft deutlich schwächer als das eigene Sendesignal.",
      "Geräte können sich gegenseitig nicht hören – das Hidden-Terminal-Problem.",
      "Carrier Sense erkennt daher laufende Übertragungen nicht zuverlässig.",
      "Collision Detection ist in drahtlosen Netzen technisch kaum möglich."
    ],
    "answerJa": [
      "無線LANでは、受信信号が自分の送信信号に比べて非常に弱いことが多い。",
      "一部の端末同士が互いに存在を検知できない（隠れ端末問題）。",
      "キャリアセンスによって他の通信の存在を正しく検出できない。",
      "無線では衝突検出（Collision Detection）が技術的に困難である。"
    ],
    "explanationDe": [
      "CSMA/CD basiert auf der Fähigkeit, das Medium während der eigenen Übertragung zu überwachen und Kollisionen zu erkennen.",
      "In drahtgebundenen Netzwerken funktioniert dies gut, da das gesendete und empfangene Signal physikalisch voneinander trennbar sind.",
      "In drahtlosen Netzwerken wie WLAN ist das jedoch nicht praktikabel: Das eigene Sendesignal ist oft so stark, dass es das viel schwächere Empfangssignal überlagert.",
      "Geräte können dadurch nicht erkennen, ob sie gleichzeitig mit einem anderen senden – eine Kollision bleibt unbemerkt.",
      "Hinzu kommt das Hidden-Terminal-Problem: Zwei Geräte, die außerhalb der Reichweite voneinander liegen, können gleichzeitig senden, ohne zu wissen, dass sie den gleichen Empfänger stören.",
      "Diese technischen Einschränkungen machen eine verlässliche Kollisionserkennung im WLAN unmöglich.",
      "Stattdessen wird CSMA/CA verwendet, das auf Vermeidung statt Erkennung von Kollisionen setzt – dies wird auf der nächsten Folie behandelt."
    ],
    "explanationJa": [
      "CSMA/CDでは、送信中に通信路を監視して、他の端末との衝突（コリジョン）を検出することが基本です。",
      "有線通信では送信信号と受信信号が物理的に区別できるため、この方式が有効に機能します。",
      "しかし、無線通信（WLAN）では、自分の送信信号が非常に強く、同時に入ってくる他の端末からの弱い信号を覆い隠してしまうため、衝突を検出することが困難です。",
      "さらに、「隠れ端末問題（Hidden Terminal）」と呼ばれる現象もあります。これは、ある端末が別の端末の存在を検知できず、同時に同じ受信端末に送信してしまうという問題です。",
      "このように、無線環境ではキャリアセンスの正確性が低く、信頼できる衝突検出が技術的に難しいとされています。",
      "そのため、無線LANでは衝突を「検出」するのではなく、そもそも「発生させないように回避」するCSMA/CA方式が使われます。",
      "CSMA/CAについては次のスライドで詳しく説明されています。"
    ],
    "originalSlideText": "CSMA/CA (1)\n❑ CSMA/CD funktioniert leider nicht in drahtlosen Netzen\n❑ Viel stärkerer Signalabfall erzeugt Problem des Hidden Terminal\n❑ Annahme: 𝛿 bezeichnet die maximale Distanz die ein Signal zurück legen kann\n Computer 1 und Computer 3 senden trotz Carrier Sense gleichzeitig zu Computer 2, da sie sich gegenseitig nicht hören → Carrier Sense verhindert weniger Kollisionen als bei Ethernet",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 38,
    "questionDe": "(s43) Wie funktioniert CSMA/CA zur Vermeidung von Kollisionen?",
    "questionJa": "衝突を避けるためにCSMA/CAはどのように機能しますか？",
    "answerDe": [
      "Es wird vor der Datenübertragung eine Kontrollnachricht gesendet.",
      "Alle Stationen speichern die angekündigte Netzbelegung im NAV (Network Allocation Vector).",
      "Sender sendet eine RTS (Request to Send)-Nachricht.",
      "Empfänger antwortet mit CTS (Clear to Send).",
      "Auch versteckte Stationen werden dadurch vorgewarnt."
    ],
    "answerJa": [
      "データ送信の前に制御メッセージを送る。",
      "すべての端末はその情報をNAV（ネットワーク使用状況ベクトル）に記録する。",
      "送信側はRTS（送信要求）を送信する。",
      "受信側はCTS（送信許可）で応答する。",
      "これにより隠れ端末も事前に送信を控えるようになる。"
    ],
    "explanationDe": [
      "CSMA/CA (Carrier Sense Multiple Access with Collision Avoidance) ist ein Verfahren zur Kollisionsvermeidung in drahtlosen Netzwerken wie WLAN.",
      "Anders als bei CSMA/CD versucht CSMA/CA, Kollisionen gar nicht erst entstehen zu lassen.",
      "Vor der eigentlichen Datenübertragung sendet der Sender ein 'Request to Send' (RTS) an den Empfänger.",
      "Wenn der Empfänger verfügbar ist, antwortet er mit 'Clear to Send' (CTS).",
      "Alle Stationen, die die CTS-Nachricht empfangen – auch solche, die den Sender nicht hören konnten (Hidden Terminals) – wissen nun, dass eine Übertragung bevorsteht.",
      "Diese Stationen tragen die angekündigte Übertragungszeit in ihren NAV (Network Allocation Vector) ein und vermeiden in dieser Zeit eigene Übertragungen.",
      "So kann auch in komplexen drahtlosen Topologien eine koordinierte Kommunikation ohne Kollisionen erreicht werden."
    ],
    "explanationJa": [
      "CSMA/CA（Carrier Sense Multiple Access with Collision Avoidance）は、無線ネットワーク（特にWLAN）で使用される衝突回避のためのプロトコルです。",
      "CSMA/CDのように衝突を検出するのではなく、最初から衝突が起きないように通信を制御するのが特徴です。",
      "データ送信を行う前に、送信側は「送信要求（RTS: Request to Send）」という制御メッセージを送信します。",
      "受信側は問題がなければ「送信許可（CTS: Clear to Send）」という応答を返します。",
      "このCTSメッセージを受け取った他の端末（たとえRTSを受信していなくても）は、その送信が行われることを知り、自分の送信を控えるようになります。",
      "各端末はこの情報をNAV（ネットワーク使用状況ベクトル）に記録し、指定された期間は通信を控えます。",
      "これにより、隠れ端末問題も解決され、無線通信環境でも衝突の少ないスムーズな通信が可能になります。"
    ],
    "originalSlideText": "CSMA/CA (2)\n❑ Statt Collision Detection wird Collision Avoidance (CA) eingesetzt\n Vor der eigentlichen Übertragung der Nutzdaten, werden Kontrollnachrichten ausgesandt, die alle zuhörenden Stationen von der baldigen Übertragung informiert → Network Allocation Vector (NAV) jeder Station speichert die Netzbelegung\n Sender schickt Request to Send (RTS), Empfänger antwortet mit Clear to Send (CTS)\n Hidden Terminal Problem wird gelöst, da nun auch alle Rechner in Sendereichweite vom Empfänger von der Übertragung informiert werden",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 39,
    "questionDe": "(s44) Welche zentralen Themen wurden in der Vorlesung behandelt?",
    "questionJa": "この講義で扱われた中心的なテーマは何でしたか？",
    "answerDe": [
      "Unterschied zwischen Circuit Switched und Packet Switched Netzwerken.",
      "Klassifikation in LAN, MAN und WAN.",
      "Vier LAN-Topologien: Bus, Ring, Mesh, Stern.",
      "Adressierung mit 48-Bit MAC-Adressen.",
      "Verwendung von Unicast-, Broadcast- und Multicast-Adressen.",
      "Framing als Protokoll zur Datenkapselung."
    ],
    "answerJa": [
      "回線交換ネットワークとパケット交換ネットワークの違い。",
      "LAN・MAN・WANによるネットワークの分類。",
      "4種類のLANトポロジー：バス、リング、メッシュ、スター。",
      "48ビットのMACアドレスによるアドレス指定。",
      "ユニキャスト・ブロードキャスト・マルチキャストアドレスの使い分け。",
      "データをカプセル化するためのフレーミングプロトコル。"
    ],
    "explanationDe": [
      "Diese Vorlesung behandelte zentrale Grundlagen der Datenübertragung im lokalen Netzwerk (LAN) und im Zusammenhang mit der Network Interface Schicht.",
      "Ein Fokus lag auf dem Vergleich zwischen leitungsvermittelten und paketvermittelten Netzen, insbesondere im Hinblick auf Flexibilität und Ressourcennutzung.",
      "Die Netzwerkkategorisierung in LAN, MAN und WAN zeigt die Reichweitendimension und deren technische und praktische Unterschiede.",
      "Bei den LAN-Topologien wurden vier klassische Strukturen (Bus, Ring, Mesh, Stern) analysiert – jede mit spezifischen Eigenschaften in Bezug auf Kosten, Fehleranfälligkeit und Skalierbarkeit.",
      "Ein weiterer zentraler Aspekt war die MAC-Adressierung: Jedes Gerät erhält eine weltweit eindeutige 48-Bit-Adresse zur Identifikation auf Layer 2.",
      "Dabei wurde auch zwischen verschiedenen Adresstypen unterschieden – etwa Unicast (1:1), Broadcast (1:N) und Multicast (1:n).",
      "Schließlich wurde erläutert, wie Daten durch Framing strukturiert und sicher im Netzwerk übertragen werden – inklusive Header, Payload und Erkennung von Rahmen-Grenzen."
    ],
    "explanationJa": [
      "この講義では、ネットワークインターフェース層に関する基本概念やLANにおけるデータ転送の仕組みを中心に学習しました。",
      "まず、回線交換方式とパケット交換方式の違いを通じて、それぞれの通信方式の柔軟性やリソース活用の観点からの特徴が比較されました。",
      "ネットワークはその通信範囲によってLAN、MAN、WANに分類され、それぞれに異なる技術的特性と用途があることが説明されました。",
      "LAN構成に関しては、バス型・リング型・メッシュ型・スター型という4つのトポロジーが紹介され、コストや故障時の影響、拡張性などが比較されました。",
      "MACアドレスに関する章では、各端末に割り当てられる48ビットの一意のアドレスについて、その構造やOUIによる管理方式、アドレスタイプ（ユニキャスト／ブロードキャスト／マルチキャスト）の違いが解説されました。",
      "最後に、フレーミングによるデータ構造化の方法や、ヘッダー・ペイロード・フレームの境界検出の仕組みが説明され、通信の整合性を保つ技術が整理されました。"
    ],
    "originalSlideText": "Zusammenfassung (1)\n❑ Mehrere Klassifikationen für Rechnernetze\n Circuit Switched vs Packet Switched\n LAN, MAN, WAN\n❑ Vier Topologien für LANs: Bus, Star, Ring, Mesh\n❑ Adressierung von Rechnern mittels 48-Bit MAC Adressen\n❑ Broadcast, Multicast und Unicast Adressen\n❑ Framing beschreibt das Protokoll zur Kapselung von Nutzdaten in das zu übertragende Paket",
    "explanationImage": "",
    "questionImage": ""
  }
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
]