[
  {
    "id": 1,
    "questionDe": "(s3) Was sind die grundlegenden Ziele und Themen dieser Vorlesung?",
    "questionJa": "この講義の基本的な目標とテーマは何ですか？",
    "answerDe": [
      "Überblick über die Hardwarebausteine eines LANs",
      "Vertiefung des Verständnisses von WAN Technologien",
      "LAN-Komponenten: Repeater, Bridge, Switch",
      "WAN-Technologien: Architektur, Routing",
      "Sonstige Technologien"
    ],
    "answerJa": [
      "LANのハードウェア構成要素の概要",
      "WAN技術に関する理解の深化",
      "LANコンポーネント：リピータ、ブリッジ、スイッチ",
      "WAN技術：アーキテクチャ、ルーティング",
      "その他の技術"
    ],
    "explanationDe": [
      "Diese Vorlesung hat zwei Hauptziele: Zum einen soll ein Überblick über die grundlegenden Hardwarekomponenten eines lokalen Netzwerks (LAN) gegeben werden. Dazu gehören Repeater, Bridges und Switches – Geräte, die den Aufbau und die Funktion von LANs ermöglichen und verbessern.",
      "Zum anderen geht es um das tiefere Verständnis von WAN-Technologien, also Techniken, mit denen Netzwerke über große Distanzen verbunden werden. Hierbei spielen Aspekte wie die Netzarchitektur und das Routing – also die Weiterleitung von Datenpaketen – eine zentrale Rolle.",
      "Ein LAN (Local Area Network) ist auf kürzere Distanzen, wie etwa innerhalb eines Gebäudes, ausgelegt. Die verwendeten Komponenten müssen kosteneffizient und schnell sein. Im Gegensatz dazu verbinden WANs (Wide Area Networks) ganze Städte oder Länder und erfordern skalierbare, fehlertolerante Technologien.",
      "Der Vergleich von Repeatern, Bridges und Switches erlaubt ein besseres Verständnis dafür, wie Daten in einem LAN verteilt werden. Ein Repeater verstärkt Signale, eine Bridge filtert und verbindet Netzsegmente, und ein Switch ermöglicht parallele Übertragungen.",
      "Im WAN-Bereich wird die Vorlesung zentrale Technologien wie dynamisches Routing und Netzstrukturen beleuchten. Dazu gehört das Verständnis von Next-Hop-Forwarding, Adressierung und Algorithmen wie dem Dijkstra-Algorithmus.",
      "Zudem behandelt die Vorlesung weitere Technologien, etwa Zugangstechnologien (z. B. DSL, Kabelmodem, Wi-Fi), VoIP und Software Defined Networking (SDN), die den modernen Netzwerkbetrieb prägen.",
      "Ziel ist es, den Studierenden sowohl technische Grundlagen als auch die praktischen Herausforderungen beim Aufbau und Betrieb moderner Netzwerke zu vermitteln."
    ],
    "explanationJa": [
      "この講義には大きく2つの目標があります。1つ目は、LAN（ローカルエリアネットワーク）のハードウェア構成要素について全体像を把握することです。ここでは、リピータ、ブリッジ、スイッチといったデバイスが取り上げられ、LANの構築や機能向上にどのように寄与しているかを学びます。",
      "2つ目は、WAN（ワイドエリアネットワーク）技術に関する理解を深めることです。WANとは、都市間や国を超えた大規模ネットワークであり、その構築にはルーティング（パケットの転送経路決定）やアーキテクチャ設計などの知識が必要となります。",
      "LANは通常、建物内やキャンパス内などの短距離通信に使用されるため、速度とコストが重視されます。一方WANは、地理的に離れた場所を結ぶため、スケーラビリティや耐障害性が求められます。",
      "リピータ、ブリッジ、スイッチといったLAN機器を比較することで、LAN内でのデータ転送方法の違いや効率性について深く理解できます。たとえば、リピータは信号を単純に増幅しますが、ブリッジはパケットを識別・フィルタリングし、スイッチは並列通信を可能にします。",
      "WANに関しては、ダイナミックルーティングやネットワーク構造、Next-Hop ForwardingやDijkstraアルゴリズムなどのトピックが中心です。",
      "また、DSL、ケーブルモデム、Wi-Fiなどのアクセス技術、VoIP（インターネットを用いた音声通話）、SDN（ソフトウェア定義ネットワーク）といった、現代のネットワーク運用に欠かせない先進的な技術も扱います。",
      "この講義は、学生にネットワーク構築・運用の基本から応用までを幅広く伝えることを目的としています。"
    ],
    "originalSlideText": "Überblick\n\nZiele:\n❑ Überblick über die Hardwarebausteine eines LANs\n❑ Vertiefung des Verständnisses von WAN Technologien\n\nThemen:\n❑ LAN-Komponenten\n Repeater\n Bridge\n Switch\n❑WAN-Technologien\n Architektur\n Routing\n❑ Sonstige Technologien",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 2,
    "questionDe": "(s6) Was ist ein Fiber Modem und wie funktioniert es im LAN?",
    "questionJa": "ファイバーモデムとは何ですか？LANではどのように動作しますか？",
    "answerDe": [
      "Ermöglicht Anbindung eines Hosts an entferntes Ethernet",
      "Verbindung über Glasfaserleiter zwischen zwei Fiber Modems",
      "Transparente Verbindung für Computer und Switch bei Standard Interface",
      "Zwei Glasfaserleiter für gleichzeitige Übertragung in beide Richtungen"
    ],
    "answerJa": [
      "離れた場所にあるホストをイーサネットに接続するための装置",
      "2つのファイバーモデム間を光ファイバーで接続",
      "標準インターフェースを使えばコンピュータやスイッチからは透過的に見える",
      "送受信を同時に行うために2本の光ファイバーを使用"
    ],
    "explanationDe": [
      "Ein Fiber Modem wird verwendet, um einen Computer oder Host über eine größere Entfernung mit einem Ethernet-Netzwerk zu verbinden. Dies ist besonders dann notwendig, wenn der Computer physisch weit von einem zentralen Switch oder Netzwerk entfernt ist.",
      "Zwischen zwei Fiber Modems wird eine Glasfaserleitung verwendet, die Daten in Form von Licht überträgt. Diese Glasfaser ermöglicht hohe Datenraten und große Reichweiten ohne große Signalverluste, im Gegensatz zu Kupferkabeln.",
      "In der Praxis werden meist zwei Glasfaserleitungen verwendet – eine für die Datenübertragung in jede Richtung. Dies erlaubt eine gleichzeitige bidirektionale Kommunikation.",
      "Für die angeschlossenen Computer und Switches erscheint die Verbindung als normales Ethernet, sofern das Fiber Modem ein standardisiertes Interface verwendet. Das bedeutet, dass keine spezielle Konfiguration oder Software notwendig ist – es funktioniert einfach wie ein sehr langes Ethernet-Kabel.",
      "Der große Vorteil eines Fiber Modems liegt in seiner Transparenz und Reichweite. Es erweitert die physische Grenze eines LANs ohne Änderungen an der Netzwerkarchitektur oder Protokollen.",
      "Ein typisches Beispiel ist die Verbindung von zwei Bürogebäuden auf einem Campus über Glasfaser. Die Modems stehen an den Endpunkten und übernehmen die optoelektronische Wandlung.",
      "Im Vergleich zu alternativen Lösungen wie WLAN-Bridge oder Richtfunk bietet Glasfaser mit Fiber Modem deutlich stabilere und störungsfreiere Übertragungen – vor allem bei hohen Bandbreiten."
    ],
    "explanationJa": [
      "ファイバーモデムは、離れた場所にあるコンピュータやホストをイーサネットネットワークに接続するための装置です。物理的に距離がある場合、通常の銅線ケーブルでは信号が劣化してしまいますが、ファイバーモデムと光ファイバーを使えば高品質な接続が可能になります。",
      "2台のファイバーモデムは光ファイバーで接続され、光信号としてデータを送受信します。この方法は長距離通信に非常に適しており、データ転送の安定性と速度の面で優れています。",
      "実際には、双方向通信を同時に行うために2本の光ファイバーが用いられます。これにより、送信と受信が同時並行で行われ、効率的なデータ通信が可能になります。",
      "ファイバーモデムが標準インターフェースを使用していれば、接続されたコンピュータやスイッチには通常のイーサネット接続と同様に見えます。つまり、特別な設定やソフトウェアを必要とせずに使用できる“透過的な”装置です。",
      "この装置を使うことで、LANの物理的な制限距離を事実上拡張することができます。ネットワークの構成やプロトコルを変更することなく、遠隔地との接続が実現できます。",
      "例として、キャンパス内の2つの建物を光ファイバーで接続する際に、両端にファイバーモデムを設置することで、建物間の通信がLANとして扱えるようになります。",
      "Wi-Fiブリッジや無線通信と比較すると、ファイバーモデムは高帯域で安定した通信が可能なため、特に信頼性が重視される業務用ネットワークで優れた選択肢となります。"
    ],
    "originalSlideText": "Fiber Modems\n\n❑ Anbindung eines Hosts an entferntes Ethernet\n❑ Glasfaserleiter zwischen zwei Fiber Modems\n❑ Transparent für Computer und Ethernet Switch falls Modem Standard Interface verwendet\n❑ In Praxis zwei Glasfaserleiter für simultane Übertragung in beide Richtungen",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 3,
    "questionDe": "(s7) Was ist ein Repeater und welche Funktion erfüllt er im LAN?",
    "questionJa": "リピータとは何ですか？LAN内でどのような役割を果たしますか？",
    "answerDe": [
      "Analoges Gerät zur Übertragung von LAN-Signalen über größere Entfernungen",
      "Empfangenes Signal wird verstärkt und weitergesendet",
      "Versteht keine Pakete oder Bits",
      "Früher oft im Ethernet eingesetzt",
      "Auch zur Weiterleitung von Infrarotsignalen verwendet"
    ],
    "answerJa": [
      "LAN信号を遠距離に伝送するためのアナログ装置",
      "受信した信号を単純に増幅して再送信する",
      "パケットやビットの意味を理解しない",
      "以前はEthernetで頻繁に使用されていた",
      "赤外線信号の中継にも使用されることがある"
    ],
    "explanationDe": [
      "Ein Repeater ist ein einfaches analoges Gerät, das dazu dient, LAN-Signale über größere Entfernungen zu übertragen. Dies wird erreicht, indem das eingehende elektrische Signal empfangen, verstärkt und erneut ausgesendet wird.",
      "Im Gegensatz zu Switches oder Bridges, die Paketinhalte analysieren können, besitzt ein Repeater keine Fähigkeit zur Dateninterpretation. Er kennt weder Adressen noch Protokolle – er behandelt das Signal rein elektrisch.",
      "Repeater wurden vor allem in frühen Ethernet-Installationen eingesetzt, um die durch die physikalische Kabellänge begrenzte Reichweite zu vergrößern. Beispielsweise konnte ein Ethernet-Kabel technisch nur bis zu 100 Meter reichen – durch den Einsatz eines Repeaters konnte man die Verbindung verlängern.",
      "Ein Nachteil ist jedoch, dass Repeater keine Fehlerkorrektur oder Paketfilterung durchführen. Sie verstärken auch Störungen und leiten sie weiter.",
      "Trotz dieser Einschränkungen sind Repeater in bestimmten Spezialanwendungen weiterhin nützlich – zum Beispiel zur Erweiterung von Infrarotsensoren in Heimautomatisierungssystemen oder zur Signalverstärkung in Gebäuden mit dicken Wänden.",
      "Im Vergleich zu Switches, die gleichzeitig mehrere Datenströme intelligent leiten können, oder Bridges, die Pakete basierend auf MAC-Adressen filtern, ist der Repeater ein sehr rudimentäres Gerät.",
      "Heute sind Repeater weitgehend durch modernere digitale Komponenten ersetzt worden, insbesondere durch Switches mit integrierter Fehlerbehandlung und besserer Leistung."
    ],
    "explanationJa": [
      "リピータは、LAN信号をより長い距離に伝送するための単純なアナログ装置です。入力された電気信号をそのまま増幅して出力し、ケーブルの物理的な制限距離を延ばす目的で使用されます。",
      "スイッチやブリッジのようにパケットを解析する機能は持っておらず、ビット列やアドレスなどを理解することもできません。純粋に信号の強度を物理的に強めて伝送するだけの装置です。",
      "初期のEthernetでは、1本のケーブルで接続できる長さが100メートル程度に制限されていました。この制限を超えて接続するためにリピータが用いられ、たとえば2つの部屋や階をつなぐ場合に有効でした。",
      "ただし、リピータは信号と同時にノイズもそのまま増幅してしまうため、信頼性の面で課題もあります。また、通信の衝突検出（CSMA/CD）など、ネットワークの一部機能に制限を与える場合もあります。",
      "最近では、赤外線リモコンの信号を壁越しに伝える用途などでも使われることがあります。これは家庭用オーディオシステムやスマートホーム機器などで見られます。",
      "スイッチやブリッジのようにネットワーク層で賢く動作する装置と比べると、リピータは非常に単純で原始的な機能を提供します。",
      "現在では、リピータの機能はスイッチやルーターといったより高度な機器に置き換えられており、使用される場面は限られています。"
    ],
    "originalSlideText": "Repeater\n\n❑ Analoges Gerät um LAN Signale über weite Entfernungen zu übertragen\n❑ Empfanges Signal wird verstärkt und weiter gesendet\n❑ Kein Verständnis von Paketen oder Bits\n❑ Früher häufig im Ethernet genutzt\n❑ Auch: Weiterleitung von Infrarotsignalen",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 4,
    "questionDe": "(s8) Was ist eine Bridge und welche Aufgaben erfüllt sie in einem LAN?",
    "questionJa": "ブリッジとは何ですか？LANではどのような役割を果たしますか？",
    "answerDe": [
      "Verbindet zwei LAN-Segmente und überträgt Pakete zwischen ihnen",
      "Lauscht in Promiscuous Mode auf beiden Segmenten (empfängt alle Pakete)",
      "Leitet gültige Pakete von einem Segment zum anderen weiter",
      "Sendet Broadcast-Frames an alle Computer beider Segmente",
      "Für Computer erscheint das gesamte Netz wie ein einziges LAN",
      "Früher eigenständiges Gerät, heute oft in Modems oder Routern integriert"
    ],
    "answerJa": [
      "2つのLANセグメントを接続し、パケットを中継する装置",
      "両方のセグメントでプロミスキャスモードで全パケットを受信する",
      "有効なパケットを検出すると他方のセグメントに転送する",
      "ブロードキャストフレームは両方のセグメント全体に送信される",
      "接続されたPCからは1つのLANのように見える",
      "かつては独立した機器だったが、現在はモデムやルーターに統合されている"
    ],
    "explanationDe": [
      "Eine Bridge ist ein Netzwerkgerät, das zwei physikalisch getrennte LAN-Segmente miteinander verbindet und die Kommunikation zwischen ihnen ermöglicht.",
      "Sie arbeitet auf der Data Link Layer (Schicht 2) des OSI-Modells und unterscheidet sich dadurch von Routern, die auf der Network Layer arbeiten.",
      "Im sogenannten Promiscuous Mode empfängt die Bridge alle Pakete auf beiden Seiten – unabhängig davon, ob sie für sie bestimmt sind oder nicht. So kann sie analysieren, ob ein Paket weitergeleitet werden muss.",
      "Trifft ein valides Paket ein, wird es – sofern es für das andere Segment bestimmt ist – dorthin weitergeleitet. Broadcasts werden generell an alle angeschlossenen Geräte beider Seiten gesendet.",
      "Von den verbundenen Computern aus betrachtet erscheint das Netzwerk als ein einziges LAN, obwohl es physisch getrennte Segmente sind. Diese Transparenz ist ein großer Vorteil bei der Erweiterung von Netzwerken.",
      "Früher wurden Bridges als dedizierte Geräte genutzt. Heute sind ihre Funktionen in vielen Consumer-Geräten wie DSL-Modems oder WLAN-Routern integriert.",
      "Im Unterschied zu Switches, die viele Ports besitzen und segmentweise arbeiten, verbindet eine Bridge typischerweise genau zwei Segmente. Switches können als Weiterentwicklung mehrerer Bridges betrachtet werden."
    ],
    "explanationJa": [
      "ブリッジは、物理的に分離された2つのLANセグメントを接続し、それらの間で通信を可能にするネットワーク機器です。",
      "OSI参照モデルの第2層（データリンク層）で動作し、ネットワーク層で動作するルーターとは異なります。",
      "ブリッジはプロミスキャスモードという状態で動作し、接続されたすべてのパケットを監視します。これにより、どのパケットを転送するべきかを判断できます。",
      "有効なパケットが一方のセグメントで検出されると、宛先が他方にあると判断された場合、そのパケットは転送されます。ブロードキャストのパケットは常に両セグメントに送信されます。",
      "接続されているパソコンから見ると、分割されているはずのネットワークが1つのLANとして動作しているように見えます。これはネットワークの拡張や柔軟な構成にとって大きな利点です。",
      "以前はスタンドアロン型のブリッジ装置が使用されていましたが、今日ではその機能は多くのケーブルモデムや無線ルーターに組み込まれています。",
      "スイッチと異なり、ブリッジは通常2つのポートしか持たず、単純な接続に使用されます。スイッチは複数のポートを持ち、より高度なパケット処理とネットワーク構成が可能です。"
    ],
    "originalSlideText": "Bridges\n\n❑ Verbindung und Paketübertragung zwischen zwei LANs\n❑ Bridge lauscht auf beiden Segmenten in Promiscuous Mode (Empfängt alle Pakete)\n❑ Bridge empfängt valides Paket auf einem Segment → Weiterleitung an anderes Segment\n Broadcast Frame an alle Computer beider Segmente\n❑ Für Computer nicht erkennbar, ob einziges LAN oder LANs mit Bridge\n❑ Früher Stand-Alone Gerät, heute in Kabel- oder DSL-Modem sowie Wireless Router integriert",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 5,
    "questionDe": "(s9) Wie funktionieren lernende Bridges und was bedeutet Filterung im LAN?",
    "questionJa": "学習型ブリッジはどのように機能しますか？フィルタリングとはLANで何を意味しますか？",
    "answerDe": [
      "Bridge analysiert Ziel-MAC-Adresse eines Frames",
      "Unnötige Weiterleitungen werden durch Filterung verhindert",
      "Broadcast und Multicast werden immer weitergeleitet",
      "Lernende Bridges merken sich die Orte der Computer automatisch",
      "Source-MAC-Adresse wird extrahiert und zu Segmentliste hinzugefügt"
    ],
    "answerJa": [
      "ブリッジはフレームの宛先MACアドレスを解析する",
      "不要なパケット転送を防ぐためにフィルタリングを行う",
      "ブロードキャストとマルチキャストは常に転送される",
      "学習型ブリッジはコンピュータの位置を自動的に記憶する",
      "送信元のMACアドレスを抽出し、対応するセグメントリストに追加する"
    ],
    "explanationDe": [
      "Lernende Bridges sind fortgeschrittene Netzwerkgeräte, die sich im Betrieb automatisch merken, welche MAC-Adresse zu welchem LAN-Segment gehört. Dies geschieht ohne manuelle Konfiguration.",
      "Beim Empfang eines Datenframes extrahiert die Bridge die Quell-MAC-Adresse und merkt sich, über welches Interface (Segment) dieses Gerät erreichbar ist. Diese Information wird in einer internen Tabelle gespeichert.",
      "Wenn die Bridge später ein Paket mit einer bekannten Zieladresse empfängt, leitet sie es gezielt nur an das entsprechende Segment weiter, anstatt es an alle Segmente zu senden.",
      "Dieses gezielte Weiterleiten nennt man Filterung: Es verhindert, dass unnötig viele Pakete im Netzwerk zirkulieren, was sowohl die Effizienz als auch die Sicherheit verbessert.",
      "Broadcast- und Multicast-Pakete sind von dieser Filterung ausgenommen – sie werden immer an alle Segmente weitergeleitet, da sie grundsätzlich an viele oder alle Geräte gerichtet sind.",
      "Im Gegensatz zu einfachen Bridges, die jedes Paket an alle Segmente weiterleiten, verbessert eine lernende Bridge die Netzwerkperformance erheblich und reduziert die Auslastung.",
      "Ein praktisches Beispiel: Wenn ein Drucker dauerhaft am Segment A hängt, wird sein Ort gelernt. Ein Paket, das an den Drucker gerichtet ist, wird nicht mehr unnötig auch an Segment B gesendet."
    ],
    "explanationJa": [
      "学習型ブリッジは、ネットワーク内の各機器がどのセグメントに存在するかを自動的に学習する高度な装置です。手動で設定を行う必要はありません。",
      "データフレームを受信すると、ブリッジはその送信元のMACアドレスを抽出し、それがどのセグメントから来たかを記憶します。この情報は内部テーブルに登録されます。",
      "その後、別のパケットが届いた際に、その宛先アドレスがテーブルにある場合は、該当セグメントのみにパケットを転送します。これにより、効率の良い通信が実現されます。",
      "この仕組みはフィルタリングと呼ばれ、無関係なセグメントにパケットが流れないようにすることで、帯域の浪費を防ぎ、セキュリティも向上させます。",
      "ただし、ブロードキャストやマルチキャストパケットは、ネットワーク全体に向けて送られるため、常にすべてのセグメントに配信されます。",
      "単純なブリッジはすべてのパケットを無差別に転送しますが、学習型ブリッジは必要最小限の通信だけを行うため、ネットワークの混雑を大幅に軽減できます。",
      "例として、プリンタがセグメントAに常に接続されている場合、一度位置を学習すれば、以降その宛先への通信はセグメントAのみに送られ、セグメントBには影響を与えません。"
    ],
    "originalSlideText": "Lernende Bridges und Filterung (1)\n\n❑ Bridge analysiert Ziel MAC Adresse des Frames\n❑ Unnötige Weiterleitungen werden verhindert → Filterung\n❑ Broadcast und Multicast werden immer weitergeleitet\n❑ Adaptive / Lernende Bridges lernen Orte der Computer automatisch\n❑ Source MAC Adresse wird extrahiert und zu Liste für Segment hinzugefügt",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 6,
    "questionDe": "(s10) (Mit Abbildung) Wie verändert sich die Segmentliste einer Bridge und wie entscheidet sie über die Weiterleitung?",
    "questionJa": "（図あり）ブリッジのセグメントリストはどのように変化し、どのように転送の可否を判断しますか？",
    "answerDe": [
      "Bridge beobachtet Verkehr zwischen Segmenten",
      "Segmentlisten werden aktualisiert basierend auf empfangener Quell-MAC-Adresse",
      "Bei bekanntem Zielsegment → gezielte Weiterleitung",
      "Bei unbekanntem Ziel → Broadcast an beide Segmente"
    ],
    "answerJa": [
      "ブリッジはセグメント間の通信を監視する",
      "受信した送信元MACアドレスに基づきセグメントリストを更新する",
      "宛先セグメントが既知の場合はそのセグメントにのみ送信する",
      "宛先が不明な場合は両セグメントにブロードキャストする"
    ],
    "explanationDe": [
      "Auf der Abbildung in der Folie ist ein LAN mit einer Bridge dargestellt, die zwei Segmente verbindet. Jeweils drei Computer befinden sich in Segment A und B.",
      "Die Bridge lernt im Laufe der Kommunikation, welche MAC-Adresse zu welchem Segment gehört. Diese Information speichert sie in sogenannten Segmentlisten.",
      "Wenn beispielsweise Computer 1 ein Paket an Computer 6 sendet, merkt sich die Bridge, dass Computer 1 im Segment A liegt. Falls sie noch nicht weiß, wo Computer 6 ist, wird das Paket an beide Segmente weitergeleitet.",
      "Sobald die Bridge durch eine Antwort oder andere Kommunikation erkennt, dass Computer 6 zu Segment B gehört, aktualisiert sie die Liste entsprechend.",
      "Zukünftige Pakete von Computer 1 an 6 werden dann gezielt nur an Segment B geschickt – eine gezielte Weiterleitung.",
      "Diese dynamische Aktualisierung der Segmentlisten ermöglicht eine optimierte Kommunikation mit minimaler Netzwerklast.",
      "Die Abbildung illustriert diesen Prozess visuell, indem sie zeigt, wie die Einträge in den Segmentlisten bei verschiedenen Ereignissen aktualisiert werden."
    ],
    "explanationJa": [
      "このスライドの図では、ブリッジで接続された2つのLANセグメント（各3台のコンピュータ）が示されています。ブリッジは通信の中継を行いながら、各MACアドレスがどちらのセグメントに属するかを学習します。",
      "たとえば、コンピュータ1からコンピュータ6にパケットが送信された場合、ブリッジはコンピュータ1のMACアドレスをセグメントAとして登録します。もしコンピュータ6のセグメントがまだわからなければ、そのパケットは両セグメントにブロードキャストされます。",
      "その後、コンピュータ6からの応答がブリッジに届けば、それを元にコンピュータ6がセグメントBにいることを学習し、セグメントリストに記録されます。",
      "これにより、次回以降はコンピュータ1から6への通信が、セグメントBのみに送られるようになり、ネットワークの負荷が軽減されます。",
      "このように、ブリッジは動的にリストを更新し、無駄なパケット転送を減らすことで効率的な通信を実現します。",
      "図ではこの過程が視覚的に示されており、フレーム送信のたびにどのようにセグメントリストが変化していくかが明確に描かれています。",
      "この動作は、ネットワークの自己最適化とも言える仕組みであり、小規模LANの構成において非常に有用です。"
    ],
    "originalSlideText": "Lernende Bridges und Filterung (2)\n\n❑ Beispiel von zwei LAN Segmenten mit einer Bridge\n❑ Veränderung der Segmentlisten nach bestimmten Ereignissen\n❑ Entscheidung, ob Frame in anderes Segment übertragen wird",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 7,
    "questionDe": "(s11) Warum kann eine Bridge die Leistung eines LANs verbessern?",
    "questionJa": "なぜブリッジはLANの性能を向上させることができるのですか？",
    "answerDe": [
      "Nach Lernphase ermöglicht Bridge bessere Performance als einzelnes LAN",
      "Simultane Übertragungen in beiden Segmenten möglich",
      "Beispiel: Kommunikation mit nah gelegenem Drucker statt entferntem",
      "Bridge im Modem isoliert Kundennetz vom ISP-Netz",
      "Lokale Kommunikation wird nicht an ISP weitergeleitet"
    ],
    "answerJa": [
      "学習が完了すると、単一のLANよりも高い性能を発揮できる",
      "2つのセグメントで同時に通信できる",
      "例：近くのプリンタとの通信が優先される",
      "モデム内のブリッジがISPとユーザーのネットワークを分離する",
      "ローカル通信はISP側に流れないようにされる"
    ],
    "explanationDe": [
      "Eine Bridge verbessert die Leistung eines LANs, indem sie das Netz in zwei Segmente aufteilt und dadurch parallele Kommunikation ermöglicht. Sobald die Bridge gelernt hat, welche Geräte sich in welchem Segment befinden, kann sie gezielt Pakete nur dorthin weiterleiten, wo sie gebraucht werden.",
      "Das reduziert unnötigen Datenverkehr im gesamten Netzwerk, da beispielsweise ein Druckauftrag nicht an alle Geräte gesendet wird, sondern nur an den Drucker im gleichen Segment.",
      "Die Segmentierung bedeutet auch, dass zwei Computer aus unterschiedlichen Segmenten gleichzeitig Daten senden können, ohne sich gegenseitig zu stören – das erhöht die gleichzeitige Übertragungskapazität.",
      "Ein praktisches Beispiel: Wenn sich ein Benutzer in Gebäude A befindet und dort einen Drucker verwendet, muss der Netzwerkverkehr nicht über das gesamte LAN mit Gebäude B laufen – die Bridge sorgt für die direkte Verbindung im lokalen Segment.",
      "Ein weiteres Beispiel ist die Verwendung von Bridges in Heimnetzwerken, etwa in DSL- oder Kabelmodems. Dort trennt die Bridge das Heimnetz vom Netzwerk des Internetanbieters (ISP).",
      "Diese Trennung bedeutet, dass Geräte im Heimnetz miteinander kommunizieren können, ohne dass der Verkehr über das Internet geroutet wird. Das spart Bandbreite und erhöht die Sicherheit.",
      "Im Gegensatz zu einem Hub, der alle Signale an alle Ports sendet, arbeitet eine Bridge gezielt und intelligent – das entlastet das Netzwerk und macht es leistungsfähiger."
    ],
    "explanationJa": [
      "ブリッジは、LANを2つのセグメントに分割して並列通信を可能にすることで、ネットワークの性能を向上させます。MACアドレス学習が進むと、必要なパケットだけを適切なセグメントに転送するようになります。",
      "これにより、ネットワーク全体に無駄なパケットが流れなくなり、たとえばプリンタへの印刷指示などが、他のデバイスに干渉せずに処理されます。",
      "2つのセグメントで別々の通信が同時に行えるため、ネットワーク全体の同時処理能力が高まります。これにより複数ユーザーの操作が互いに干渉しにくくなります。",
      "実例として、ユーザーが建物Aの中でプリンタを利用する場合、ブリッジはこの通信を建物内のセグメント内だけで完結させるため、他のセグメントに影響を与えません。",
      "また、家庭用のDSLモデムやケーブルモデムにもブリッジが内蔵されており、家庭内LANとインターネットプロバイダのネットワークを分離しています。",
      "この分離により、家庭内の機器同士の通信（例：NASとパソコン間など）はISPを経由せずに処理されるため、帯域を節約でき、通信速度と安全性も向上します。",
      "ハブのようにすべての信号を無差別に全ポートへ送信するのではなく、ブリッジは必要な通信のみを制御・転送するため、ネットワーク全体の効率を大幅に高めます。"
    ],
    "originalSlideText": "Performance einer Bridge\n\n❑ Nach Lernphase bessere Performance als einzelnes LAN erreichbar\n❑ Simultane Übertragungen in beiden Segmenten möglich\n❑ Bridge zwischen Gebäuden\n Computer kommuniziert eher mit nahem Drucker statt entferntem Drucker\n❑ Bridge zwischen ISP und Kunde in DSL- oder Kabelmodem\n Isoliert Netzwerk des Kunden von Netzwerk des ISP\n Lokale Kommunikation wird nicht an ISP geleitet",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 8,
    "questionDe": "(s12) Warum ist ein Distributed Spanning Tree (DST) in LANs notwendig?",
    "questionJa": "なぜLANでは分散スパニングツリー（DST）が必要なのですか？",
    "answerDe": [
      "Vor dem Hinzufügen von Bridge 4: normales Verhalten mit Broadcast/Multicast",
      "Nach Hinzufügen von Bridge 4 entsteht eine Schleife",
      "Broadcast wird endlos weitergeleitet → Netzwerküberlastung",
      "DST verhindert solche Schleifen durch Baumstruktur"
    ],
    "answerJa": [
      "ブリッジ4の追加前：ブロードキャストやマルチキャストは正常に機能していた",
      "ブリッジ4の追加によりループが発生する",
      "ブロードキャストが無限に送信され、ネットワークが過負荷になる",
      "DSTはツリー構造を形成し、こうしたループを防ぐために使われる"
    ],
    "explanationDe": [
      "Ein LAN mit mehreren Bridges kann schnell ungewollte Schleifen enthalten – insbesondere wenn eine neue Bridge, wie Bridge 4 im Beispiel, hinzugefügt wird.",
      "In einem solchen Fall wird ein Broadcast-Frame von einer Bridge empfangen und an das nächste Segment weitergeleitet – dort wiederum erneut empfangen und wieder zurückgeschickt. Dieser Vorgang wiederholt sich unendlich.",
      "Das führt zu einem Zustand, in dem Broadcasts permanent im Kreis geschickt werden, was die Netzwerkbandbreite vollständig blockieren kann. Dies bezeichnet man als Broadcast-Sturm.",
      "Solche Loops sind in Ethernet-Netzen besonders kritisch, da sie das gesamte Netzwerk unbrauchbar machen können – selbst wenn nur eine zusätzliche Verbindung eingeführt wurde.",
      "Ein Distributed Spanning Tree (DST) ist daher notwendig, um die physisch möglichen Schleifen logisch zu entfernen. DST definiert eine baumartige Struktur, in der jede Verbindung nur einmal existiert.",
      "Das Protokoll berechnet, welche Verbindungen aktiv bleiben dürfen, und welche blockiert werden müssen, um die Schleife zu unterbrechen – ohne die Konnektivität zu verlieren.",
      "Ohne ein solches Verfahren wie DST könnte ein modernes Ethernet-Netzwerk mit Redundanz nicht sicher betrieben werden, da jede Redundanzverbindung gleichzeitig auch eine potenzielle Gefahr darstellt."
    ],
    "explanationJa": [
      "複数のブリッジで構成されるLANでは、新しいブリッジ（たとえばスライド中のBridge 4）を追加すると、意図しないループが発生する可能性があります。",
      "このようなループがあると、あるブリッジで受信されたブロードキャストフレームが別のセグメントに送られ、そこでまた別のブリッジによって元のセグメントに戻されるという現象が無限に繰り返されます。",
      "このような無限ループ状態はブロードキャストストームと呼ばれ、ネットワーク帯域を完全に占有し、他の通信を阻害する深刻な問題となります。",
      "特にイーサネットにおいては、プロトコル上パケットの寿命が決まっていないため、ループはそのまま無制限に続き、ネットワーク全体を麻痺させる可能性があります。",
      "この問題を防ぐために導入されるのがDST（分散スパニングツリー）であり、論理的にループを排除するためにネットワーク構成をツリー状に再構築します。",
      "DSTは、物理的には複数経路があっても、ある特定のルールに従って経路を制限し、どの経路を使用するかを制御します。これにより、冗長性を保ちつつ安全な通信が可能になります。",
      "現代のネットワークでは、冗長構成が推奨される一方で、DSTのようなループ制御技術がなければ、安定運用は不可能です。"
    ],
    "originalSlideText": "Distributed Spanning Tree (1)\n\n❑ Bridge 4 soll eingefügt werden\n❑ Netzwerk funktioniert vorher wie erwartet\n Broadcast/Multicast wird von Bridge an anderes Segment weitergeleitet\n❑ Mit Bridge 4 entsteht eine Schleife → Broadcast wird endlos weitergeschickt",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 9,
    "questionDe": "(s13) Wie wird ein Distributed Spanning Tree (DST) gebildet und wie funktioniert das Spanning Tree Protocol (STP)?",
    "questionJa": "DST（分散スパニングツリー）はどのように形成され、Spanning Tree Protocol（STP）はどのように機能しますか？",
    "answerDe": [
      "Bridges berechnen einen Spanning Tree in Form eines Graphen",
      "Jede Bridge ist ein Knoten, Verbindungen sind Kanten",
      "STP wurde 1985 von DEC eingeführt",
      "Drei Schritte: Wahl der Wurzel, Berechnung des kürzesten Pfads, Weiterleitung",
      "Bridges kommunizieren über reservierte Multicast-Adresse: 01:80:C2:00:00:00"
    ],
    "answerJa": [
      "ブリッジはスパニングツリーとしてグラフを構築する",
      "各ブリッジがノード、接続がエッジ（辺）となる",
      "STPは1985年にDECによって提案された",
      "3つの手順：ルートの選出、最短経路の計算、パケットの転送制御",
      "ブリッジ同士は予約済みマルチキャストアドレスで通信する（01:80:C2:00:00:00）"
    ],
    "explanationDe": [
      "Das Distributed Spanning Tree Protocol (STP) wurde entwickelt, um logische Schleifen in Netzwerken mit redundanten Verbindungen zu verhindern. Es organisiert die Netzwerktopologie in Form eines Baumes (Spanning Tree), in dem es nur einen einzigen Pfad zwischen zwei Punkten gibt.",
      "Dabei wird jede Bridge als Knoten in einem Graphen betrachtet, und die Verbindungen zwischen den Bridges als Kanten. Ziel ist es, aus allen möglichen Verbindungen jene auszuwählen, die eine Schleifen-freie Struktur (Baum) bilden.",
      "Das ursprüngliche Spanning Tree Protocol wurde 1985 von Digital Equipment Corporation (DEC) eingeführt und ist seitdem mehrfach weiterentwickelt worden.",
      "Der Aufbau eines DST erfolgt in drei Schritten: Zunächst wählen die Bridges gemeinsam eine Root Bridge, also den zentralen Bezugspunkt. Danach berechnet jede Bridge den kürzesten Pfad zu dieser Root Bridge.",
      "Abschließend wird festgelegt, welche Ports aktiv bleiben und welche blockiert werden, um sicherzustellen, dass keine Schleifen entstehen. Nur die Ports auf dem kürzesten Pfad zur Wurzel dürfen weiterleiten.",
      "Zur Koordination dieser Aufgaben nutzen Bridges eine spezielle reservierte Multicast-Adresse (01:80:C2:00:00:00), über die sie regelmäßig Informationen austauschen.",
      "Dieses verteilte Verfahren erlaubt es dem Netzwerk, sich dynamisch an Topologieänderungen anzupassen, etwa wenn neue Verbindungen hinzukommen oder ausfallen."
    ],
    "explanationJa": [
      "分散スパニングツリー（DST）は、ネットワーク内に冗長な接続がある場合でも、ループが発生しないようにするための仕組みです。ネットワークをツリー構造として再構成することで、どの2点間にも1つの経路しか存在しないようにします。",
      "このツリー構造はグラフ理論に基づいており、各ブリッジがノード（頂点）、ブリッジ間のリンクがエッジ（辺）と見なされます。",
      "この仕組みを実現するためのプロトコルがSpanning Tree Protocol（STP）で、1985年にDEC（Digital Equipment Corporation）によって開発されました。",
      "DSTの構築には3つのステップがあります。まず、すべてのブリッジの中からルートブリッジ（基準となる中心ノード）を選びます。次に、各ブリッジがそのルートへの最短経路を計算します。",
      "最後に、ツリー構造を形成するために、どのポートを使用して通信を行い、どのポートをブロックするかを決定します。ループを防ぐために、不要な経路は遮断されます。",
      "このプロセスを実現するために、ブリッジ同士は特別に予約されたマルチキャストアドレス（01:80:C2:00:00:00）を使って情報を交換します。",
      "この分散的な仕組みにより、ネットワークは動的に構成変更（新しいリンクの追加や障害の発生）に対応し、ループのない安全な状態を自律的に維持できます。"
    ],
    "originalSlideText": "Distributed Spanning Tree (2)\n\n❑ Bridges berechnet Distributed Spanning Tree (DST)\n❑ Bildet einen Graphen: Bridge als Knoten, verbunden als Baum\n❑ Spanning Tree Protocol (STP): Ursprünglicher Ansatz von DEC 1985\n❑ Drei Schritte:\n Wahl der Wurzel\n Berechnung des kürzesten Pfad\n Weiterleitung\n❑ Bridges kommunizieren über reservierte Multicast Adresse 01:80:C2:00:00:00",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 10,
    "questionDe": "(s14) Wie funktionieren die Root-Wahl und Pfadberechnung im Spanning Tree Protocol?",
    "questionJa": "スパニングツリープロトコルでは、ルートの選出と最短経路の計算はどのように行われますか？",
    "answerDe": [
      "Root-Wahl: Jede Bridge sendet ihre ID als Multicast",
      "Bridge mit kleinster ID wird zur Root Bridge",
      "Pfadberechnung: Jede Bridge berechnet kürzesten Pfad zur Root",
      "Verbindungen entlang kürzestem Pfad bilden den Spanning Tree",
      "Nur Interfaces auf diesen Pfaden dürfen weiterleiten"
    ],
    "answerJa": [
      "ルート選出：各ブリッジが自身のIDをマルチキャストで送信する",
      "最も小さいIDを持つブリッジがルートブリッジとなる",
      "最短経路の計算：各ブリッジがルートまでの最短経路を計算する",
      "最短経路に含まれるリンクがスパニングツリーを構成する",
      "これらの経路上にあるインターフェースのみがパケットを転送できる"
    ],
    "explanationDe": [
      "Im Spanning Tree Protocol (STP) beginnt der Prozess mit der Wahl der Root Bridge, die als zentraler Referenzpunkt für das Netzwerk dient. Jede Bridge besitzt eine eindeutige ID, bestehend aus einer 16-Bit-Priorität und einer 48-Bit-MAC-Adresse.",
      "Diese IDs werden von jeder Bridge über die reservierte Multicast-Adresse gesendet. Die Bridge mit der kleinsten ID wird automatisch als Root Bridge gewählt, da niedrigere Werte bevorzugt werden.",
      "Sobald die Root Bridge feststeht, berechnet jede andere Bridge den kürzesten Pfad zur Root. Dabei wird der Pfad mit den geringsten Gesamtkosten gewählt – in einfachen Fällen ist das die Anzahl der Hops, es können aber auch andere Metriken wie Leitungskosten verwendet werden.",
      "Alle Verbindungen, die auf dem kürzesten Pfad zwischen einer Bridge und der Root Bridge liegen, bleiben aktiv. Sie bilden zusammen das Spanning Tree – also die logische Baumstruktur ohne Schleifen.",
      "Wichtig: Nur jene Ports, die Teil des kürzesten Pfads zur Root sind, bleiben offen. Alle anderen Ports werden blockiert, um Schleifen zu verhindern.",
      "Die Auswahl der Weiterleitungsports erfolgt automatisch und dezentral, also jede Bridge entscheidet für sich, basierend auf den empfangenen Informationen.",
      "Dieses Verfahren erlaubt dynamische Topologieanpassung: Fällt etwa die Root Bridge aus, wird eine neue Root gewählt und der Tree neu berechnet – ganz ohne menschliches Eingreifen."
    ],
    "explanationJa": [
      "Spanning Tree Protocol（STP）では、まずネットワーク内の中心となる「ルートブリッジ」を選出します。各ブリッジは、16ビットのプライオリティと48ビットのMACアドレスを組み合わせた一意のIDを持っています。",
      "各ブリッジはこのIDをネットワーク上にマルチキャストで送信し、最も小さなIDを持つブリッジが自動的にルートブリッジとして選ばれます。IDの数値が小さい方が優先されます。",
      "ルートブリッジが決定した後、すべてのブリッジはそのルートまでの最短経路を独自に計算します。経路の評価には、ホップ数やリンクのコストなどが使われます。",
      "こうして求められた最短経路上にある接続（ポート）は、アクティブな状態として使用され、ネットワーク全体で一つのツリー構造を形成します。",
      "このツリー構造に含まれないポートはすべてブロック状態となり、ループの発生を防ぎます。",
      "この経路選出は分散的に行われ、各ブリッジが受信した情報に基づいて自律的に判断します。中央の制御装置は不要です。",
      "さらに、ルートブリッジがダウンした場合でも、ネットワーク全体が自動的に再計算を行い、新たなルートを選定して安定性を維持する仕組みとなっています。"
    ],
    "originalSlideText": "Distributed Spanning Tree (3)\n\n❑ Wahl der Wurzel\n Bridge sendet ID als Multicast (16 Bit Priorität + 48 Bit MAC Adresse)\n Bridge mit kleinster ID wird genommen\n\n❑ Berechnung des kürzesten Pfad\n Jede Bridge berechnet kürzesten Pfad zu Wurzel\n Verbindungen in kürzestem Pfad aller Bridges bilden Spanning Tree\n\n❑ Weiterleitung\n Nur Interface mit Verbindung zu kürzestem Pfad darf weiterleiten",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 11,
    "questionDe": "(s15) Welche Varianten und Weiterentwicklungen des Spanning Tree Protocols gibt es?",
    "questionJa": "スパニングツリープロトコル（STP）にはどのような種類や発展版がありますか？",
    "answerDe": [
      "802.1d: 1990 von IEEE entwickelt, 1998 aktualisiert",
      "802.1q: Spanning Tree auf logisch unabhängigen Netzwerken mit gemeinsamem physischem Medium",
      "802.1w: Rapid Spanning Tree Protocol, schneller bei Topologieänderungen",
      "802.1d-2004: ersetzt STP durch Rapid Spanning Tree",
      "PVST, PVST+, MISTP, MSTP: Varianten mit mehreren parallelen Trees"
    ],
    "answerJa": [
      "802.1d：1990年にIEEEが策定、1998年に更新",
      "802.1q：同一物理ネットワーク上の論理的に独立したネットワークに対応",
      "802.1w：Rapid Spanning Tree Protocol。トポロジー変更時の反応が高速",
      "802.1d-2004：Rapid Spanning Treeを標準とし、従来のSTPを置き換えた",
      "PVST、PVST+、MISTP、MSTP：複数のスパニングツリーを並行して扱えるバージョン"
    ],
    "explanationDe": [
      "Seit der ursprünglichen Einführung des Spanning Tree Protocols (STP) durch DEC im Jahr 1985 wurden zahlreiche Varianten und Verbesserungen entwickelt, um moderne Anforderungen zu erfüllen.",
      "IEEE 802.1d war der erste offizielle Standard für STP, veröffentlicht 1990 und zuletzt 1998 aktualisiert. Dieser Standard wurde weit verbreitet, war jedoch langsam bei der Reaktion auf Netzwerkänderungen.",
      "Um die Konvergenzzeit zu verkürzen, wurde 1998 das Rapid Spanning Tree Protocol (RSTP) unter dem Standard IEEE 802.1w eingeführt. RSTP erkennt Änderungen in der Netzwerktopologie deutlich schneller als klassisches STP und ermöglicht so eine unterbrechungsärmere Kommunikation.",
      "Die Version 802.1d-2004 ersetzte schließlich das ursprüngliche STP vollständig durch RSTP, was diesen zum neuen Standard machte.",
      "IEEE 802.1q erweitert STP auf VLAN-Umgebungen: Es erlaubt logisch unabhängige Netzwerke (VLANs) auf einem gemeinsamen physischen Medium, jeweils mit eigenem Spanning Tree.",
      "Neben den IEEE-Standards gibt es auch herstellerspezifische Erweiterungen wie PVST (Per-VLAN Spanning Tree) und PVST+ von Cisco, die es ermöglichen, für jedes VLAN einen eigenen Spanning Tree zu berechnen.",
      "MISTP und MSTP (Multiple Spanning Tree Protocol) sind ebenfalls darauf ausgelegt, mehrere VLANs effizient zu unterstützen, wobei mehrere VLANs denselben Spanning Tree gemeinsam nutzen können – das spart Ressourcen und steigert die Skalierbarkeit."
    ],
    "explanationJa": [
      "スパニングツリープロトコル（STP）は1985年にDECによって導入されて以来、さまざまなバージョンと改良が加えられてきました。現代のネットワーク要件に対応するための標準化と高速化が主な目的です。",
      "IEEE 802.1dは1990年に初めて標準化されたSTPで、1998年には更新されました。しかし、この標準はネットワーク構成が変わった際の反応が遅く、再収束に時間がかかるという欠点がありました。",
      "この課題を解決するために、1998年にはRapid Spanning Tree Protocol（RSTP）がIEEE 802.1wとして導入されました。RSTPはネットワークのトポロジーが変化した際に、より高速に再構成が行えるのが特徴です。",
      "2004年には、IEEE 802.1dが改訂され、RSTPが新たな標準プロトコルとして採用されました。これにより、従来のSTPは実質的に置き換えられました。",
      "また、IEEE 802.1qはVLAN（仮想LAN）環境でのスパニングツリーに対応した規格で、同一の物理ネットワーク上で複数の論理ネットワークが独立してスパニングツリーを形成できます。",
      "Ciscoなどのベンダーは、Per-VLAN Spanning Tree（PVST）やその強化版であるPVST+を導入し、各VLANごとに独立したスパニングツリーを構築できるようにしています。",
      "さらに、MISTP（Multiple Instance Spanning Tree Protocol）やMSTP（Multiple Spanning Tree Protocol）では、複数のVLANが同一のスパニングツリーを共有できるため、ネットワーク規模が大きくなっても効率的に運用できます。"
    ],
    "originalSlideText": "Weitere DST Algorithmen\n\n❑ 802.1d: 1990 von IEEE entwickelt, 1998 aktualisiert\n❑ 802.1q: Spanning Tree auf logisch unabhängigen Netzwerken mit gemeinsamem, physischem Medium\n❑ 802.1w: 1998 von IEEE, Einführung von Rapid Spanning Tree Protocol mit verbesserter Geschwindigkeit nach Topologieänderung\n❑ 801.1d-2004: Mit Rapid Spanning Tree, ersetzt STP\n❑ Zusätzlich: Per-VLAN Spanning Tree (PVST), PVST+, Multiple Instance Spanning Tree Protocol (MISTP), Multiple Spanning Tree Protocol (MSTP)",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 12,
    "questionDe": "(s16) Was ist ein Layer 2 Switch und wie unterscheidet er sich von einem Hub?",
    "questionJa": "レイヤ2スイッチとは何ですか？Hubとの違いは何ですか？",
    "answerDe": [
      "Layer 2 Switch arbeitet auf der Data Link Layer (Ethernet)",
      "Besitzt mehrere Ports für einzelne Computer",
      "Computer kann Frames gezielt an andere Computer am Switch senden",
      "Hub ist analog und leitet alle Signale weiter",
      "Switch ist digital und leitet Pakete gezielt weiter",
      "Switch simuliert Netzwerk mit Bridges und dedizierten Segmenten"
    ],
    "answerJa": [
      "レイヤ2スイッチはデータリンク層（Ethernet）で動作する",
      "複数のポートを持ち、それぞれのポートにPCを接続できる",
      "あるコンピュータから他の特定のコンピュータにフレームを直接送信できる",
      "Hubはアナログ機器で、信号を全ポートにそのまま送信する",
      "スイッチはデジタル機器で、パケットを特定の宛先にのみ転送する",
      "スイッチは、ブリッジと1セグメント1台の構成を仮想的に再現する"
    ],
    "explanationDe": [
      "Ein Layer 2 Switch ist ein Netzwerkgerät, das auf der Schicht 2 (Data Link Layer) des OSI-Modells arbeitet, typischerweise mit Ethernet als Protokoll. Er ermöglicht gezielte Kommunikation zwischen Geräten, die an seine Ports angeschlossen sind.",
      "Jeder Port des Switches ist einem einzelnen Gerät zugewiesen. Wenn ein Gerät ein Paket sendet, analysiert der Switch die Ziel-MAC-Adresse und leitet das Paket nur an den entsprechenden Port weiter, nicht an alle.",
      "Im Gegensatz dazu arbeitet ein Hub rein analog und agiert als Verteiler: Er sendet jedes empfangene Signal an alle anderen Ports – unabhängig vom Ziel. Das erzeugt unnötigen Verkehr und mögliche Kollisionen.",
      "Ein Layer 2 Switch hingegen reduziert diesen überflüssigen Datenverkehr erheblich und erhöht die Effizienz des Netzwerks durch gezielte Weiterleitung.",
      "Man kann sich den Switch als eine Sammlung interner Bridges vorstellen, wobei jeder Port ein eigenes Segment darstellt. Das bedeutet, dass jedes angeschlossene Gerät eine eigene Verbindung hat, ohne sie mit anderen zu teilen.",
      "Durch diese Architektur können Switches eine parallele Kommunikation mehrerer Paare von Geräten ermöglichen, was in einem Hub-basierten Netz nicht möglich ist.",
      "Kurz gesagt: Ein Switch ersetzt den Hub in modernen Netzwerken vollständig und ermöglicht intelligente, kollisionsfreie und schnelle Datenübertragung innerhalb eines LANs."
    ],
    "explanationJa": [
      "レイヤ2スイッチとは、OSI参照モデルの第2層（データリンク層）で動作するネットワーク装置で、主にEthernet通信を制御するのに使用されます。複数のポートを持ち、各ポートに1台ずつ機器を接続できます。",
      "スイッチは受信したパケットの宛先MACアドレスを解析し、それに対応するポートのみにパケットを転送します。つまり、必要な相手にのみ通信を届けることができます。",
      "一方、Hubはアナログ機器であり、受信した信号を全ポートに無条件で送信します。そのため、ネットワーク上に不必要なデータが流れ、衝突（コリジョン）が起きやすくなります。",
      "スイッチはこうした衝突を回避し、効率的なデータ転送を実現します。また、スイッチは1ポート＝1セグメントと見なされ、内部的には複数のブリッジが統合されているような構造になっています。",
      "この構成により、複数の通信が同時に行えるため、ネットワークのパフォーマンスが向上します。たとえば、PC AとPC Bが通信中でも、同時にPC CとPC Dも通信できます。",
      "このように、スイッチはHubの欠点を解消し、現代のLANではHubを完全に置き換える存在となっています。",
      "特に、企業ネットワークや家庭のインターネット環境では、スイッチの導入が標準となっており、信頼性と速度の両面で大きな利点があります。"
    ],
    "originalSlideText": "Switching und Layer 2 Switch (1)\n\n❑ Ethernet Switch (Level 2 Switch)\n❑ Ähnlich zu einem Hub\n Mehrere Ports für einzelne Computer\n Computer kann Frame an anderen Computer am Switch senden\n❑ Hub ist analoges Gerät und leitet Signale weiter\n Simuliert geteiltes Übertragungsmedium\n❑ Switch ist digitales Gerät und leitet Pakete weiter\n Simuliert Netzwerk mit Bridges und einem Computer pro Segment",
    "explanationImage": "",
    "questionImage": ""
  },
  {
    "id": 13,
    "questionDe": "(s17) Wie ist das Konzept eines Layer 2 Switches aufgebaut?",
    "questionJa": "レイヤ2スイッチの概念モデルはどのように構成されていますか？",
    "answerDe": [
      "Konzept eines Switches zeigt abstraktes Modell des Datenflusses",
      "Nicht identisch mit tatsächlichem physischem Aufbau",
      "Stellt logische Verbindungen zwischen Ports dar",
      "Visualisiert, wie Pakete zwischen Interfaces geroutet werden"
    ],
    "answerJa": [
      "スイッチの概念モデルはデータの流れを抽象的に表現したもの",
      "実際の物理構造とは異なる",
      "ポート間の論理的な接続を示す",
      "パケットがインターフェース間でどのようにルーティングされるかを視覚化している"
    ],
    "explanationDe": [
      "Ein Layer 2 Switch besitzt ein internes Konzept, das den logischen Datenfluss innerhalb des Geräts beschreibt. Diese Darstellung dient dazu, zu erklären, wie Pakete zwischen den verschiedenen Ports weitergeleitet werden.",
      "Die in der Folie gezeigte Illustration ist eine vereinfachte, abstrakte Darstellung – sie spiegelt nicht exakt den physischen Aufbau eines realen Switches wider.",
      "In diesem Modell sind alle Ports miteinander über eine interne Switching-Einheit verbunden, sodass Daten gezielt zwischen je zwei Ports weitergeleitet werden können.",
      "Das Ziel der Darstellung ist es, zu zeigen, dass nicht alle Ports gleichzeitig miteinander kommunizieren müssen, sondern gezielte Punkt-zu-Punkt-Verbindungen möglich sind.",
      "Dieses Prinzip erlaubt es dem Switch, gleichzeitige Datenübertragungen zwischen verschiedenen Portpaaren zu verarbeiten – vorausgesetzt, die jeweiligen Zielports sind nicht beschäftigt.",
      "Ein solches Modell hilft beim Verständnis der parallelen Kommunikationsfähigkeit eines Switches, die ihn vom Hub unterscheidet, bei dem alle Ports das gleiche Signal empfangen.",
      "Obwohl das gezeigte Modell technisch nicht exakt ist, vermittelt es das grundlegende Funktionsprinzip und ist besonders nützlich in der Netzwerkausbildung."
    ],
    "explanationJa": [
      "レイヤ2スイッチには、装置内のデータの流れを説明するための概念的なモデルがあります。このモデルは、複数のポート間でどのようにパケットが転送されるのかを理解する助けとなります。",
      "スライドに示されている図はあくまで抽象的なものであり、実際のスイッチの物理的な構造を正確に表しているわけではありません。",
      "このモデルでは、各ポートが内部のスイッチングユニットによって論理的に接続されており、必要に応じて2つのポート間で直接通信を行えるようになっています。",
      "すべてのポートが一斉に通信するのではなく、特定のポートペア同士だけが通信する仕組みが視覚的に示されています。",
      "これにより、スイッチは異なるポートペア間で同時に複数の通信を処理することができ、ポートが空いていれば並列通信も可能です。",
      "このモデルは、ハブと異なり、スイッチがパケットを必要な場所にのみ送ることができるという重要な違いを理解するために役立ちます。",
      "技術的には簡略化された図ですが、スイッチの基本的な動作原理を理解するための教材として非常に有効です。"
    ],
    "originalSlideText": "Switching und Layer 2 Switch (2)\n\n❑ Konzept eines Switches\n❑ Entspricht nicht tatsächlichem Aufbau des Switch",
    "explanationImage": "",
    "questionImage": ""
  },
  {
  "id": 14,
  "questionDe": "(s18) Wie funktioniert ein Layer 2 Switch intern?",
  "questionJa": "レイヤ2スイッチは内部でどのように動作していますか？",
  "answerDe": [
    "Jeder Port besitzt ein intelligentes Interface",
    "Interfaces enthalten Prozessor, Speicher und Hardware",
    "Pakete werden gepuffert, falls Ausgangsport belegt ist",
    "Zentrale Fabric erlaubt simultane Übertragung zwischen Interface-Paaren"
  ],
  "answerJa": [
    "各ポートにはインテリジェントインターフェースが備わっている",
    "インターフェースにはプロセッサ、メモリ、専用ハードウェアが含まれている",
    "出力ポートが使用中の場合、パケットは一時的にバッファされる",
    "中央のファブリックがポート間の同時通信を可能にしている"
  ],
  "explanationDe": [
    "Ein moderner Layer 2 Switch besitzt pro Port ein sogenanntes intelligentes Interface. Dieses Interface ist nicht nur ein einfacher Anschluss, sondern enthält eigene Hardware wie einen Mikroprozessor, Speicher und Steuerlogik.",
    "Diese Architektur ermöglicht es dem Switch, eingehende Pakete zunächst lokal im Interface zu speichern (Puffern), wenn der entsprechende Ausgangsport gerade ausgelastet ist.",
    "Das bedeutet, dass Daten nicht sofort verloren gehen, sondern vorübergehend zwischengespeichert werden können, bis der Ausgang frei ist. Dadurch wird die Effizienz und Stabilität des Netzwerks erhöht.",
    "Im Zentrum des Switches befindet sich die sogenannte 'Fabric' – eine interne Schaltmatrix, die es erlaubt, mehrere Interface-Paare gleichzeitig miteinander zu verbinden.",
    "Die zentrale Fabric sorgt dafür, dass mehrere Datenübertragungen zwischen verschiedenen Ports simultan stattfinden können, solange sich die Pfade nicht überschneiden.",
    "Ein einfaches Beispiel: Computer A sendet Daten an B, während gleichzeitig C mit D kommuniziert. Solche parallelen Verbindungen wären mit einem Hub oder ohne zentrale Fabric nicht möglich.",
    "Diese interne Struktur macht Switches besonders leistungsfähig und erklärt, warum sie in modernen Netzwerken den Hub vollständig ersetzt haben."
  ],
  "explanationJa": [
    "現代のレイヤ2スイッチでは、各ポートに「インテリジェントインターフェース」と呼ばれる高度な制御回路が搭載されています。このインターフェースには、プロセッサやメモリ、その他の制御用ハードウェアが含まれています。",
    "この構造により、スイッチは受信したパケットをすぐに出力できない場合でも、一時的にインターフェース内でバッファリング（保管）することができます。これによりパケットロスを防ぎ、通信の安定性が向上します。",
    "スイッチ内部の中央部には「ファブリック」と呼ばれるスイッチングマトリックスがあり、これが複数のポートペア間で同時に通信を行うことを可能にしています。",
    "この仕組みにより、たとえばPC AとBが通信している間に、同時にPC CとDが通信するといった並列通信が可能です。これらの通信は互いに干渉せずに処理されます。",
    "Hubのように全ポートに信号を同時送信する方式とは異なり、スイッチは必要な通信経路のみを選択的に接続します。",
    "この並列処理能力と効率の良さが、スイッチが現代ネットワークの主流となっている理由です。",
    "インターフェースとファブリックの協調動作により、スイッチは高負荷な環境でも安定して高速な通信を実現できるのです。"
  ],
  "originalSlideText": "Switching und Layer 2 Switch (3)\n\n❑ Jeder Port mit Intelligent Interface (enthält Prozessor, Speicher, andere Hardware)\n Kann Pakete in Speicher puffern, falls Output Port beschäftigt\n❑ Zentrale Fabric: Erlaubt simultane Übertragungen zwischen jeweils zwei Interfaces",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 15,
  "questionDe": "(s19) Warum ermöglichen Switches parallele Übertragungen und wie skalieren sie im Netzwerk?",
  "questionJa": "なぜスイッチは並列通信を可能にし、ネットワーク内でどのようにスケーラブルなのですか？",
  "answerDe": [
    "Hauptvorteil gegenüber Hub: parallele Übertragungen",
    "Übertragungen müssen unabhängig sein (pro Port nur ein Paket gleichzeitig)",
    "Ein Switch mit N Ports erlaubt N/2 gleichzeitige Übertragungen",
    "Switches gibt es von 4 Ports (Heimnetz) bis über 1000 Ports (ISPs)"
  ],
  "answerJa": [
    "Hubに対する最大の利点は並列通信が可能なこと",
    "通信は互いに独立しており、1ポートにつき同時に1パケットのみ送信される",
    "Nポートのスイッチでは最大でN/2の同時通信が可能",
    "スイッチは家庭用の4ポートからISP向けの1000ポート超まで存在する"
  ],
  "explanationDe": [
    "Ein wesentlicher Vorteil von Layer 2 Switches gegenüber Hubs ist ihre Fähigkeit zur gleichzeitigen Durchführung mehrerer Übertragungen – dies wird als parallele Kommunikation bezeichnet.",
    "Während ein Hub jedes eingehende Signal an alle anderen Ports weiterleitet, kann ein Switch gezielt zwei Ports miteinander verbinden. Dadurch kann z. B. Computer A gleichzeitig mit Computer B kommunizieren, während Computer C mit D Daten austauscht.",
    "Voraussetzung für parallele Kommunikation ist, dass keine Konflikte an den Ports entstehen – d. h. jeder Port kann zu einem bestimmten Zeitpunkt nur an einer Übertragung beteiligt sein.",
    "Ein Switch mit N Ports kann also im Idealfall N/2 unabhängige Übertragungen gleichzeitig durchführen – jede Übertragung besteht aus einem Sender- und einem Empfängerport.",
    "Diese Architektur macht Switches besonders skalierbar. Je nach Anwendung gibt es kompakte Switches mit 4 oder 8 Ports für Heimnetzwerke, bis hin zu professionellen Switches mit hunderten oder sogar über 1000 Ports für Unternehmen und Internetdienstanbieter.",
    "Solche großen Switches verfügen über erweiterte Verwaltungsfunktionen, hohe Bandbreite, VLAN-Unterstützung und Redundanzmechanismen, um auch bei hoher Last stabil zu funktionieren.",
    "Durch diese Skalierbarkeit sind Switches in nahezu allen Netzwerkumgebungen – vom Wohnzimmer bis zum Rechenzentrum – das bevorzugte Gerät zur strukturierten, effizienten Netzverbindung."
  ],
  "explanationJa": [
    "レイヤ2スイッチの最大の利点は、複数の通信を同時に処理できる「並列通信機能」にあります。これはHubにはない特徴です。",
    "Hubは受信した信号をすべてのポートに無差別に転送するため、同時通信ができず、衝突が発生しやすくなります。これに対してスイッチは、2つのポート間だけに通信を限定し、他の通信に干渉しません。",
    "ただし、1つのポートは同時に1つの通信にしか関与できないため、Nポートのスイッチでは理論上最大N/2の通信が同時に可能です（送信と受信で2ポートを使うため）。",
    "この構造により、スイッチは高いスループットを維持しながらも、効率的なネットワーク運用を実現できます。",
    "スイッチは用途に応じてさまざまなサイズが存在し、家庭向けの4ポートスイッチから、企業やISPで使われる1000ポート以上の大規模スイッチまで幅広く展開されています。",
    "大型スイッチには、VLANやリンクアグリゲーション、帯域制御、冗長化といった高度な機能も備わっており、複雑なネットワーク環境でも安定した通信を提供できます。",
    "このように、スイッチはその並列処理能力とスケーラビリティにより、小規模から大規模まであらゆるネットワークの中核を担う装置として広く使われています。"
  ],
  "originalSlideText": "Switching und Layer 2 Switch (4)\n\n❑ Wichtigster Vorteil gegenüber HUB ist parallele Übertragung\n❑ Übertragungen müssen unabhängig sein (nur ein Paket an einen Port zu Zeitpunkt)\n❑ Switch mit N Ports und N Computern schafft N/2 Übertragungen gleichzeitig\n❑ Switches können zwischen wenigen Ports (z.B. 4 für Heimnetzwerk) und über 1000 Ports (Firmen, ISPs) variieren",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 16,
  "questionDe": "(s24) Welche Komponenten und Technologien ermöglichen den Aufbau von LANs über größere Entfernungen?",
  "questionJa": "LANを広い距離にわたって構築するためには、どのようなコンポーネントや技術が必要ですか？",
  "answerDe": [
    "Fiber Modem verbindet entfernte Computer mit LAN",
    "Repeater verstärkt elektrische Signale",
    "Bridge verbindet zwei LAN-Segmente und überträgt Pakete",
    "Bridge lernt Zugehörigkeit von Geräten zu Segmenten und filtert Pakete",
    "Switch verbindet mehrere Computer direkt",
    "Im Gegensatz zu Hub erlaubt Switch parallele Übertragungen",
    "VLAN-Switch simuliert mehrere unabhängige Switches"
  ],
  "answerJa": [
    "ファイバーモデムは離れたコンピュータをLANに接続する",
    "リピータは電気信号を増幅する",
    "ブリッジは2つのLANセグメントを接続し、パケットを転送する",
    "ブリッジは機器の所属セグメントを学習してパケットをフィルタリングする",
    "スイッチは複数のコンピュータを直接接続する",
    "Hubと異なり、スイッチは並列通信が可能である",
    "VLANスイッチは複数の独立したスイッチを仮想的に再現する"
  ],
  "explanationDe": [
    "Um ein LAN über größere Entfernungen hinweg aufzubauen oder zu erweitern, werden mehrere Technologien und Geräte eingesetzt, die unterschiedliche Aufgaben erfüllen.",
    "Ein Fiber Modem nutzt Glasfaserverbindungen, um weit entfernte Computer mit einem LAN zu verbinden. Es stellt eine transparente Verbindung bereit und ermöglicht so hohe Übertragungsraten über große Distanzen.",
    "Repeater werden verwendet, um elektrische Signale zu verstärken und so die maximale Kabellänge zu erweitern – sie sind jedoch rein analog und kennen keine Paketstruktur.",
    "Bridges verbinden zwei LAN-Segmente und lernen automatisch, welche MAC-Adresse zu welchem Segment gehört. Sie filtern gezielt Pakete, um unnötigen Datenverkehr zu vermeiden.",
    "Switches stellen eine Weiterentwicklung der Bridge dar und ermöglichen, dass viele Computer gleichzeitig, effizient und unabhängig kommunizieren können. Sie arbeiten auf Layer 2 und analysieren MAC-Adressen.",
    "Im Gegensatz zu Hubs leiten Switches Pakete gezielt weiter, was parallele Übertragungen ohne Kollisionen ermöglicht – ein entscheidender Vorteil für Performance und Skalierbarkeit.",
    "Ein VLAN-Switch geht noch weiter, indem er mehrere virtuelle Netzwerke (VLANs) innerhalb eines physischen Switches verwaltet. So können Netzwerke logisch getrennt, aber physisch gemeinsam betrieben werden – ideal für große Organisationen."
  ],
  "explanationJa": [
    "LANをより広範囲に拡張するには、さまざまな技術とネットワーク機器が用いられます。それぞれの役割を理解することが重要です。",
    "ファイバーモデムは、光ファイバーを使用して遠く離れたコンピュータをLANに接続します。高速で安定した通信が可能であり、拠点間の接続によく使われます。",
    "リピータは電気信号を単純に増幅し、信号が弱まることによる伝送距離の制限を克服します。パケットの意味は理解せず、全体をそのまま中継します。",
    "ブリッジは異なるLANセグメントを接続し、MACアドレスを学習してパケットの必要な宛先だけに転送することで、ネットワークの混雑を防ぎます。",
    "スイッチはブリッジの発展形で、複数のコンピュータが同時に独立して通信できる環境を提供します。MACアドレスに基づく転送で効率的な通信を実現します。",
    "Hubとは異なり、スイッチは衝突のないパラレル通信が可能です。これにより、ネットワークのパフォーマンスと安定性が大幅に向上します。",
    "さらにVLAN対応スイッチを使えば、1台の物理スイッチ上に複数の仮想ネットワークを構成することができ、大規模ネットワークの柔軟な運用が可能になります。"
  ],
  "originalSlideText": "Zusammenfassung\n\n❑ Mehrere Mechanismen um LANs über größere Entfernungen aufzubauen\n❑ Fiber Modem um entfernten Computer mit LAN zu verbinden\n❑ Repeater verstärkt elektrische Signale\n❑ Bridge verbindet zwei LAN Segmente und überträgt Pakete\n Lernt Zugehörigkeit zu Segmenten und filtert Pakete\n❑ Switch verbindet mehrere Computer untereinander\n Erlaubt im Gegensatz zu Hub parallele Übertragungen\n VLAN Switch simuliert mehrere Switches",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 17,
  "questionDe": "(s26) Wie werden Netzwerktechnologien anhand der überbrückten Distanz klassifiziert?",
  "questionJa": "ネットワーク技術は、通信距離に基づいてどのように分類されますか？",
  "answerDe": [
    "PAN (Personal Area Network): Bereich um eine einzelne Person",
    "LAN (Local Area Network): Innerhalb eines Gebäudes oder Campus",
    "MAN (Metropolitan Area Network): Gebiet einer großen Stadt",
    "WAN (Wide Area Network): Verbindungen über Städte oder Länder hinweg"
  ],
  "answerJa": [
    "PAN（パーソナルエリアネットワーク）：個人の周囲の範囲",
    "LAN（ローカルエリアネットワーク）：建物内やキャンパス内",
    "MAN（メトロポリタンエリアネットワーク）：都市レベルのエリア",
    "WAN（ワイドエリアネットワーク）：都市間や国を超えた接続"
  ],
  "explanationDe": [
    "Netzwerktechnologien lassen sich grob anhand der geographischen Ausdehnung des Kommunikationsbereichs in vier Kategorien einteilen: PAN, LAN, MAN und WAN.",
    "Ein PAN (Personal Area Network) deckt den unmittelbaren Bereich um eine Person ab – zum Beispiel Bluetooth zwischen Smartphone und Kopfhörer.",
    "Ein LAN (Local Area Network) ist typischerweise auf ein einzelnes Gebäude oder einen Campus begrenzt. Es ist auf hohe Geschwindigkeit bei kurzer Reichweite ausgelegt, z. B. Ethernet im Büro.",
    "Ein MAN (Metropolitan Area Network) erstreckt sich über eine ganze Stadt. Es verbindet mehrere LANs in unterschiedlichen Gebäuden oder Bezirken einer Metropole.",
    "Ein WAN (Wide Area Network) verbindet Netzwerke über sehr große Distanzen hinweg – etwa von Stadt zu Stadt oder zwischen verschiedenen Ländern. Das Internet ist ein typisches Beispiel für ein WAN.",
    "Diese Klassifikation ist wichtig, weil jede Netzart unterschiedliche Anforderungen an Technologie, Geschwindigkeit, Sicherheit und Verwaltung hat.",
    "Beispielsweise benötigt ein WAN komplexes Routing, Redundanz und Fehlertoleranz, während ein LAN eher auf Performance und einfache Verwaltung optimiert ist."
  ],
  "explanationJa": [
    "ネットワーク技術は、その通信範囲（距離）に応じて大きく4つに分類されます：PAN、LAN、MAN、WANです。",
    "PAN（パーソナルエリアネットワーク）は、個人の周辺、たとえばスマートフォンとワイヤレスイヤホンのBluetooth接続など、ごく短距離の通信を指します。",
    "LAN（ローカルエリアネットワーク）は、建物内や学校・会社のキャンパス内など、比較的狭い範囲で使用されるネットワークです。高速通信が求められ、Ethernetなどが典型的です。",
    "MAN（メトロポリタンエリアネットワーク）は都市規模のネットワークで、異なる建物や区画にある複数のLANをつないで1つのネットワークにするものです。",
    "WAN（ワイドエリアネットワーク）は、都市間や国際間など、広大な距離を超えて複数のネットワークを接続するためのものです。インターネットが代表例です。",
    "このような分類は、ネットワークの構成や選定すべき技術、必要な設備を判断するうえで非常に重要です。",
    "たとえば、WANではルーティング技術や冗長構成、障害対策などが重要になる一方、LANでは速度と管理のしやすさが重視されます。"
  ],
  "originalSlideText": "WAN (1)\n\n❑ Netzwerktechnologien können nach der überbrückten Distanz klassifiziert werden\n PAN: Region um eine Person\n LAN: Gebäude oder Campus\n MAN: Gebiet einer großen Stadt\n WAN: Mehrere Städte oder Länder",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 18,
  "questionDe": "(s27) Was unterscheidet ein WAN von einem LAN?",
  "questionJa": "WANはLANと何が違うのですか？",
  "answerDe": [
    "WAN verbindet geographisch entfernte Standorte",
    "LAN ist lokal begrenzt (z. B. Gebäude oder Campus)",
    "WAN erfordert hohe Skalierbarkeit",
    "WAN muss bei Bedarf wachsen können",
    "WAN muss bei großer Entfernung gute Performance liefern"
  ],
  "answerJa": [
    "WANは地理的に離れた拠点同士を接続する",
    "LANは建物やキャンパスなど限定された範囲内で使用される",
    "WANには高いスケーラビリティ（拡張性）が求められる",
    "WANは必要に応じて拡張できる設計が必要",
    "WANは距離が離れていても安定した性能を維持しなければならない"
  ],
  "explanationDe": [
    "Der Hauptunterschied zwischen einem WAN (Wide Area Network) und einem LAN (Local Area Network) liegt im geographischen Ausmaß und in den technischen Anforderungen.",
    "Ein LAN beschränkt sich typischerweise auf ein einzelnes Gebäude oder einen Campus. Es verwendet einfache, kostengünstige Technik mit hoher Geschwindigkeit, aber kurzer Reichweite.",
    "Im Gegensatz dazu verbindet ein WAN mehrere weit voneinander entfernte Standorte – beispielsweise verschiedene Niederlassungen einer Firma oder Länder weltweit.",
    "WANs müssen skalierbar sein, also mit steigender Anzahl an Teilnehmern und Standorten wachsen können, ohne die Leistung zu verlieren.",
    "Die zugrunde liegenden Technologien müssen darauf ausgelegt sein, auch bei hohen Entfernungen zuverlässige und performante Kommunikation zu gewährleisten. Dies erfordert z. B. effizientes Routing, Fehlertoleranz und Bandbreitenmanagement.",
    "Ein Beispiel: Zwei LANs in verschiedenen Städten können über ein WAN (z. B. VPN über das Internet) verbunden werden. Trotz der Distanz müssen die Daten sicher und mit vertretbarer Verzögerung übertragen werden.",
    "Zusammengefasst: LANs sind lokal, einfach und schnell; WANs sind global, komplex und auf Erweiterbarkeit sowie Verfügbarkeit optimiert."
  ],
  "explanationJa": [
    "WAN（ワイドエリアネットワーク）とLAN（ローカルエリアネットワーク）の違いは、主に通信距離と技術的要件にあります。",
    "LANは建物内やキャンパスなど、比較的狭い範囲で使用されるネットワークで、高速通信が可能ですが距離には制限があります。",
    "一方、WANは地理的に離れた複数の拠点、あるいは国や大陸をまたいでネットワークを構築するための技術です。",
    "WANには、将来的に拠点数が増えたり接続先が広がったりする場合でも対応できる「スケーラビリティ（拡張性）」が求められます。",
    "また、距離が長くなることで遅延やパケットロスが起こりやすくなるため、それらを補うためのルーティング技術、誤り訂正、帯域管理なども重要になります。",
    "たとえば、東京と大阪の拠点をつなぐVPN回線もWANの一例です。距離が離れていても、安定して通信できることが求められます。",
    "要するに、LANはシンプルで高速な近距離ネットワーク、WANは高度な制御が必要な長距離ネットワークという違いがあります。"
  ],
  "originalSlideText": "WAN (2)\n\n❑ WAN oder LAN?\n Firma mit Satellit-Bridge zwischen zwei LANs nur ein erweitertes LAN\n❑ WAN und LAN unterscheiden sich in Skalierbarkeit\n❑ WAN muss bei Bedarf wachsen können um viele geographische Standorte zu verbinden\n❑ WAN-Technologie muss angemessene Performance für großes Netzwerk liefern",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 19,
  "questionDe": "(s28) Wie war die ursprüngliche Architektur von WANs aufgebaut?",
  "questionJa": "WANの初期のアーキテクチャはどのような構成でしたか？",
  "answerDe": [
    "Moderne WANs nutzen Internettechnologie über große Distanzen",
    "Verbindung über Router an jedem Standort",
    "Früher: Entwicklung vor Internet und LANs",
    "WANs begannen als Long-Haul-Networks",
    "Verbindungen zwischen wenigen Computern an vielen Standorten",
    "Packet Switch verbindet lokale Computer und Datenleitungen zu anderen Standorten"
  ],
  "answerJa": [
    "現代のWANはインターネット技術を使って長距離を接続している",
    "各拠点にルーターを設置して接続する",
    "初期のWANはインターネットやLANが登場する以前に開発された",
    "初期のWANはロングホールネットワークとして始まった",
    "多くの拠点に少数のコンピュータがある構成だった",
    "パケットスイッチがローカル接続と遠隔地への回線を担当していた"
  ],
  "explanationDe": [
    "Die ursprüngliche Architektur von Wide Area Networks (WANs) entstand in einer Zeit, als weder das Internet noch lokale Netzwerke (LANs) weit verbreitet waren.",
    "Solche Netzwerke wurden als Long-Haul-Networks bezeichnet und sollten Daten über große geographische Entfernungen transportieren – etwa zwischen Universitäten, Regierungsbehörden oder Unternehmen.",
    "Typischerweise bestand jeder Standort aus wenigen lokalen Computern, die über einen zentralen Packet Switch verbunden waren.",
    "Dieser Packet Switch hatte zwei Hauptfunktionen: Erstens, lokale Geräte miteinander zu verbinden, zweitens, über eine Datenleitung mit anderen Packet Switches an entfernten Standorten zu kommunizieren.",
    "Diese Architektur ermöglichte es, ein verteiltes Netzwerk aufzubauen, in dem Daten über mehrere Standorte hinweg paketweise weitergeleitet wurden – ein Grundstein für das heutige Internet.",
    "Mit dem Aufkommen des Internets wurden moderne WANs auf Basis von IP-Technologien aufgebaut. Heute übernimmt ein Router an jedem Standort die Vermittlung zwischen lokalen Netzwerken und der WAN-Verbindung.",
    "Das Prinzip der Packet-Switch-basierten Architektur wurde dabei beibehalten, jedoch mit fortschrittlicherer Hardware und Protokollen ergänzt."
  ],
  "explanationJa": [
    "ワイドエリアネットワーク（WAN）の初期アーキテクチャは、インターネットやLANがまだ普及していない時代に登場しました。",
    "当時のWANは「ロングホールネットワーク」と呼ばれ、地理的に大きく離れた拠点間でデータをやり取りするためのネットワークでした。大学や政府機関、企業間の通信などが主な用途でした。",
    "各拠点には少数のコンピュータが設置されており、それらを接続する中心にパケットスイッチがありました。",
    "パケットスイッチは、拠点内の機器同士を接続するとともに、他の遠隔地にあるスイッチとの通信も担当していました。これにより、データはパケット単位で拠点間を転送できる仕組みが整えられていました。",
    "この構成が、今日のインターネットにおけるルーティングやパケット転送の基本原理となっています。",
    "現代では、各拠点に設置されたルーターが、ローカルネットワークとWANとの橋渡しを担っており、インターネットプロトコル（IP）を用いて通信が行われています。",
    "初期のWANアーキテクチャの考え方は、今でもルーターとパケットスイッチングの基礎として生き続けているのです。"
  ],
  "originalSlideText": "Ursprüngliche WAN Architektur (1)\n\n❑ Moderne Kommunikationssysteme überbrücken große Distanzen mit Internettechnologie\n Verbindung über Router an jedem Standort\n❑ Hier: Ein einzelnes Netzwerk über große Distanzen\n❑ Entwicklung begann vor Internet und LANs als Long-Haul-Networks\n❑ Zu Beginn Verbindungen zwischen wenigen Computer an vielen Standorten\n❑ Packet Switch: Lokale Verbindungen für Computer am Standort sowie Verbindungen zu Datenleitungen zu anderen Standorten",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 20,
  "questionDe": "(s29) Wie funktionierte ein ursprünglicher Packet Switch im WAN?",
  "questionJa": "WANにおける初期のパケットスイッチはどのように動作していましたか？",
  "answerDe": [
    "Zunächst wurden konventionelle Computer als Packet Switch verwendet",
    "Später ersetzte Spezialhardware die Standardcomputer",
    "Hochgeschwindigkeits-I/O für Verbindung zu anderem Switch über gemietete Leitung",
    "Langsamere I/O für lokale Computerverbindungen"
  ],
  "answerJa": [
    "最初は汎用コンピュータがパケットスイッチとして使用されていた",
    "後に専用ハードウェアに置き換えられた",
    "他のスイッチとの接続には高速なI/Oと専用線を使用していた",
    "ローカルのコンピュータには遅いI/Oを使用していた"
  ],
  "explanationDe": [
    "In der Anfangszeit von WANs wurden normale, konventionelle Computer als zentrale Vermittlungsstellen – sogenannte Packet Switches – eingesetzt. Diese übernahmen die Aufgabe, Datenpakete von einem Standort zum nächsten weiterzuleiten.",
    "Mit der Zeit wurde klar, dass solche Allzweckcomputer für die Anforderungen an Durchsatz und Latenz nicht optimal waren. Deshalb entwickelte man spezielle Hardware, die exakt für das Weiterleiten von Paketen ausgelegt war.",
    "Ein solcher spezialisierter Packet Switch verfügte über zwei Arten von Ein-/Ausgabe-Schnittstellen (I/O): Eine Hochgeschwindigkeits-I/O für die Kommunikation mit anderen Switches über gemietete Datenleitungen (z. B. T1, T3), und eine langsamere I/O für die Verbindung zu den lokalen Geräten am Standort.",
    "Die Daten, die von lokalen Geräten kamen, wurden vom Switch verarbeitet, in Pakete zerlegt (oder zusammengesetzt), analysiert und an die richtige Verbindung weitergeleitet.",
    "Diese Architektur ermöglichte skalierbare WAN-Strukturen, in denen jeder Standort nicht nur mit lokalen Geräten, sondern auch effizient mit entfernten Netzwerken kommunizieren konnte.",
    "Der Übergang von Softwarebasierten auf hardwaregestützte Switches war ein wesentlicher Schritt in der Evolution hin zu modernen WANs und Internettechnologien.",
    "Heute sind diese Funktionen vollständig in professionelle Router und Switches integriert, die sowohl hohe Geschwindigkeit als auch Protokollvielfalt unterstützen."
  ],
  "explanationJa": [
    "WANの初期においては、パケットスイッチの役割を通常の汎用コンピュータが担っていました。これらのコンピュータは、他の拠点との間でパケットを受信・転送するハブのような役割を果たしていました。",
    "しかし、汎用機では処理速度や遅延の面で限界があり、次第にパケット転送に特化した専用ハードウェアが導入されるようになりました。",
    "専用のパケットスイッチは、2種類のI/Oインターフェースを備えていました。1つは高速なインターフェースで、遠隔地の他のスイッチと専用線（例：T1、T3など）で接続されていました。",
    "もう1つは、ローカルのコンピュータとの接続に使う、比較的低速なインターフェースでした。この構成により、拠点内と外部ネットワークの両方と効率よく通信できました。",
    "スイッチはローカル機器からのデータを受け取り、必要に応じてパケット化して分析し、適切なリンクに転送しました。",
    "このアーキテクチャはWANの構築をスケーラブルにし、多拠点間通信を効率的に行えるようにした重要なステップでした。",
    "現在ではこれらの機能は高性能なルーターやスイッチに統合され、マルチプロトコル対応や高速通信を前提とした構成が当たり前となっています。"
  ],
  "originalSlideText": "Ursprüngliche WAN Architektur (2)\n\n❑ Ursprünglich konventionelle Computer, später Spezialhardware\n❑ Hochgeschwindigkeits I/O zu anderem Switch über gemietete Leitung\n❑ Langsamere I/O zu lokalen Computern",
  "explanationImage": "",
  "questionImage": ""
},
{
  "id": 21,
  "questionDe": "(s30) Wie wurde die ursprüngliche WAN-Architektur mit dem Aufkommen von LANs angepasst?",
  "questionJa": "LANの登場によって、WANのアーキテクチャはどのように変更されましたか？",
  "answerDe": [
    "Packet Switch im WAN wurde in zwei Komponenten aufgeteilt",
    "Ein Layer 2 Switch verbindet lokale Computer",
    "Ein Router stellt Verbindung zu anderen Standorten her"
  ],
  "answerJa": [
    "WAN内のパケットスイッチは2つの要素に分離された",
    "ローカルのコンピュータはレイヤ2スイッチで接続されるようになった",
    "他の拠点との接続はルーターが担うようになった"
  ],
  "explanationDe": [
    "Mit der weiten Verbreitung von LANs (Local Area Networks) in den 1980er und 1990er Jahren wurde es notwendig, die klassische WAN-Architektur anzupassen.",
    "Früher übernahm ein einzelner Packet Switch sowohl die lokale Vermittlung von Computern am Standort als auch die Weiterleitung zu entfernten Netzwerken.",
    "Mit dem Aufkommen von LANs wurden diese beiden Aufgaben funktional getrennt: Für die lokale Kommunikation innerhalb eines Standorts kommt nun ein Layer 2 Switch (z. B. Ethernet-Switch) zum Einsatz.",
    "Der Layer 2 Switch verbindet alle Computer und Geräte am Standort und sorgt für effiziente, schnelle Kommunikation über MAC-Adressen.",
    "Für die Kommunikation mit anderen Standorten wurde ein separater Router eingeführt. Dieser arbeitet auf Layer 3 (Netzwerkschicht) und ist in der Lage, Pakete basierend auf IP-Adressen an das WAN weiterzuleiten.",
    "Diese Trennung verbessert nicht nur die Leistung, sondern auch die Wartbarkeit und Skalierbarkeit des Netzwerks, da Änderungen im LAN keinen direkten Einfluss auf das WAN haben – und umgekehrt.",
    "Das moderne WAN basiert somit auf einer klaren Rollenverteilung: Switch für lokale Kommunikation, Router für standortübergreifende Weiterleitung."
  ],
  "explanationJa": [
    "1980年代から1990年代にかけてLAN（ローカルエリアネットワーク）が普及するにつれて、従来のWANアーキテクチャにも変化が求められるようになりました。",
    "もともとは、1つのパケットスイッチがローカルの通信と遠隔地へのパケット転送の両方を行っていました。",
    "LANの導入により、これらの役割は2つの装置に分離されることになりました。ローカル通信はレイヤ2スイッチ（たとえばイーサネットスイッチ）が担当します。",
    "レイヤ2スイッチは同一拠点内のコンピュータや機器をMACアドレスで接続し、高速で効率的な通信を提供します。",
    "一方、他の拠点との通信にはルーターが使用されるようになりました。ルーターはレイヤ3（ネットワーク層）で動作し、IPアドレスに基づいてパケットを中継します。",
    "このように役割を分けることで、LANとWANの設計・管理が柔軟になり、ネットワークの性能とスケーラビリティが向上しました。",
    "現在のWANアーキテクチャは、スイッチがローカルのやり取りを、ルーターが拠点間通信を担当するという、明確な役割分担に基づいて構成されています。"
  ],
  "originalSlideText": "Ursprüngliche WAN Architektur (3)\n\n❑ Seit LANs wird Packet Switch in WAN in zwei Teile unterteilt\n Layer 2 Switch um lokale Computer zu verbinden\n Router um zu anderen Standorten zu verbinden",
  "explanationImage": "",
  "questionImage": ""
}








  
  
  
  
  
  
  
  
  
  
  
  
  
]