[
  {
    "id": 1,
    "questionDe": "(s.2) Nennen Sie drei Gründe, warum Data Mining eingesetzt wird.",
    "questionJa": "Data Miningが用いられる理由を3つ挙げよ。",
    "answerDe": [
      "Überbordernde Menge an Daten",
      "Wachsende Lücke zwischen Produktion und Auswertung der Daten",
      "Extraktion von nützlichen und versteckten Informationen"
    ],
    "answerJa": [
      "膨大なデータ量",
      "データ生成と分析のギャップの拡大",
      "有用かつ隠れた情報の抽出"
    ],
    "explanationDe": [
      "In der heutigen digitalen Welt werden täglich riesige Datenmengen erzeugt – z. B. durch soziale Netzwerke, Online-Shopping oder Sensoren in Autos. Kein Mensch kann all diese Daten manuell auswerten.",
      "Deshalb braucht man automatisierte Verfahren wie Data Mining, die helfen, aus diesen riesigen Datenmengen sinnvolle Informationen herauszufiltern.",
      "Zum Beispiel kann ein Online-Händler mithilfe von Data Mining erkennen, welche Produkte oft zusammen gekauft werden, um gezielte Empfehlungen zu geben oder Lagerbestände zu planen."
    ],
    "explanationJa": [
      "現代では、SNSの投稿、ネットショッピングの履歴、車のセンサーなどから、毎日膨大なデータが生成されています。人間だけではそれをすべて手作業で分析するのは不可能です。",
      "そこでData Miningのような自動的な分析技術が必要になります。大量のデータから意味のある情報を取り出す手段として役立ちます。",
      "例えば、ネット通販サイトでは、Data Miningによって『この商品を買った人は他に何を買ったか』を分析し、レコメンド機能や在庫管理に活用されます。"
    ],
    "originalSlideText": "• Warum?\n• Überbordernde Menge an Daten\n• Wachsende Lücke zwischen Produktion und Auswertung der Daten\n• Ziel:\n• Extraktion von nützlichen und versteckten Informationen"
  },
  {
    "id": 2,
    "questionDe": "(s.2) Nennen Sie zwei Methoden, wie Data Mining Muster in Daten erkennt.",
    "questionJa": "Data Miningがデータ中のパターンを発見するための手法を2つ挙げよ。",
    "answerDe": [
      "Mustererkennung in den Daten",
      "Nutzung von verschiedenen Data Mining Verfahren (semi-)automatisch"
    ],
    "answerJa": [
      "データ内のパターン認識",
      "様々なData Mining手法による（半）自動的な探索"
    ],
    "explanationDe": [
      "Mustererkennung bedeutet, dass der Computer typische Strukturen in den Daten erkennt, z. B. dass ältere Menschen bestimmte Medikamente häufiger einnehmen.",
      "Data Mining verwendet dafür Algorithmen wie Entscheidungsbäume oder Clustering, die automatisch solche Muster finden.",
      "Zum Beispiel könnte ein Entscheidungsbaum aus Patientendaten ableiten: 'Wenn der Blutdruck hoch ist und das Alter über 60, dann besteht ein erhöhtes Risiko für Herzprobleme'."
    ],
    "explanationJa": [
      "パターン認識とは、コンピュータがデータの中からよく見られる共通の傾向や構造を見つけ出すことを意味します。例えば「高齢者は特定の薬をよく使用する」といった傾向などです。",
      "Data Miningでは、決定木（Decision Tree）やクラスタリング（Clustering）などのアルゴリズムを用いて、こうしたパターンを自動的に見つけ出します。",
      "例えば、医療データから『血圧が高く、年齢が60歳以上の場合、心疾患のリスクが高い』といったルールを導き出すことができます。"
    ],
    "originalSlideText": "• Methode:\n• Mustererkennung in den Daten\n• Nutzung von verschiedenen Data Mining Verfahren, um die Muster in den Daten (semi-)automatisch zu finden"
  }, 
  {
    "id": 3,
    "questionDe": "(s.3) Nennen Sie vier Anforderungen an ein gültiges Data-Mining-Muster.",
    "questionJa": "Data Miningにおける有効なパターンの条件を4つ挙げよ。",
    "answerDe": [
      "Automatisch oder semi-automatisch gefunden",
      "Muss nützliche Informationen enthalten",
      "Ermöglicht nicht triviale Aussagen über neue Daten",
      "Datenbasis muss groß sein"
    ],
    "answerJa": [
      "自動または半自動で得られる",
      "有用な情報を含んでいる",
      "新たなデータに対して非自明な予測が可能",
      "大量のデータに基づいている"
    ],
    "originalSlideText": "• Data Mining ist definiert als Prozess zum Erkennen von Mustern in Daten\n• Muss automatisch oder zumindest semi-automatisch sein\n• Die gefundenen Muster müssen Informationen enthalten, die nützlich sind\n• Die gefundenen Muster ermöglichen nicht triviale Aussagen über neue Daten\n• Daten sind in großer Menge vorhanden"
  },
  {
    "id": 4,
    "questionDe": "(s.3) Nennen Sie zwei Arten von Methoden im Data Mining und erklären Sie den Unterschied.",
    "questionJa": "Data Miningにおける手法の種類を2つ挙げ、それらの違いを説明せよ。",
    "answerDe": [
      "Black Box",
      "Transparente Box"
    ],
    "answerJa": [
      "ブラックボックス",
      "透明なボックス"
    ],
    "originalSlideText": "• Methodenarten:\n• Black Box: Innere Abläufe sind nicht einfach nachvollziehbar\n• Transparente Box: Zeigt die Struktur eines Musters offen und nachvollziehbar an"
  },
  {
    "id": 5,
    "questionDe": "(s.4) Nennen Sie drei Eigenschaften strukturierter Muster.",
    "questionJa": "構造化されたパターンの特徴を3つ挙げよ。",
    "answerDe": [
      "Bilden die Struktur eindeutig ab",
      "Sind untersuchbar und begründbar",
      "Sind nützlich für zukünftige Entscheidungen"
    ],
    "answerJa": [
      "構造を明確に表現している",
      "調査・説明が可能である",
      "将来の意思決定に役立つ"
    ],
    "originalSlideText": "• Strukturierte Muster\n• Bilden die Struktur eindeutig ab\n• Sind untersuchbar\n• Sind begründbar\n• Sind nützlich für zukünftige Entscheidungen"
  },
  {
    "id": 6,
    "questionDe": "(s.5) Welche Informationen enthält der Beispieldatensatz für Kontaktlinsen?",
    "questionJa": "コンタクトレンズに関する例のデータセットにはどのような情報が含まれているか？",
    "answerDe": [
      "Alter",
      "Fehlsichtigkeit",
      "Hornhautverkrümmung",
      "Tränenproduktion",
      "Empfohlene Linsen"
    ],
    "answerJa": [
      "年齢",
      "屈折異常の有無",
      "乱視の有無",
      "涙の分泌量",
      "推奨されるレンズの種類"
    ],
    "explanationDe": [
      "In dem Beispiel werden verschiedene Eigenschaften von Personen mit ihren Kontaktlinsenempfehlungen kombiniert dargestellt.",
      "Typische Attribute sind z. B. das Alter der Person (jung oder alt), ob sie kurzsichtig oder weitsichtig ist, ob eine Hornhautverkrümmung vorliegt und wie die Tränenproduktion eingeschätzt wird.",
      "Basierend auf diesen Attributen wird eine bestimmte Linsenart empfohlen – z. B. harte oder weiche Linsen, oder keine Empfehlung."
    ],
    "explanationJa": [
      "この例では、個人の属性とコンタクトレンズの推奨結果が関連付けられた形で示されています。",
      "具体的な属性としては、年齢（若年か高齢か）、近視または遠視かどうか、乱視の有無、涙の分泌量（正常または減少）が含まれます。",
      "これらの条件に基づいて、ハードレンズやソフトレンズ、またはレンズなしといった推奨がなされます。"
    ],
    "originalSlideText": "Alter Fehlsichtigkeit Hornhaut-verkrümmung Tränen-produktion EmpfohleneLinsen\nJung Kurzsichtig nein reduziert keine\nJung Kurzsichtig nein normal weich\nJung Kurzsichtig ja reduziert keine\nJung Kurzsichtig ja normal hart\nJung weitsichtig nein reduziert keine\nJung weitsichtig nein normal weiche\n… … … … …",
    "questionImage": "lecture01/lecture02_q1.png"
  },
  {
    "id": 7,
    "questionDe": "(s.6) Nennen Sie zwei Regeln, die aus dem Kontaktlinsen-Datensatz extrahiert wurden.",
    "questionJa": "コンタクトレンズのデータから抽出されたルールを2つ挙げよ。",
    "answerDe": [
      "Wenn Tränenproduktion = reduziert → Empfehlung = keine",
      "Wenn Alter = jung und Hornhautverkrümmung = nein → weich"
    ],
    "answerJa": [
      "涙の分泌が減少している場合 → レンズは推奨されない",
      "年齢が若く、乱視がない場合 → ソフトレンズが推奨される"
    ],
    "explanationDe": [
      "Aus den gegebenen Daten lassen sich logische Wenn-Dann-Regeln ableiten. Zum Beispiel zeigt sich, dass eine reduzierte Tränenproduktion dazu führt, dass keine Kontaktlinsen empfohlen werden.",
      "Wenn hingegen junge Personen keine Hornhautverkrümmung haben, eignen sich weiche Linsen gut für sie.",
      "Solche Regeln lassen sich grafisch als Entscheidungsbaum darstellen, der für neue Fälle leicht anwendbar ist."
    ],
    "explanationJa": [
      "このデータから『もし〜なら〜する』という形のルールを導き出すことができます。例えば、涙の量が減っている場合は、レンズは使わない方がよいという判断がなされます。",
      "一方で、若くて乱視がない場合には、ソフトレンズの使用が適しているとされます。",
      "このようなルールは、決定木（Decision Tree）として可視化でき、新しいデータにも適用しやすいです。"
    ],
    "originalSlideText": "• Extrahierte Regeln:\n• Wenn Tränenproduktion = reduziert → Empfehlung = keine\n• Ansonsten:\n• Wenn Alter = jung und Hornhautverkrümmung = nein → weich\n• Darstellbar als Entscheidungsbaum",
    "explanationImage": "lecture01/lecture02_ex1.png"
  },
  {
    "id": 8,
    "questionDe": "(s.6) Nennen Sie drei Probleme, die bei realen Datensätzen im Vergleich zu vollständigen Datensätzen auftreten können.",
    "questionJa": "実際のデータセットにおいて完全なデータと比べて発生しうる問題点を3つ挙げよ。",
    "answerDe": [
      "Regeln bilden nur den Datensatz ab",
      "Reale Datensätze sind oft unvollständig",
      "Reale Daten enthalten Fehler"
    ],
    "answerJa": [
      "ルールは元のデータしか表現していない",
      "実データはしばしば欠損している",
      "実データには誤りが含まれている"
    ],
    "explanationDe": [
      "Ein Regelwerk, das aus einem Trainingsdatensatz erstellt wird, beschreibt nur genau diesen Datensatz – es verallgemeinert möglicherweise nicht gut auf neue Daten.",
      "Im echten Leben fehlen oft Datenpunkte – z. B. weil sie nicht gemessen wurden oder Messfehler vorlagen.",
      "Zudem können Eingabefehler oder veraltete Informationen zu falschen Schlüssen führen."
    ],
    "explanationJa": [
      "訓練データから作られたルールは、そのデータだけを説明しており、新しいデータにはうまく当てはまらないことがあります。",
      "現実世界では、センサーの不具合や記録ミスにより、データの一部が欠けていることがよくあります。",
      "また、入力ミスや古い情報が含まれている場合には、誤った結論を導いてしまう可能性があります。"
    ],
    "originalSlideText": "• Probleme:\n• Regeln bilden nur den Datensatz ab\n• Vollständige Datensätze sind aber nicht die Norm\n• Reale Datensätze weisen Lücken aufgrund von Messfehlern auf\n• Reale Daten beinhalten Fehler"
  }

  
  
  
  
  
  
   
  
  





]
