[
  {
    "id": 1,
    "questionDe": "(s.2) Nennen Sie drei Gründe, warum Data Mining eingesetzt wird.",
    "questionJa": "Data Miningが用いられる理由を3つ挙げよ。",
    "answerDe": [
      "Überbordernde Menge an Daten",
      "Wachsende Lücke zwischen Produktion und Auswertung der Daten",
      "Extraktion von nützlichen und versteckten Informationen"
    ],
    "answerJa": [
      "膨大なデータ量",
      "データ生成と分析のギャップの拡大",
      "有用かつ隠れた情報の抽出"
    ],
    "explanationDe": [
      "In der heutigen digitalen Welt werden täglich riesige Datenmengen erzeugt – z. B. durch soziale Netzwerke, Online-Shopping oder Sensoren in Autos. Kein Mensch kann all diese Daten manuell auswerten.",
      "Deshalb braucht man automatisierte Verfahren wie Data Mining, die helfen, aus diesen riesigen Datenmengen sinnvolle Informationen herauszufiltern.",
      "Zum Beispiel kann ein Online-Händler mithilfe von Data Mining erkennen, welche Produkte oft zusammen gekauft werden, um gezielte Empfehlungen zu geben oder Lagerbestände zu planen."
    ],
    "explanationJa": [
      "現代では、SNSの投稿、ネットショッピングの履歴、車のセンサーなどから、毎日膨大なデータが生成されています。人間だけではそれをすべて手作業で分析するのは不可能です。",
      "そこでData Miningのような自動的な分析技術が必要になります。大量のデータから意味のある情報を取り出す手段として役立ちます。",
      "例えば、ネット通販サイトでは、Data Miningによって『この商品を買った人は他に何を買ったか』を分析し、レコメンド機能や在庫管理に活用されます。"
    ],
    "originalSlideText": "• Warum?\n• Überbordernde Menge an Daten\n• Wachsende Lücke zwischen Produktion und Auswertung der Daten\n• Ziel:\n• Extraktion von nützlichen und versteckten Informationen"
  },
  {
    "id": 2,
    "questionDe": "(s.2) Nennen Sie zwei Methoden, wie Data Mining Muster in Daten erkennt.",
    "questionJa": "Data Miningがデータ中のパターンを発見するための手法を2つ挙げよ。",
    "answerDe": [
      "Mustererkennung in den Daten",
      "Nutzung von verschiedenen Data Mining Verfahren (semi-)automatisch"
    ],
    "answerJa": [
      "データ内のパターン認識",
      "様々なData Mining手法による（半）自動的な探索"
    ],
    "explanationDe": [
      "Mustererkennung bedeutet, dass der Computer typische Strukturen in den Daten erkennt, z. B. dass ältere Menschen bestimmte Medikamente häufiger einnehmen.",
      "Data Mining verwendet dafür Algorithmen wie Entscheidungsbäume oder Clustering, die automatisch solche Muster finden.",
      "Zum Beispiel könnte ein Entscheidungsbaum aus Patientendaten ableiten: 'Wenn der Blutdruck hoch ist und das Alter über 60, dann besteht ein erhöhtes Risiko für Herzprobleme'."
    ],
    "explanationJa": [
      "パターン認識とは、コンピュータがデータの中からよく見られる共通の傾向や構造を見つけ出すことを意味します。例えば「高齢者は特定の薬をよく使用する」といった傾向などです。",
      "Data Miningでは、決定木（Decision Tree）やクラスタリング（Clustering）などのアルゴリズムを用いて、こうしたパターンを自動的に見つけ出します。",
      "例えば、医療データから『血圧が高く、年齢が60歳以上の場合、心疾患のリスクが高い』といったルールを導き出すことができます。"
    ],
    "originalSlideText": "• Methode:\n• Mustererkennung in den Daten\n• Nutzung von verschiedenen Data Mining Verfahren, um die Muster in den Daten (semi-)automatisch zu finden"
  }, 
  {
    "id": 3,
    "questionDe": "(s.3) Nennen Sie vier Anforderungen an ein gültiges Data-Mining-Muster.",
    "questionJa": "Data Miningにおける有効なパターンの条件を4つ挙げよ。",
    "answerDe": [
      "Automatisch oder semi-automatisch gefunden",
      "Muss nützliche Informationen enthalten",
      "Ermöglicht nicht triviale Aussagen über neue Daten",
      "Datenbasis muss groß sein"
    ],
    "answerJa": [
      "自動または半自動で得られる",
      "有用な情報を含んでいる",
      "新たなデータに対して非自明な予測が可能",
      "大量のデータに基づいている"
    ],
    "originalSlideText": "• Data Mining ist definiert als Prozess zum Erkennen von Mustern in Daten\n• Muss automatisch oder zumindest semi-automatisch sein\n• Die gefundenen Muster müssen Informationen enthalten, die nützlich sind\n• Die gefundenen Muster ermöglichen nicht triviale Aussagen über neue Daten\n• Daten sind in großer Menge vorhanden"
  },
  {
    "id": 4,
    "questionDe": "(s.3) Nennen Sie zwei Arten von Methoden im Data Mining und erklären Sie den Unterschied.",
    "questionJa": "Data Miningにおける手法の種類を2つ挙げ、それらの違いを説明せよ。",
    "answerDe": [
      "Black Box",
      "Transparente Box"
    ],
    "answerJa": [
      "ブラックボックス",
      "透明なボックス"
    ],
    "originalSlideText": "• Methodenarten:\n• Black Box: Innere Abläufe sind nicht einfach nachvollziehbar\n• Transparente Box: Zeigt die Struktur eines Musters offen und nachvollziehbar an"
  },
  {
    "id": 5,
    "questionDe": "(s.4) Nennen Sie drei Eigenschaften strukturierter Muster.",
    "questionJa": "構造化されたパターンの特徴を3つ挙げよ。",
    "answerDe": [
      "Bilden die Struktur eindeutig ab",
      "Sind untersuchbar und begründbar",
      "Sind nützlich für zukünftige Entscheidungen"
    ],
    "answerJa": [
      "構造を明確に表現している",
      "調査・説明が可能である",
      "将来の意思決定に役立つ"
    ],
    "originalSlideText": "• Strukturierte Muster\n• Bilden die Struktur eindeutig ab\n• Sind untersuchbar\n• Sind begründbar\n• Sind nützlich für zukünftige Entscheidungen"
  },
  {
    "id": 6,
    "questionDe": "(s.5) Welche Informationen enthält der Beispieldatensatz für Kontaktlinsen?",
    "questionJa": "コンタクトレンズに関する例のデータセットにはどのような情報が含まれているか？",
    "answerDe": [
      "Alter",
      "Fehlsichtigkeit",
      "Hornhautverkrümmung",
      "Tränenproduktion",
      "Empfohlene Linsen"
    ],
    "answerJa": [
      "年齢",
      "屈折異常の有無",
      "乱視の有無",
      "涙の分泌量",
      "推奨されるレンズの種類"
    ],
    "explanationDe": [
      "In dem Beispiel werden verschiedene Eigenschaften von Personen mit ihren Kontaktlinsenempfehlungen kombiniert dargestellt.",
      "Typische Attribute sind z. B. das Alter der Person (jung oder alt), ob sie kurzsichtig oder weitsichtig ist, ob eine Hornhautverkrümmung vorliegt und wie die Tränenproduktion eingeschätzt wird.",
      "Basierend auf diesen Attributen wird eine bestimmte Linsenart empfohlen – z. B. harte oder weiche Linsen, oder keine Empfehlung."
    ],
    "explanationJa": [
      "この例では、個人の属性とコンタクトレンズの推奨結果が関連付けられた形で示されています。",
      "具体的な属性としては、年齢（若年か高齢か）、近視または遠視かどうか、乱視の有無、涙の分泌量（正常または減少）が含まれます。",
      "これらの条件に基づいて、ハードレンズやソフトレンズ、またはレンズなしといった推奨がなされます。"
    ],
    "originalSlideText": "Alter Fehlsichtigkeit Hornhaut-verkrümmung Tränen-produktion EmpfohleneLinsen\nJung Kurzsichtig nein reduziert keine\nJung Kurzsichtig nein normal weich\nJung Kurzsichtig ja reduziert keine\nJung Kurzsichtig ja normal hart\nJung weitsichtig nein reduziert keine\nJung weitsichtig nein normal weiche\n… … … … …",
    "questionImage": "lecture01/lecture02_q01.png"
  },
  {
    "id": 7,
    "questionDe": "(s.6) Nennen Sie zwei Regeln, die aus dem Kontaktlinsen-Datensatz extrahiert wurden.",
    "questionJa": "コンタクトレンズのデータから抽出されたルールを2つ挙げよ。",
    "answerDe": [
      "Wenn Tränenproduktion = reduziert → Empfehlung = keine",
      "Wenn Alter = jung und Hornhautverkrümmung = nein → weich"
    ],
    "answerJa": [
      "涙の分泌が減少している場合 → レンズは推奨されない",
      "年齢が若く、乱視がない場合 → ソフトレンズが推奨される"
    ],
    "explanationDe": [
      "Aus den gegebenen Daten lassen sich logische Wenn-Dann-Regeln ableiten. Zum Beispiel zeigt sich, dass eine reduzierte Tränenproduktion dazu führt, dass keine Kontaktlinsen empfohlen werden.",
      "Wenn hingegen junge Personen keine Hornhautverkrümmung haben, eignen sich weiche Linsen gut für sie.",
      "Solche Regeln lassen sich grafisch als Entscheidungsbaum darstellen, der für neue Fälle leicht anwendbar ist."
    ],
    "explanationJa": [
      "このデータから『もし〜なら〜する』という形のルールを導き出すことができます。例えば、涙の量が減っている場合は、レンズは使わない方がよいという判断がなされます。",
      "一方で、若くて乱視がない場合には、ソフトレンズの使用が適しているとされます。",
      "このようなルールは、決定木（Decision Tree）として可視化でき、新しいデータにも適用しやすいです。"
    ],
    "originalSlideText": "• Extrahierte Regeln:\n• Wenn Tränenproduktion = reduziert → Empfehlung = keine\n• Ansonsten:\n• Wenn Alter = jung und Hornhautverkrümmung = nein → weich\n• Darstellbar als Entscheidungsbaum",
    "explanationImage": "lecture01/lecture02_ex01.png"
  },
  {
    "id": 8,
    "questionDe": "(s.6) Nennen Sie drei Probleme, die bei realen Datensätzen im Vergleich zu vollständigen Datensätzen auftreten können.",
    "questionJa": "実際のデータセットにおいて完全なデータと比べて発生しうる問題点を3つ挙げよ。",
    "answerDe": [
      "Regeln bilden nur den Datensatz ab",
      "Reale Datensätze sind oft unvollständig",
      "Reale Daten enthalten Fehler"
    ],
    "answerJa": [
      "ルールは元のデータしか表現していない",
      "実データはしばしば欠損している",
      "実データには誤りが含まれている"
    ],
    "explanationDe": [
      "Ein Regelwerk, das aus einem Trainingsdatensatz erstellt wird, beschreibt nur genau diesen Datensatz – es verallgemeinert möglicherweise nicht gut auf neue Daten.",
      "Im echten Leben fehlen oft Datenpunkte – z. B. weil sie nicht gemessen wurden oder Messfehler vorlagen.",
      "Zudem können Eingabefehler oder veraltete Informationen zu falschen Schlüssen führen."
    ],
    "explanationJa": [
      "訓練データから作られたルールは、そのデータだけを説明しており、新しいデータにはうまく当てはまらないことがあります。",
      "現実世界では、センサーの不具合や記録ミスにより、データの一部が欠けていることがよくあります。",
      "また、入力ミスや古い情報が含まれている場合には、誤った結論を導いてしまう可能性があります。"
    ],
    "originalSlideText": "• Probleme:\n• Regeln bilden nur den Datensatz ab\n• Vollständige Datensätze sind aber nicht die Norm\n• Reale Datensätze weisen Lücken aufgrund von Messfehlern auf\n• Reale Daten beinhalten Fehler"
  },
  {
    "id": 9,
    "questionDe": "(s.7) Nennen Sie zwei Probleme bei der Nutzung zu vieler Regeln im Data Mining.",
    "questionJa": "Data Miningでルールが多すぎるときに発生する問題を2つ挙げよ。",
    "answerDe": [
      "Anzahl der Regeln sollte nicht größer als die Anzahl der Datenpunkte sein",
      "Die vollständige Aufzählung aller Regeln ist oft nicht erreichbar"
    ],
    "answerJa": [
      "ルールの数がデータ数を超えてはならない",
      "すべてのルールを網羅するのは現実的でない"
    ],
    "explanationDe": [
      "Wenn die Anzahl der Regeln größer ist als die Anzahl der Datenpunkte, führt dies zu Überanpassung und unbrauchbaren Resultaten.",
      "Es ist oft rechnerisch unmöglich oder ineffizient, alle möglichen Regeln zu erzeugen und zu analysieren – daher ist eine sinnvolle Auswahl notwendig."
    ],
    "explanationJa": [
      "ルールの数がデータの件数を上回ると、過学習が起きやすくなり、汎用性のないモデルになります。",
      "すべてのルールを作成・検討するのは計算的に不可能または非常に非効率なため、実用的なルールだけを抽出する必要があります。"
    ],
    "originalSlideText": "• Die Anzahl der Regeln sollte nicht größer als die Anzahl der Datenpunkte sein\n• Die Aufzählung aller Regeln ist oft nicht erreichbar\n→ Filtern einer Menge von Beschreibungen"
  },
  {
    "id": 10,
    "questionDe": "(s.7) Nennen Sie drei Herausforderungen bei der Beschreibung und Auswahl von Mustern.",
    "questionJa": "パターンの記述および選択に関して発生する課題を3つ挙げよ。",
    "answerDe": [
      "Bias: Wie beschreibt man die Daten?",
      "Bias: In welcher Reihenfolge sucht man?",
      "Overfitting durch ungeeignete Regelbildung"
    ],
    "answerJa": [
      "バイアス：どのようにデータを記述するか",
      "バイアス：どの順序で探索するか",
      "不適切なルール形成による過学習"
    ],
    "explanationDe": [
      "Die Art und Weise, wie Daten beschrieben werden (z. B. mit logischen Ausdrücken oder Einschränkungen), kann beeinflussen, welche Muster gefunden werden.",
      "Auch die Reihenfolge der Regelgenerierung (Top-down oder Bottom-up) kann dazu führen, dass bestimmte Muster bevorzugt oder übersehen werden.",
      "Overfitting entsteht, wenn Regeln zu sehr auf Trainingsdaten zugeschnitten sind und sich nicht verallgemeinern lassen."
    ],
    "explanationJa": [
      "データをどう記述するか（例えば論理式や制約条件の使い方）によって、発見できるパターンに影響を与える可能性があります。",
      "ルールをどの順序で生成するか（トップダウンかボトムアップか）によって、特定のパターンが優先されたり見逃されたりすることがあります。",
      "過学習（Overfitting）は、ルールが訓練データに過剰に適合し、新しいデータには対応できなくなる現象です。"
    ],
    "originalSlideText": "• Bias\n• Wie beschreibt man die Daten?\n• In welcher Reihenfolge sucht man?\n• Overfitting?"
  },
  {
    "id": 11,
    "questionDe": "(s.8) Nennen Sie zwei Probleme bei der Beschreibung von Mustern.",
    "questionJa": "パターンを記述する際に発生する問題点を2つ挙げよ。",
    "answerDe": [
      "Sprache weist Einschränkungen auf",
      "Kein logisches ODER möglich"
    ],
    "answerJa": [
      "使用する言語に制約がある",
      "論理的なORが表現できない"
    ],
    "explanationDe": [
      "Die Beschreibungssprache beeinflusst, welche Muster überhaupt erkannt werden können. Wenn die Sprache zu eingeschränkt ist, bleiben interessante Zusammenhänge unentdeckt.",
      "Ein typisches Beispiel ist, dass kein logisches ODER erlaubt ist. Das bedeutet, dass man z. B. nicht formulieren kann: 'Wenn Alter > 60 ODER Bluthochdruck vorhanden → Risiko hoch'."
    ],
    "explanationJa": [
      "どのような言語（表現方法）でパターンを記述するかによって、見つけられるパターンが制限されてしまうことがあります。",
      "例えば、論理的なOR（または）が使えないと、『年齢が60歳を超えるまたは高血圧がある場合にリスクが高い』といった条件が表現できません。"
    ],
    "originalSlideText": "• Beschreibungsprobleme\n• Weist die Sprache Einschränkungen auf, welche Muster erkannt werden können?\n• z. B. kein ODER"
  },
  {
    "id": 12,
    "questionDe": "(s.8) Welche Rolle spielt Vorwissen bei der Mustersuche im Data Mining?",
    "questionJa": "Data Miningにおけるパターン探索において、事前知識はどのような役割を果たすか？",
    "answerDe": [
      "Nutzung von Vorwissen hilft bei der Einteilung des Suchraums"
    ],
    "answerJa": [
      "事前知識は検索空間の限定に役立つ"
    ],
    "explanationDe": [
      "Vorwissen (z. B. aus der Domäne) kann verwendet werden, um irrelevante Bereiche im Suchraum auszuschließen und die Suche gezielter zu gestalten.",
      "Das reduziert die Komplexität und steigert die Qualität der gefundenen Muster."
    ],
    "explanationJa": [
      "ドメイン知識などの事前知識を使うことで、無関係な領域を除外して、効率的に意味のあるパターンを見つけることができます。",
      "これにより計算コストが下がり、より良質なパターンが得られやすくなります。"
    ],
    "originalSlideText": "• Nutzung von Vorwissen\n• Einteilung des Suchraums?"
  },
  {
    "id": 13,
    "questionDe": "(s.9) Nennen Sie zwei Probleme, die durch Suchbias beim Data Mining entstehen können.",
    "questionJa": "Data Miningにおける探索バイアスにより生じる問題を2つ挙げよ。",
    "answerDe": [
      "Schwierigkeiten, den gesamten Suchraum abzuarbeiten",
      "Reihenfolge kann das Ergebnis beeinflussen"
    ],
    "answerJa": [
      "探索空間全体を網羅するのが困難",
      "探索の順序が結果に影響を与える"
    ],
    "explanationDe": [
      "Ein Suchbias bedeutet, dass nicht alle möglichen Muster gleich gut gefunden werden können – manche bleiben unentdeckt.",
      "Wenn man z. B. mit einer Top-Down-Strategie beginnt, werden zuerst grobe Muster untersucht, wodurch feingliedrige Zusammenhänge übersehen werden könnten."
    ],
    "explanationJa": [
      "探索バイアスとは、すべての可能なパターンを均等に探索できるわけではなく、特定のものが見落とされやすいことを意味します。",
      "例えば、トップダウンの探索を行うと、最初に大まかなパターンに注目するため、細かな関連性を見逃すことがあります。"
    ],
    "originalSlideText": "• Suchbias\n• Schwierigkeiten, den gesamten Suchraum abzuarbeiten\n• Nutzung von Heuristiken\n• Reihenfolge kann wichtig sein"
  },
  {
    "id": 13,
    "questionDe": "(s.9) Nennen Sie zwei Probleme, die durch Suchbias beim Data Mining entstehen können.",
    "questionJa": "Data Miningにおける探索バイアスにより生じる問題を2つ挙げよ。",
    "answerDe": [
      "Schwierigkeiten, den gesamten Suchraum abzuarbeiten",
      "Reihenfolge kann das Ergebnis beeinflussen"
    ],
    "answerJa": [
      "探索空間全体を網羅するのが困難",
      "探索の順序が結果に影響を与える"
    ],
    "explanationDe": [
      "Suchbias bedeutet, dass nicht alle möglichen Muster mit gleicher Wahrscheinlichkeit gefunden werden – einige bleiben unentdeckt, weil der Suchraum zu groß oder ungünstig durchsucht wird.",
      "Beispiel: Wenn man bei der Regelgenerierung mit einem sehr allgemeinen Muster beginnt (Top-down), könnte man spezifische, aber interessante Regeln übersehen, wie z. B. 'Kunden über 60 kaufen häufig Hörgeräte'.",
      "Auch die Reihenfolge, in der man sucht (z. B. zuerst Alter, dann Einkommen), kann dazu führen, dass manche Muster gar nicht erst betrachtet werden."
    ],
    "explanationJa": [
      "探索バイアスとは、すべての可能なパターンを平等に見つけられるわけではなく、一部のパターンが見落とされることを指します。これは探索空間が非常に広いか、探索の方法が偏っているときに起きます。",
      "例えば、ルールを作るときに『年齢などの大きな属性』から始めるトップダウン方式では、『60歳以上の顧客は補聴器をよく購入する』といった細かく重要なルールを見逃してしまうかもしれません。",
      "また、『最初に年齢→次に収入』という順番で探すと、その順番に現れない関係性を見逃す可能性もあります。"
    ],
    "originalSlideText": "• Suchbias\n• Schwierigkeiten, den gesamten Suchraum abzuarbeiten\n• Nutzung von Heuristiken\n• Reihenfolge kann wichtig sein"
  },
  {
    "id": 14,
    "questionDe": "(s.9) Nennen Sie zwei Strategien zur Mustersuche im Data Mining.",
    "questionJa": "Data Miningにおけるパターン探索の戦略を2つ挙げよ。",
    "answerDe": [
      "Top-Down",
      "Bottom-Up"
    ],
    "answerJa": [
      "トップダウン",
      "ボトムアップ"
    ],
    "explanationDe": [
      "Beim Top-Down-Ansatz beginnt man mit allgemeinen Regeln und verfeinert sie schrittweise. Dies ist einfach zu implementieren, kann aber spezifische Muster übersehen.",
      "Beispiel: Man startet mit der Regel 'Kunden über 60 kaufen selten Elektronik' und verfeinert sie zu 'Kunden über 60 mit hohem Einkommen kaufen Smartphones'.",
      "Beim Bottom-Up-Ansatz beginnt man mit konkreten Einzelfällen (z. B. ein bestimmter Kaufvorgang) und generalisiert von dort aus. Dies kann genauere Regeln liefern, ist aber rechenintensiv."
    ],
    "explanationJa": [
      "トップダウン方式では、まず大まかなルールから始め、それを徐々に細かくしていきます。この方法は扱いやすいですが、細かなパターンを見逃す可能性があります。",
      "例として『60歳以上の顧客は電子機器をあまり買わない』というルールから始め、それを『高所得の60歳以上の顧客はスマートフォンを買う』と細かくしていくような流れです。",
      "一方ボトムアップ方式では、個別の例（例えばある顧客の購買履歴）から始めて、共通点を探して一般化していきます。こちらは精度が高いですが、計算量が多くなりがちです。"
    ],
    "originalSlideText": "• Reihenfolge kann wichtig sein\n• Top down\n• Bottom up"
  },
  {
    "id": 15,
    "questionDe": "(s.9) Was ist eine Heuristik und warum wird sie im Data Mining eingesetzt?",
    "questionJa": "ヒューリスティックとは何か、またなぜData Miningで用いられるのか？",
    "answerDe": [
      "Eine Heuristik ist eine Näherungsmethode zur Lösung komplexer Probleme"
    ],
    "answerJa": [
      "ヒューリスティックとは、複雑な問題をおおよそ解くための近似的な方法である"
    ],
    "explanationDe": [
      "Heuristiken helfen, große Suchräume effizient zu durchsuchen, ohne alle Möglichkeiten prüfen zu müssen.",
      "Beispiel: Statt alle Kundenprofile zu vergleichen, konzentriert sich ein Algorithmus nur auf die jüngsten Transaktionen, weil diese typischerweise relevanter für das Kaufverhalten sind.",
      "Solche Strategien sparen Rechenzeit und ermöglichen es, brauchbare Muster in vertretbarer Zeit zu finden – auch wenn sie nicht immer optimal sind."
    ],
    "explanationJa": [
      "ヒューリスティックとは、すべての可能性を調べるのではなく、経験則などを用いておおよその解を素早く求めるための方法です。",
      "例：顧客全体のすべての購入履歴を見るのではなく、最近の購入だけを重点的に見ることで、時間を節約して有効なパターンを見つけようとすることが挙げられます。",
      "このような方法は必ずしも最適解を保証するわけではありませんが、現実的な時間内に十分役立つ結果を得ることができます。"
    ],
    "originalSlideText": "• Nutzung von Heuristiken"
  },
  {
    "id": 16,
    "questionDe": "(s.9) Was ist eine instanzbasierte Methode im Data Mining?",
    "questionJa": "Data Miningにおけるインスタンスベースの手法とは何か？",
    "answerDe": [
      "Instanzbasierte Methoden lernen einzelne Beispiele und generalisieren daraus"
    ],
    "answerJa": [
      "インスタンスベースの手法は、個別の例から学習し、それをもとに一般化する"
    ],
    "explanationDe": [
      "Diese Methoden speichern konkrete Beispiele (Instanzen) und vergleichen neue Daten direkt mit diesen bekannten Fällen.",
      "Ein klassisches Beispiel ist der k-nächste-Nachbarn-Algorithmus: Um eine neue Kundengruppe zu klassifizieren, sucht man z. B. die 5 ähnlichsten bisherigen Kunden und leitet die Vorhersage daraus ab.",
      "Solche Methoden sind einfach und flexibel, aber können bei sehr großen Datenmengen ineffizient werden."
    ],
    "explanationJa": [
      "この手法では、抽象的なルールを作るのではなく、個々の具体的な例（インスタンス）を記憶し、それと新しいデータを直接比較します。",
      "代表的なのはk近傍法（k-NN）で、新しい顧客がどのグループに属するかを判断する際、最も似ている過去の顧客5人を探し、その傾向から分類します。",
      "この方法はシンプルで柔軟ですが、データが多すぎると検索に時間がかかるという課題があります。"
    ],
    "originalSlideText": "• Instanz basierte Methode lernen einzelne Beispiele und generalisieren"
  },
  {
    "id": 17,
    "questionDe": "(s.10) Nennen Sie zwei Ursachen von Overfitting und eine Maßnahme zur Vermeidung.",
    "questionJa": "過学習の原因を2つ、それを防ぐための対策を1つ挙げよ。",
    "answerDe": [
      "Zu genaue Trainingsdaten führen zu überspezifischen Modellen",
      "Alle Datenpunkte als Regel zu lernen ist zu spezifisch",
      "Kombination von Regeln zur Verallgemeinerung"
    ],
    "answerJa": [
      "訓練データが正確すぎると過度に特化したモデルになる",
      "すべてのデータ点をルールとして学習すると過学習につながる",
      "ルールの組み合わせによって一般化を図る"
    ],
    "explanationDe": [
      "Overfitting entsteht, wenn ein Modell die Trainingsdaten zu genau widerspiegelt und keine Generalisierung auf neue Daten zulässt.",
      "Wenn man z. B. jede Kundeninteraktion einzeln als Regel abspeichert, kann das Modell keine neuen Situationen behandeln.",
      "Eine Lösung ist, mehrere spezifische Regeln zu kombinieren, um eine allgemeinere Regel zu erstellen, die auf verschiedene Fälle anwendbar ist."
    ],
    "explanationJa": [
      "過学習は、訓練データにあまりにも忠実にモデルが適合しすぎて、新しいデータにうまく対応できなくなるときに起こります。",
      "たとえば、顧客ごとの行動をすべて個別のルールにしてしまうと、未知の顧客への予測ができません。",
      "この問題への対応策として、複数の具体的なルールを組み合わせ、より一般的なルールとして再構成する方法が有効です。"
    ],
    "originalSlideText": "• Overfitting\n  • Zu genaue Training Daten führen zu überspezifischen Modellen!\n  • Alle Datenpunkte als Regel zu lernen daher zu spezifisch\n  → Kombination von Regeln"
  },
  {
    "id": 18,
    "questionDe": "(s.10) Wie kann Overfitting bei der Regelbildung im Data Mining vermieden werden? Nennen Sie eine Strategie und zwei Pruning-Techniken.",
    "questionJa": "Data Miningにおけるルール生成において、過学習を防ぐにはどうすればよいか。1つの戦略と2つのプルーニング手法を挙げよ。",
    "answerDe": [
      "Bottom-Up: Aufbau komplexer Regeln aus einfachen",
      "Forward-Pruning: Stop bei ausreichender Komplexität",
      "Backward-Pruning: Start mit komplexen Regeln und Vereinfachung"
    ],
    "answerJa": [
      "ボトムアップ：単純なルールから複雑なルールを構築する",
      "フォワードプルーニング：十分に複雑になった時点で生成を停止する",
      "バックワードプルーニング：複雑なルールから出発して単純化する"
    ],
    "explanationDe": [
      "Overfitting kann vermieden werden, indem man nicht sofort komplexe Regeln verwendet, sondern mit einfachen beginnt – das ist der Bottom-Up-Ansatz.",
      "Dabei wird jede Regel schrittweise erweitert. Wenn sie komplex genug ist, wird der Prozess gestoppt. Dies nennt man Forward-Pruning.",
      "Alternativ kann man mit einer komplexen Regel starten und diese vereinfachen, um unnötige Details zu entfernen – das ist Backward-Pruning.",
      "Beispiel: Statt Regeln für jeden einzelnen Kunden zu erstellen, kombiniert man typische Verhaltensmuster und entfernt Spezialfälle, um verallgemeinerbare Regeln zu erhalten."
    ],
    "explanationJa": [
      "過学習を防ぐためには、いきなり複雑なルールを作るのではなく、まず単純なルールから始めるというボトムアップ戦略が有効です。",
      "この方法では、ルールを段階的に複雑にしていき、十分に複雑になった時点で生成を止めます。これをフォワードプルーニングと呼びます。",
      "逆に、まず複雑なルールを作っておいて、そこから重要でない詳細を削って簡略化する方法もあり、これがバックワードプルーニングです。",
      "例：顧客ごとの詳細なルールを個別に作成する代わりに、共通する購買パターンを見つけてルール化し、例外的なケースは除外することで、より汎用的で信頼できるルールを得られます。"
    ],
    "originalSlideText": "• Bottom Up Idee:\n  • Starte mit einfachen Regeln\n  • Erstelle darauf aufbauend komplexere Regeln\n  • Stop, wenn die Regeln komplex genug sind\n• Vermeidung von Overfitting\n• Nennt man auch forward-pruning\n  • Geht auch rückwärts\n  • Backward-pruning\n  • Start mit generellen Regeln zu simplen Regeln"
  },
  {
    "id": 19,
    "questionDe": "(s.11) Was sind wichtige Eigenschaften von Konzeptbeschreibungen im Data Mining? Nennen Sie drei.",
    "questionJa": "Data Miningにおける概念記述の重要な性質を3つ挙げよ。",
    "answerDe": [
      "Verständlich",
      "Nachvollziehbar und diskutierbar",
      "Anwendbar auf Beispiele"
    ],
    "answerJa": [
      "理解しやすい",
      "説明・議論が可能",
      "例に適用可能"
    ],
    "explanationDe": [
      "Eine Konzeptbeschreibung ist eine Definition oder Regel, die ausdrückt, was man im Data Mining lernen will – z. B. 'Was ist ein guter Kunde?'.",
      "Sie soll verständlich sein, damit auch Personen ohne technische Kenntnisse sie nachvollziehen können.",
      "Zudem muss sie diskutierbar sein – z. B. mit Experten –, um sicherzustellen, dass das Konzept sinnvoll ist.",
      "Wichtig ist auch, dass die Beschreibung in der Praxis auf konkrete Beispiele angewendet werden kann, etwa bei der Entscheidung, ob ein Kunde ein 'Risikokunde' ist oder nicht."
    ],
    "explanationJa": [
      "概念記述とは、Data Miningにおいて『何を学ぶか』を定義するものです。例：『優良顧客とは何か？』という問いに答える定義のようなものです。",
      "この記述は、非技術者でも理解できるものであることが望ましいです。",
      "また、専門家と議論できるように説明可能であるべきです。たとえば、その概念が業務上意味のあるものかを確認するためです。",
      "さらに、その概念が実際のデータ例に対して適用可能である必要があります。例：『この顧客はリスクが高いかどうか』と判断する場面などです。"
    ],
    "originalSlideText": "• Konzeptbeschreibungen: Das, was man lernen will\n  • Verständlich\n    • Nachvollziehbar\n    • Diskutierbar\n  • Anwendbar\n    • Kann man auf Beispiele anwenden"
  },
  {
    "id": 20,
    "questionDe": "(s.11) Erklären Sie den Unterschied zwischen Instanzen und Attributen im Data Mining.",
    "questionJa": "Data Miningにおけるインスタンスと属性の違いを説明せよ。",
    "answerDe": [
      "Instanzen sind konkrete Beispiele für ein Konzept",
      "Attribute beschreiben die Eigenschaften einer Instanz"
    ],
    "answerJa": [
      "インスタンスとは、ある概念に対応する具体的な例である",
      "属性とは、インスタンスの性質を記述する要素である"
    ],
    "explanationDe": [
      "Eine Instanz ist ein einzelnes Beispiel für ein Konzept – z. B. ein Kunde, der als 'risikoreich' oder 'loyal' gelten kann.",
      "Manchmal ist Hintergrundwissen nötig, um die Bedeutung einer Instanz zu verstehen – z. B. Kontext zu früherem Verhalten.",
      "Attribute beschreiben Merkmale der Instanz, wie Alter, Einkommen oder Kaufverhalten.",
      "Im Data Mining handelt es sich bei Attributen häufig um numerische (z. B. Alter = 45) oder kategoriale (z. B. Geschlecht = männlich) Daten."
    ],
    "explanationJa": [
      "インスタンスとは、ある概念に対する具体的な例のことです。例えば『リスクのある顧客』という概念における、特定の顧客データなどが該当します。",
      "そのインスタンスを正しく解釈するためには、背景知識（過去の履歴など）が重要になることもあります。",
      "属性とは、そのインスタンスの特徴を表す要素で、たとえば『年齢』『収入』『購入履歴』などです。",
      "Data Miningでは、属性は数値データ（例：年齢＝45）やカテゴリデータ（例：性別＝男性）などとして扱われることが多いです。"
    ],
    "originalSlideText": "• Instanzen\n  • Einzelnes Beispiel für das zu lernende Konzept\n  • Hintergrundwissen kann wichtig sein\n• Attribute\n  • Jede Instanz wird durch Attribute beschrieben\n  • Data Mining bearbeitet zumeist numerische oder kategorische Daten"
  },
  {
    "id": 21,
    "questionDe": "(s.12) Nennen Sie vier grundlegende Lernverfahren im Data Mining.",
    "questionJa": "Data Miningにおける4つの基本的な学習手法を挙げよ。",
    "answerDe": [
      "Klassifikation",
      "Assoziation",
      "Clustering",
      "Numerische Vorhersage"
    ],
    "answerJa": [
      "分類（Klassifikation）",
      "アソシエーション（Assoziation）",
      "クラスタリング（Clustering）",
      "数値予測（Numerische Vorhersage）"
    ],
    "explanationDe": [
      "Klassifikation ordnet Daten vordefinierten Klassen zu, z. B. ob ein Kunde zahlungsfähig ist oder nicht.",
      "Assoziation erkennt Zusammenhänge zwischen Attributen, z. B. 'Wer Bier kauft, kauft auch Chips'.",
      "Clustering gruppiert Daten in ähnliche Gruppen, ohne vorher bekannte Klassen.",
      "Numerische Vorhersage sagt einen konkreten Zahlenwert voraus, z. B. zukünftigen Umsatz."
    ],
    "explanationJa": [
      "分類は、データを事前に定義されたクラスに割り当てる方法です。例：この顧客は支払い能力があるかないか。",
      "アソシエーションは、属性間の関連性を発見するもので、『ビールを買った人はチップスも買う』といった関係を見つけます。",
      "クラスタリングは、既知のクラスがない状態で似たデータをグループにまとめます。",
      "数値予測では、将来の売上など、具体的な数値を予測します。"
    ],
    "originalSlideText": "• Lernverfahren:\n  • Klassifikation\n  • Assoziation\n  • Clustering\n  • Numerische Vorhersage\n• Output sind Konzeptbeschreibungen"
  },
  {
    "id": 22,
    "questionDe": "(s.13) Was ist Klassifikation im Data Mining und wie funktioniert sie?",
    "questionJa": "Data Miningにおける分類とは何か、どのように機能するか説明せよ。",
    "answerDe": [
      "Klassifikation ordnet Daten einer vordefinierten Klasse zu",
      "Beispiel: Kontaktlinsenempfehlung basierend auf Attributen",
      "Typisches Beispiel für ein überwachtes Lernverfahren"
    ],
    "answerJa": [
      "分類とは、データをあらかじめ定められたクラスに割り当てる手法である",
      "例：属性情報に基づくコンタクトレンズの推薦",
      "典型的な教師あり学習（Supervised Learning）である"
    ],
    "explanationDe": [
      "Beim Klassifikationsverfahren wird für jedes neue Datenbeispiel eine Klasse vorhergesagt.",
      "Ein bekanntes Beispiel ist der Kontaktlinsendatensatz: Hier wird auf Basis von Attributen (Alter, Tränenproduktion etc.) entschieden, ob harte, weiche oder keine Linsen empfohlen werden.",
      "Dieses Verfahren ist überwacht – d. h. man kennt die Zielklasse aus den Trainingsdaten und kann die Vorhersagequalität messen."
    ],
    "explanationJa": [
      "分類とは、新しいデータに対してそのクラス（カテゴリ）を予測する手法です。",
      "代表例はコンタクトレンズのデータで、年齢や涙の分泌量などの属性から、どのレンズを使うべきかを分類します。",
      "これは教師あり学習に該当し、あらかじめ正解ラベルが与えられており、予測精度を評価することが可能です。"
    ],
    "originalSlideText": "• Klassifikation\n  • Bsp. Kontaktlinsen:\n    • Aggregiert die Daten\n    • Gibt Empfehlungen, welche Linsen genutzt werden sollen\n• Supervised Lernverfahren\n  • Stellt iterativ neue Ergebnisse bereit für jeden neuen Datenpunkt\n  • Ergebnis ist die „Klasse“ der Beispiele\n  • Erfolg des Lernverfahrens kann beurteilt werden"
  },
  {
    "id": 23,
    "questionDe": "(s.14) Was charakterisiert Assoziationslernen im Data Mining?",
    "questionJa": "Data Miningにおけるアソシエーション学習の特徴を述べよ。",
    "answerDe": [
      "Deckt interessante Strukturen in Daten auf",
      "Kann mehrere Attribute gleichzeitig vorhersagen",
      "Basiert oft auf Mindestanzahl und Genauigkeit der Regeln"
    ],
    "answerJa": [
      "データ中の興味深い構造を明らかにする",
      "複数の属性を同時に予測可能",
      "ルールの最低出現数や精度に基づいている"
    ],
    "explanationDe": [
      "Assoziationslernen identifiziert Beziehungen zwischen Attributen – z. B. wenn jemand Produkt A kauft, dann auch Produkt B.",
      "Es können nicht nur Klassen, sondern beliebige Attributwerte vorhergesagt werden, z. B. Geschlecht, Alter und Kaufverhalten.",
      "Assoziationsregeln müssen oft ein Mindestmaß an Unterstützung (Support) und Genauigkeit (Confidence) erfüllen.",
      "Typischerweise wird es für kategoriale Daten verwendet."
    ],
    "explanationJa": [
      "アソシエーション学習では、属性同士の関係性（関連ルール）を発見します。例：『商品Aを買った人は商品Bも買う』など。",
      "クラスだけでなく、性別・年齢・購買傾向など任意の属性値を予測可能です。",
      "ルールの妥当性を保つために、一定の出現頻度（サポート）や信頼度（コンフィデンス）が必要です。",
      "主にカテゴリデータに対して使われることが多いです。"
    ],
    "originalSlideText": "• Assoziationen\n  • Offenlegung von interessanten Strukturen in Daten\n  • Kann jedes Attribut Vorhersagen, nicht nur die Klasse\n  • Kann mehr als einen Attributwert vorhersagen\n  • Es gibt wesentlich mehr Assoziationsregeln als Klassifikationsregeln\n  • Regeln basieren oft auf einem Minimum an notwendigen Daten\n  • Regeln brauchen oft eine minimales Level an Genauigkeit\n  • Notwendige Prüfung, ob die Regeln sinnvoll sind\n  • Typischerweise für kategoriale Daten"
  },
  {
    "id": 24,
    "questionDe": "(s.15) Was ist Clustering im Data Mining und welche Herausforderungen bestehen dabei?",
    "questionJa": "Data Miningにおけるクラスタリングとは何か、またその際の課題を述べよ。",
    "answerDe": [
      "Clustering gruppiert Daten ohne vordefinierte Klassen",
      "Herausforderungen: Finden der Cluster, Zuordnung neuer Instanzen",
      "Analyse der Sinnhaftigkeit des Ergebnisses oft subjektiv"
    ],
    "answerJa": [
      "クラスタリングは、あらかじめクラスが定義されていないデータをグループ化する手法である",
      "課題：クラスタの発見と新しいインスタンスの割り当て",
      "結果の有効性の評価が主観的になりやすい"
    ],
    "explanationDe": [
      "Clustering ist ein unüberwachtes Verfahren, das ähnliche Datenpunkte zu Gruppen (Clustern) zusammenfasst, ohne dass vorher Klassen definiert sind.",
      "Ein Beispiel wäre die Gruppierung von Kunden nach ihrem Kaufverhalten, ohne vorher festzulegen, welche Gruppen es geben soll.",
      "Herausforderungen sind u. a.: Wie viele Cluster soll man erzeugen? Wie werden neue Daten zugeordnet? Und: Ist das Ergebnis sinnvoll?",
      "Manchmal wird Clustering auch mit Klassifikation kombiniert, um später neue Instanzen einzuordnen."
    ],
    "explanationJa": [
      "クラスタリングは教師なし学習の一種で、似ているデータ同士を自動的にグループ（クラスタ）に分ける手法です。事前にクラスラベルは必要ありません。",
      "例：顧客の購買傾向に基づいて、あらかじめグループを定義せずに似た顧客同士を分類することなど。",
      "主な課題は、いくつクラスタを作るべきか、新しいデータをどう割り当てるか、そして結果が妥当かどうかをどう判断するかです。",
      "分類と組み合わせて、新しいインスタンスにあとからクラスを割り当てるという応用もあります。"
    ],
    "originalSlideText": "• Clustering\n  • Keine spezifischen Klassen\n  • Gruppiert Daten in ähnliche Gruppen\n  • Herausforderungen:\n    • Finden der Cluster\n    • Zuordnung von neuen Instanzen\n  • Wie viele Cluster braucht man?\n  • Subjektive Analyse, ob das Ergebnis sinnvoll ist\n  • Kann mit nachträglicher Klassifikation kombiniert werden, um neue Instanzen hinzuzufügen"
  },
  {
    "id": 25,
    "questionDe": "(s.16) Was versteht man unter numerischer Vorhersage im Data Mining und worauf kommt es dabei an?",
    "questionJa": "Data Miningにおける数値予測とは何か、それを行う上で重要な点を述べよ。",
    "answerDe": [
      "Variante der Klassifikation mit numerischem Ergebnis",
      "Vorhersage von konkreten Zahlenwerten statt Kategorien",
      "Wichtig ist die Struktur der Beschreibung, nicht einzelne Vorhersagen"
    ],
    "answerJa": [
      "分類の変種で、予測結果がカテゴリでなく数値となるもの",
      "カテゴリーではなく、具体的な数値を予測する",
      "個々の予測値ではなく、記述の構造（重要属性や属性間関係）が重要"
    ],
    "explanationDe": [
      "Numerische Vorhersage (z. B. Regression) zielt darauf ab, kontinuierliche Werte wie Einkommen, Temperatur oder Umsatz vorherzusagen.",
      "Anders als bei der Klassifikation ist das Ergebnis kein Label, sondern ein Zahlenwert.",
      "Besonders wichtig ist die Struktur der zugrunde liegenden Regeln: Welche Attribute sind wichtig, und wie hängen sie zusammen?",
      "Die genaue Vorhersage einzelner neuer Instanzen ist weniger entscheidend als ein gutes Verständnis der zugrunde liegenden Beziehungen."
    ],
    "explanationJa": [
      "数値予測（たとえば回帰分析）では、収入・気温・売上などの連続値を予測します。",
      "分類と違い、予測結果はカテゴリではなく具体的な数値です。",
      "この場合、ルールの正確さよりも、どの属性が重要か、属性同士の関係がどうなっているかなど、説明構造そのものが重要になります。",
      "新しい個別インスタンスへの予測精度よりも、全体の傾向を把握することが重視されます。"
    ],
    "originalSlideText": "• Numerische Vorhersage\n  • Variante der Klassifikation\n  • Ergebnis ist ein numerischer Wert statt eine Kategorie\n  • Vorhersage von neuen Instanzen eher unwichtig\n• Wichtiger ist meist die Struktur der Beschreibung\n  • Wichtige Attribute\n  • Relation der Attribute"
  }  
  
  
  
  
  
  
  
  
  
  
  
  
  

  

  

  
  
  
  
  
  
   
  
  





]
